{
    "categories": [
        {
            "name": "Seguridad"
        },
        {
            "name": "Topología de red y conectividad"
        },
        {
            "name": "BC y RD"
        },
        {
            "name": "Gobernabilidad y seguridad"
        },
        {
            "name": "Gobernanza de costos"
        },
        {
            "name": "Operaciones"
        },
        {
            "name": "Implementación de aplicaciones"
        }
    ],
    "items": [
        {
            "category": "BC y RD",
            "cost": 1,
            "description": "Aproveche la redundancia de zona para garantizar una alta disponibilidad en caso de errores a nivel de zona. Utilice los niveles Premium V2/V3 o Isolated v2, que proporcionan compatibilidad con implementaciones con redundancia de zona y garantizan un tiempo de inactividad mínimo durante los desastres.",
            "guid": "b32e1aa1-4813-4602-88fe-27ca2891f421",
            "id": "01.01.01",
            "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/app-service-web-app/zone-redundant?source=recommendations",
            "service": "App Services",
            "severity": "Bajo",
            "subcategory": "Alta disponibilidad",
            "text": "Implemente una arquitectura de aplicaciones web de línea base con redundancia de zona de alta disponibilidad. Asegúrese de que Azure App Service esté en los niveles Premium v2/V3 o Aislado v2 para obtener compatibilidad con redundancia de zona.",
            "waf": "Fiabilidad"
        },
        {
            "category": "BC y RD",
            "cost": 1,
            "description": "Aproveche las ranuras de preparación para implementaciones sin tiempo de inactividad y copias de seguridad automatizadas para garantizar la recuperación ante desastres. Elija el nivel adecuado (Estándar o Premium) en función del número de ranuras y los requisitos de recuperación ante desastres.",
            "graph": "resources | where type =~ 'microsoft.web/serverfarms' | extend compliant = (sku.tier == 'Premium' or sku.tier == 'Standard') | distinct id,compliant",
            "guid": "e4b31c6a-2e3f-4df1-8e8b-9c3aa5a27820",
            "id": "01.01.02",
            "link": "https://learn.microsoft.com/azure/app-service/overview-hosting-plans",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Alta disponibilidad",
            "text": "Utilice los niveles Premium y Estándar para las ranuras de almacenamiento provisional y las copias de seguridad automatizadas. Alinee el período de retención de copias de seguridad con las necesidades de recuperación ante desastres.",
            "waf": "Fiabilidad"
        },
        {
            "category": "BC y RD",
            "cost": 1,
            "description": "Las zonas de disponibilidad proporcionan aislamiento físico en los centros de datos de una región, lo que reduce el tiempo de inactividad durante las interrupciones. Compruebe que su región es compatible con las zonas de disponibilidad y use los niveles Premium V2/V3 para las implementaciones con redundancia de zona.",
            "guid": "a7e2e6c2-491f-4fa4-a82b-521d0bc3b202",
            "id": "01.01.03",
            "link": "https://learn.microsoft.com/azure/reliability/migrate-app-service",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Alta disponibilidad",
            "text": "Aproveche las zonas de disponibilidad donde corresponda regionalmente (se requiere el nivel Premium V2/V3). Compruebe la compatibilidad regional con las zonas de disponibilidad.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Operaciones",
            "cost": 1,
            "description": "Habilite las comprobaciones de estado para detectar instancias en mal estado en tiempo real y reemplazarlas automáticamente para mantener la alta disponibilidad y la confiabilidad de las aplicaciones.",
            "graph": "appserviceresources  | where type =~ 'microsoft.web/sites/config' | extend compliant = (properties.HealthCheckPath != '') | distinct id,compliant",
            "guid": "1275e4a9-7b6a-43c3-a9cd-5ee18d8995ad",
            "id": "01.01.04",
            "link": "https://learn.microsoft.com/azure/app-service/monitor-instances-health-check",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Monitorización",
            "text": "Implemente comprobaciones de estado para supervisar y detectar problemas con las instancias de App Service. Las comprobaciones de estado permiten el reemplazo automático de instancias en caso de error.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Operaciones",
            "cost": 1,
            "description": "Siga los procedimientos recomendados para configurar copias de seguridad y restauraciones en Azure App Service y ASE para garantizar la disponibilidad de los datos y garantizar la recuperación durante escenarios de desastre.",
            "guid": "35a91c5d-4ad6-4d9b-8e0f-c47db9e6d1e7",
            "id": "01.01.05",
            "link": "https://learn.microsoft.com/azure/app-service/manage-backup",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Servicio multiinquilino",
            "text": "Consulte los procedimientos recomendados de copia de seguridad y restauración para Azure App Service y App Service Environments (ASE) para garantizar la disponibilidad y recuperación de datos.",
            "waf": "Fiabilidad"
        },
        {
            "category": "BC y RD",
            "cost": 1,
            "description": "Garantice la alta disponibilidad incorporando el escalado, la tolerancia a errores, la supervisión y la redundancia de zona en la arquitectura de App Service. Aproveche las comprobaciones de estado y las zonas de disponibilidad para mantener el tiempo de actividad.",
            "guid": "e68cd0ec-afc6-4bd8-a27f-7860ad9a0db2",
            "id": "01.01.06",
            "link": "https://learn.microsoft.com/azure/architecture/framework/services/compute/azure-app-service/reliability",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Alta disponibilidad",
            "text": "Implemente los procedimientos recomendados de confiabilidad de Azure App Service, incluido el escalado automático, la tolerancia a errores, las comprobaciones de estado y la redundancia de zona.",
            "waf": "Fiabilidad"
        },
        {
            "category": "BC y RD",
            "cost": 1,
            "description": "Prepárese para la recuperación ante desastres mediante la implementación de estrategias de conmutación por error de región. Utilice configuraciones activo-activo y activo-pasivo, conmutación por error automatizada e infraestructura como código (IaC) para una conmutación por error sin interrupciones durante las interrupciones.",
            "guid": "bd2a865c-0835-4418-bb58-4df91a5a9b3f",
            "id": "01.01.07",
            "link": "https://learn.microsoft.com/azure/app-service/manage-disaster-recovery#recover-app-content-only",
            "service": "App Services",
            "severity": "Bajo",
            "subcategory": "Alta disponibilidad",
            "text": "Familiarícese con la conmutación por error de la región de App Service, incluidas las configuraciones activo-activo y activo-pasivo, la conmutación por error automatizada y la implementación de IaC.",
            "waf": "Fiabilidad"
        },
        {
            "category": "BC y RD",
            "cost": 1,
            "description": "Azure App Service ofrece características de confiabilidad integradas, como el escalado, la tolerancia a errores y los contratos de nivel de servicio (SLA). Aproveche estas características para mantener un rendimiento constante durante las interrupciones.",
            "guid": "f3d2f1e4-e6d4-4b7a-a5a5-e2a9b2c6f293",
            "id": "01.02.02",
            "link": "https://learn.microsoft.com/azure/reliability/reliability-app-service",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Alta disponibilidad",
            "text": "Familiarícese con la compatibilidad con la confiabilidad de Azure App Service, incluidas las opciones de escalado, los acuerdos de nivel de servicio y los mecanismos de recuperación automatizados.",
            "waf": "Fiabilidad"
        },
        {
            "category": "BC y RD",
            "cost": 1,
            "description": "La habilitación de \"Siempre activado\" para las aplicaciones de funciones garantiza que la aplicación no quede inactiva, manteniendo su disponibilidad y capacidad de respuesta en todo momento.",
            "guid": "c7b5f3d1-0569-4fd2-9f32-c0b64e9c0c5e",
            "id": "01.02.03",
            "link": "https://learn.microsoft.com/azure/azure-functions/dedicated-plan#always-on",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Alta disponibilidad",
            "text": "Asegúrese de que \"Siempre activado\" esté habilitado para las aplicaciones de funciones que se ejecutan en planes de App Service para evitar el inactividad y garantizar la disponibilidad continua.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Operaciones",
            "cost": 1,
            "description": "Las comprobaciones de estado supervisan el estado de las instancias de App Service, lo que permite el reemplazo automático de instancias incorrectas para mantener una alta disponibilidad.",
            "guid": "a3b4d5f6-758c-4f9d-9e1a-d7c6b7e8f9ab",
            "id": "01.02.04",
            "link": "https://learn.microsoft.com/azure/app-service/monitor-instances-health-check",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Monitorización",
            "text": "Supervise las instancias de App Service mediante comprobaciones de estado para detectar instancias incorrectas y reemplazarlas automáticamente.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Operaciones",
            "description": "Aproveche la recuperación automática en Azure App Service para reiniciar automáticamente las instancias o desencadenar acciones personalizadas en función de condiciones de error predefinidas, como umbrales de memoria, errores HTTP o registros de eventos específicos.",
            "guid": "60b3a935-33e5-45c9-87c7-53882e395b46",
            "id": "01.02.05",
            "link": "https://learn.microsoft.com/azure/app-service/overview-diagnostics",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Alta disponibilidad",
            "text": "Use la recuperación automática con reglas personalizadas para reiniciar automáticamente las instancias de App Service cuando se produzcan errores.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Operaciones",
            "cost": 1,
            "guid": "c7d3e5f9-a19c-4833-8ca6-1dcb0128e129",
            "id": "01.03.01",
            "link": "https://learn.microsoft.com/azure/azure-monitor/app/availability-overview",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Monitorización",
            "text": "Supervise la disponibilidad y la capacidad de respuesta de la aplicación web o el sitio web mediante pruebas de disponibilidad de Application Insights, lo que garantiza la detección proactiva de problemas de rendimiento y tiempo de inactividad.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Operaciones",
            "cost": 1,
            "guid": "b4e3f2d5-a5c6-4d7e-8b2f-c5d9e7a8f0ea",
            "id": "01.03.01.01",
            "link": "https://learn.microsoft.com/azure/azure-monitor/app/availability-standard-tests",
            "service": "App Services",
            "severity": "Bajo",
            "subcategory": "Monitorización",
            "text": "Uso de la prueba estándar de Application Insights para supervisar la disponibilidad y la capacidad de respuesta de la aplicación web o el sitio web",
            "waf": "Fiabilidad"
        },
        {
            "category": "Operaciones",
            "cost": 1,
            "description": "Configure alertas de Azure Monitor en función de las métricas de Application Insights para los tiempos de respuesta, las tasas de errores y la disponibilidad general. Las alertas ayudan a detectar problemas de forma proactiva y a reducir el tiempo medio de recuperación (MTTR).",
            "guid": "e52e4514-02a7-4e81-a98e-88ce1b18e557",
            "id": "01.03.02",
            "link": "https://learn.microsoft.com/azure/azure-monitor/app/alerts",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Monitorización",
            "text": "Configure alertas para métricas críticas de Application Insights, como el tiempo de respuesta y las tasas de error.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Seguridad",
            "description": "Azure Key Vault garantiza que los secretos estén cifrados, almacenados de forma segura y a los que solo accedan las aplicaciones autorizadas. Es compatible con el registro de auditoría y el control de versiones secretas, y reduce el riesgo de exposición accidental de información confidencial.",
            "guid": "834ac932-223e-4ce8-8b12-3071a5416415",
            "id": "A01.01",
            "link": "https://learn.microsoft.com/azure/app-service/app-service-key-vault-references",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Protección de datos",
            "text": "Use Azure Key Vault para almacenar los secretos que necesite la aplicación. Key Vault proporciona un entorno seguro, administrado y auditado para almacenar secretos, y se integra sin problemas con App Service a través de las referencias de Key Vault del Servicio de aplicaciones para mejorar la seguridad.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Managed Identity elimina la necesidad de credenciales codificadas de forma rígida al permitir que App Service se autentique en Azure Key Vault de forma segura. Esto reduce el riesgo de exposición de credenciales y simplifica la gestión de secretos para mejorar la seguridad.",
            "guid": "833ea3ad-2c2d-4e73-8165-c3acbef4abe1",
            "id": "A01.02",
            "link": "https://learn.microsoft.com/azure/app-service/app-service-key-vault-references",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Protección de datos",
            "text": "Use la identidad administrada para conectarse de forma segura a Azure Key Vault para acceder a los secretos, a través de las referencias de Key Vault de App Service.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "El almacenamiento de certificados TLS en Azure Key Vault mejora la seguridad al proporcionar una administración centralizada y segura y una renovación automatizada de certificados. Esto reduce el riesgo de errores de manipulación manual y de caducidad de certificados.",
            "guid": "f8d39fda-4776-4831-9c11-5775c2ea55b4",
            "id": "A01.03",
            "link": "https://learn.microsoft.com/azure/app-service/configure-ssl-certificate",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Protección de datos",
            "text": "Use Azure Key Vault para almacenar y administrar de forma segura certificados TLS para App Service.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Para minimizar la exposición y mejorar la seguridad, aísle los sistemas que procesan datos confidenciales. Aproveche los planes de App Service o los entornos de App Service independientes para el aislamiento, y use diferentes suscripciones o grupos de administración para aplicar límites y gobernanza más estrictos.",
            "guid": "6ad48408-ee72-4734-a475-ba18fdbf590c",
            "id": "A01.04",
            "link": "https://learn.microsoft.com/azure/app-service/overview-hosting-plans",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Protección de datos",
            "text": "Aísle los sistemas que procesan información confidencial mediante planes de App Service y entornos de App Service (ASE) independientes y considere diferentes suscripciones o grupos de administración para mejorar la seguridad.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Los discos locales de App Service no están cifrados y los datos confidenciales no deben almacenarse en ellos.  (Por ejemplo: D:\\\\Local y %TMP%).",
            "guid": "e65de8e0-3f9b-4cbd-9682-66abca264f9a",
            "id": "A01.05",
            "link": "https://learn.microsoft.com/azure/app-service/operating-system-functionality#file-access",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Protección de datos",
            "text": "No almacene datos confidenciales en el disco local",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Use Microsoft Entra ID o B2C para la autenticación segura de usuarios y el inicio de sesión único (SSO) en todas las aplicaciones. Integre mediante la característica integrada de autenticación/autorización de App Service para optimizar la seguridad y el cumplimiento con protocolos de autenticación modernos, como OpenID Connect.",
            "guid": "919ca0b2-c121-459e-814b-933df574eccc",
            "id": "A02.01",
            "link": "https://learn.microsoft.com/azure/app-service/overview-authentication-authorization",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Control de identidad y acceso",
            "text": "Use Microsoft Entra ID o B2C para la autenticación segura y el inicio de sesión único (SSO).",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Asegúrese de que todas las implementaciones de código en App Service se originen en un entorno controlado y seguro, como una canalización de DevOps bien administrada. Esta práctica mitiga el riesgo de implementar código no autorizado o malintencionado mediante la aplicación del control de versiones, la verificación de código y el alojamiento seguro.",
            "guid": "3f9bcbd4-6826-46ab-aa26-4f9a19aed9c5",
            "id": "A02.02",
            "link": "https://learn.microsoft.com/azure/app-service/deploy-best-practices",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Control de identidad y acceso",
            "text": "Implemente código en App Service desde un entorno seguro y de confianza.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Deshabilite la autenticación básica para FTP/FTPS y WebDeploy/SCM para mejorar la seguridad mediante la aplicación de puntos de conexión protegidos por Microsoft Entra ID para la implementación. Esto garantiza que solo los usuarios autenticados con credenciales de Microsoft Entra ID puedan acceder a los servicios de implementación, incluido el sitio de SCM.",
            "guid": "5d04c2c3-919c-4a0b-8c12-159e114b933d",
            "id": "A02.03",
            "link": "https://learn.microsoft.com/azure/app-service/deploy-configure-credentials#disable-basic-authentication",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Control de identidad y acceso",
            "text": "Deshabilite la autenticación básica para FTP/FTPS y WebDeploy/SCM.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Siempre que sea posible, use Managed Identity para conectarse de forma segura a los recursos protegidos por Microsoft Entra ID sin almacenar credenciales. Si esto no es factible, almacene los secretos en Azure Key Vault y acceda a ellos mediante Managed Identity para mantener la seguridad y reducir el riesgo de exposición de credenciales.",
            "guid": "f574eccc-d9bd-43ba-bcda-3b54eb2eb03d",
            "id": "A02.04",
            "link": "https://learn.microsoft.com/azure/app-service/overview-managed-identity?tabs=portal%2Chttp",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Control de identidad y acceso",
            "text": "Use Managed Identity para conectarse a los recursos protegidos de Microsoft Entra ID.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Al usar imágenes almacenadas en Azure Container Registry, extraiga estas imágenes mediante una identidad administrada para evitar almacenar credenciales. Esto garantiza un acceso seguro a las imágenes de los contenedores y reduce el riesgo de exposición de credenciales.",
            "guid": "d9a25827-18d2-4ddb-8072-5769ee6691a4",
            "id": "A02.05",
            "link": "https://learn.microsoft.com/azure/app-service/configure-custom-container#use-managed-identity-to-pull-image-from-azure-container-registry",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Control de identidad y acceso",
            "text": "Extraiga imágenes de contenedor de Azure Container Registry mediante una identidad administrada.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Configure las opciones de diagnóstico para enviar registros de telemetría y seguridad (incluidos los registros de HTTP, de plataforma y de auditoría) a Log Analytics. El registro centralizado mejora la supervisión, la detección de amenazas y los informes de cumplimiento.",
            "guid": "47768314-c115-4775-a2ea-55b46ad48408",
            "id": "A03.01",
            "link": "https://learn.microsoft.com/azure/app-service/troubleshoot-diagnostic-logs",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Registro y monitoreo",
            "text": "Envíe registros de seguridad y tiempo de ejecución de App Service a Log Analytics para una supervisión y alertas centralizadas.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Configure una configuración de diagnóstico para enviar el registro de actividad a Log Analytics como destino central para el registro y la supervisión. Esto le permite supervisar la actividad del plano de control en el propio recurso de App Service.",
            "guid": "ee72734b-475b-4a18-bdbf-590ce65de8e0",
            "id": "A03.02",
            "link": "https://learn.microsoft.com/azure/azure-monitor/essentials/activity-log",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Registro y monitoreo",
            "text": "Envío de registros de actividad de App Service a Log Analytics",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Use la integración regional de redes virtuales, los grupos de seguridad de red (NSG) y las rutas definidas por el usuario (UDR) para controlar el acceso a la red de salida. Enrute el tráfico a través de una aplicación virtual de red (NVA), como Azure Firewall, y supervise los registros del firewall para asegurarse de que el tráfico se controla y protege correctamente.",
            "guid": "c12159e1-14b9-433d-b574-ecccd9bd3baf",
            "id": "A04.01",
            "link": "https://learn.microsoft.com/azure/app-service/overview-vnet-integration",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Seguridad de la red",
            "text": "Controle el acceso a la red de salida para App Service mediante la integración de redes virtuales, grupos de seguridad de red, UDR y firewalls.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Proporcione una dirección IP de salida estable mediante la integración de red virtual con una puerta de enlace NAT o una aplicación virtual de red (NVA) como Azure Firewall. Esto permite a la parte receptora incluir en la lista de permitidos en función de la IP, si es necesario. Para las comunicaciones con los servicios de Azure, use mecanismos como puntos de conexión de servicio o puntos de conexión privados para evitar depender de direcciones IP estáticas, lo que garantiza una conectividad segura y eficaz.",
            "guid": "cda3b54e-b2eb-403d-b9a2-582718d2ddb1",
            "id": "A04.02",
            "link": "https://learn.microsoft.com/azure/app-service/networking/nat-gateway-integration",
            "service": "App Services",
            "severity": "Bajo",
            "subcategory": "Seguridad de la red",
            "text": "Garantice una dirección IP estable para las comunicaciones salientes mediante la puerta de enlace NAT de red virtual o Azure Firewall.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Controle el acceso a la red entrante mediante la configuración de restricciones de acceso al Servicio de aplicaciones, puntos de conexión de servicio o puntos de conexión privados. Asegúrese de que se establecen las restricciones adecuadas tanto para la aplicación web como para el sitio de SCM (implementación) para limitar el acceso no autorizado y mejorar la seguridad.",
            "guid": "0725769e-e669-41a4-a34a-c932223ece80",
            "id": "A04.03",
            "link": "https://learn.microsoft.com/azure/app-service/networking-features#access-restrictions",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Seguridad de la red",
            "text": "Controle el acceso a la red entrante mediante restricciones de acceso, puntos de conexión de servicio o puntos de conexión privados.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Proteja App Service del tráfico entrante malintencionado mediante la implementación de un firewall de aplicaciones web (WAF) mediante Azure Application Gateway o Azure Front Door. Asegúrese de que los registros de WAF se supervisen con regularidad para detectar y responder a las amenazas de seguridad.",
            "guid": "b123071a-5416-4415-a33e-a3ad2c2de732",
            "id": "A04.04",
            "link": "https://learn.microsoft.com/azure/app-service/networking/app-gateway-with-service-endpoints",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Seguridad de la red",
            "text": "Use un firewall de aplicaciones web (WAF) delante de App Service.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Para evitar que se omita el firewall de aplicaciones web (WAF), bloquee el acceso a App Service mediante restricciones de acceso, puntos de conexión de servicio y puntos de conexión privados. Esto garantiza que todo el tráfico se enrute a través del WAF, proporcionando una capa frontal segura de protección.",
            "guid": "165c3acb-ef4a-4be1-b8d3-9fda47768314",
            "id": "A04.05",
            "link": "https://learn.microsoft.com/azure/app-service/networking-features#access-restrictions",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Seguridad de la red",
            "text": "Asegúrese de que el WAF no se puede omitir protegiendo el acceso a App Service.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Asegúrese de que la política de TLS mínima esté establecida en 1.2 o superior, con preferencia por TLS 1.3, para mejorar la seguridad a través de protocolos de cifrado más seguros. TLS 1.3 proporciona mejoras de seguridad adicionales y tiempos de enlace más rápidos, lo que reduce las vulnerabilidades asociadas con versiones anteriores.",
            "graph": "appserviceresources | where type =~ 'microsoft.web/sites/config' | extend compliant = (properties.MinTlsVersion>=1.2) | distinct id,compliant",
            "guid": "c115775c-2ea5-45b4-9ad4-8408ee72734b",
            "id": "A04.06",
            "link": "https://learn.microsoft.com/azure/app-service/configure-ssl-bindings#enforce-tls-versions",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Seguridad de la red",
            "text": "Establezca la directiva TLS mínima en 1.2 o superior, preferiblemente 1.3, en la configuración de App Service.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Configure App Service para aplicar solo HTTPS, redirigiendo automáticamente todo el tráfico HTTP a HTTPS. Además, implemente HTTP Strict Transport Security (HSTS) en su código o a través de un firewall de aplicaciones web (WAF) para garantizar que los navegadores solo accedan al sitio a través de HTTPS, mejorando la seguridad al evitar ataques de degradación.",
            "graph": "where (type=='microsoft.web/sites' and (kind == 'app' or kind == 'app,linux' )) | extend compliant = (properties.httpsOnly==true) | distinct id,compliant",
            "guid": "475ba18f-dbf5-490c-b65d-e8e03f9bcbd4",
            "id": "A04.07",
            "link": "https://learn.microsoft.com/azure/app-service/configure-ssl-bindings#enforce-https",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Seguridad de la red",
            "text": "Use solo HTTPS y considere la posibilidad de habilitar HTTP Strict Transport Security (HSTS).",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "No utilice comodines (*) en la configuración de CORS, ya que esto permite el acceso sin restricciones desde cualquier origen, lo que compromete la seguridad. En su lugar, especifique explícitamente los orígenes de confianza que pueden acceder al servicio, lo que garantiza un acceso controlado.",
            "guid": "68266abc-a264-4f9a-89ae-d9c55d04c2c3",
            "id": "A04.08",
            "link": "https://learn.microsoft.com/azure/app-service/app-service-web-tutorial-rest-api",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Seguridad de la red",
            "text": "Evite el uso de comodines para CORS; Especifique explícitamente los orígenes permitidos.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "La depuración remota no debe estar habilitada en producción, ya que abre puertos adicionales, lo que aumenta la superficie de ataque. Aunque App Service desactiva automáticamente la depuración remota después de 48 horas, se recomienda deshabilitarla manualmente en producción para mantener un entorno seguro.",
            "graph": "appserviceresources | where type =~ 'microsoft.web/sites/config' | extend compliant = (properties.RemoteDebuggingEnabled == false) | distinct id,compliant",
            "guid": "d9bd3baf-cda3-4b54-bb2e-b03dd9a25827",
            "id": "A04.09",
            "link": "https://learn.microsoft.com/azure/app-service/configure-common#configure-general-settings",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Seguridad de la red",
            "text": "Desactive la depuración remota en entornos de producción.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Habilite Defender para App Service.  Esto (entre otras amenazas) detecta las comunicaciones a direcciones IP maliciosas conocidas.  Revise las recomendaciones de Defender para App Service como parte de las operaciones.",
            "guid": "18d2ddb1-0725-4769-be66-91a4834ac932",
            "id": "A04.10",
            "link": "https://learn.microsoft.com/azure/defender-for-cloud/defender-for-app-service-introduction",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Seguridad de la red",
            "text": "Habilitación de Defender for Cloud - Defender for App Service",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Azure proporciona protección básica contra DDoS en su red, que se puede mejorar con funcionalidades inteligentes de DDoS Standard que aprenden sobre los patrones de tráfico normales y pueden detectar comportamientos inusuales. DDoS Standard se aplica a una red virtual, por lo que debe configurarse para el recurso de red delante de la aplicación, como Application Gateway o una NVA.",
            "guid": "223ece80-b123-4071-a541-6415833ea3ad",
            "id": "A04.11",
            "link": "https://learn.microsoft.com/azure/ddos-protection/ddos-protection-overview",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Seguridad de la red",
            "text": "Habilitación del estándar de protección DDoS en la red virtual de WAF",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Al usar imágenes almacenadas en Azure Container Registry, asegúrese de que se extraigan de una red virtual mediante un punto de conexión privado y configure la configuración de la aplicación \"WEBSITE_PULL_IMAGE_OVER_VNET\". Esto garantiza una comunicación segura entre App Service y el Registro, lo que evita la exposición a la red pública de Internet.",
            "guid": "2c2de732-165c-43ac-aef4-abe1f8d39fda",
            "id": "A04.12",
            "link": "https://learn.microsoft.com/azure/app-service/configure-custom-container#use-an-image-from-a-network-protected-registry",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Seguridad de la red",
            "text": "Extraiga imágenes de contenedor a través de una red virtual desde Azure Container Registry.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Realice una prueba de penetración en la aplicación web de acuerdo con las reglas de interacción de las pruebas de penetración de Azure. Esto ayuda a identificar vulnerabilidades y debilidades de seguridad que se pueden abordar antes de que se exploten.",
            "guid": "eb2eb03d-d9a2-4582-918d-2ddb10725769",
            "id": "A05.01",
            "link": "https://learn.microsoft.com/azure/security/fundamentals/pen-testing",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Pruebas de penetración",
            "text": "Realizar una prueba de penetración en la aplicación web.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Asegúrese de que solo el código de confianza, que ha sido validado y analizado en busca de vulnerabilidades, se implemente en producción siguiendo las prácticas de DevSecOps. Esto minimiza el riesgo de introducir vulnerabilidades de seguridad en el entorno de la aplicación.",
            "guid": "19aed9c5-5d04-4c2c-9919-ca0b2c12159e",
            "id": "A06.01",
            "link": "https://learn.microsoft.com/azure/architecture/solution-ideas/articles/devsecops-in-azure",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Gestión de vulnerabilidades",
            "text": "Implemente código validado y analizado de vulnerabilidades.",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Asegúrese de que se utilizan las versiones más recientes de las plataformas, lenguajes de programación, protocolos y marcos compatibles. Las actualizaciones periódicas mitigan el riesgo de vulnerabilidades de seguridad y garantizan la compatibilidad con los parches de seguridad.",
            "guid": "114b933d-f574-4ecc-ad9b-d3bafcda3b54",
            "id": "A06.02",
            "link": "https://learn.microsoft.com/azure/app-service/overview-patch-os-runtime",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Gestión de vulnerabilidades",
            "text": "Utilice plataformas, lenguajes, protocolos y marcos actualizados",
            "waf": "Seguridad"
        },
        {
            "category": "Gobernanza de costos",
            "cost": 1,
            "description": "Aproveche Azure Cost Management para realizar un seguimiento y pronosticar los gastos de App Service. Configure alertas para los umbrales de presupuesto a fin de evitar gastos excesivos y optimice los costos en función de las tendencias de utilización de recursos.",
            "guid": "42eb48f0-28ff-497c-b2c0-a8fa1f989832",
            "id": "C01.01",
            "link": "https://learn.microsoft.com/azure/cost-management-billing/",
            "service": "App Services",
            "severity": "Bajo",
            "subcategory": "Monitoreo de costos",
            "text": "Supervise los costos de App Service con Azure Cost Management y cree alertas de costos.",
            "waf": "Costar"
        },
        {
            "category": "Gobernanza de costos",
            "cost": 3,
            "description": "Si tiene un uso predecible y constante de App Service, la compra de instancias reservadas puede reducir significativamente los costos a largo plazo. Comprométase a uno o tres años para obtener precios más bajos en comparación con el pago por uso.",
            "guid": "e489221b-487e-48a3-aaab-48e3d205ca12",
            "id": "C01.02",
            "link": "https://learn.microsoft.com/azure/cost-management-billing/reservations/",
            "service": "App Services",
            "severity": "Medio",
            "subcategory": "Optimización de costos",
            "text": "Compre instancias reservadas para los planes de App Service a fin de optimizar los costos a largo plazo.",
            "waf": "Costar"
        },
        {
            "category": "Gobernabilidad y seguridad",
            "cost": 2,
            "description": "Use Azure Policy para aplicar configuraciones de seguridad, cumplimiento y gobernanza para App Service. Las directivas pueden garantizar que la configuración crítica, como las versiones de TLS, las configuraciones de copia de seguridad y las restricciones de red, se aplique en todas las instancias de App Service.",
            "guid": "361e886f-ca40-4ead-a8e9-1379c642ae9c",
            "id": "G01.01",
            "link": "https://learn.microsoft.com/azure/governance/policy/overview",
            "service": "App Services",
            "severity": "Alto",
            "subcategory": "Conformidad",
            "text": "Aplique Azure Policy para exigir el cumplimiento en todas las configuraciones de App Service.",
            "waf": "Gobernanza"
        }
    ],
    "metadata": {
        "name": "Azure App Service Review",
        "state": "Preview",
        "timestamp": "October 01, 2024",
        "waf": "all"
    },
    "severities": [
        {
            "name": "Alto"
        },
        {
            "name": "Medio"
        },
        {
            "name": "Bajo"
        }
    ],
    "status": [
        {
            "description": "Esta comprobación aún no se ha examinado",
            "name": "No verificado"
        },
        {
            "description": "Hay un elemento de acción asociado a esta comprobación",
            "name": "Abrir"
        },
        {
            "description": "Esta comprobación se ha verificado y no hay más elementos de acción asociados a ella",
            "name": "Cumplido"
        },
        {
            "description": "No aplicable para el diseño actual",
            "name": "N/A"
        },
        {
            "description": "No es necesario",
            "name": "No es necesario"
        }
    ],
    "waf": [
        {
            "name": "Fiabilidad"
        },
        {
            "name": "Seguridad"
        },
        {
            "name": "Costar"
        },
        {
            "name": "Operaciones"
        },
        {
            "name": "Rendimiento"
        }
    ],
    "yesno": [
        {
            "name": "Sí"
        },
        {
            "name": "No"
        }
    ]
}