{
  "status": [
    {
      "name": "Não verificado",
      "description": "Este cheque ainda não foi examinado."
    },
    {
      "name": "Abrir",
      "description": "Há um item de ação associado a este cheque"
    },
    {
      "name": "Cumprido",
      "description": "Esta verificação foi verificada, e não há mais itens de ação associados a ele"
    },
    {
      "name": "Não é necessário",
      "description": "Recomendação compreendida, mas não necessária pelos requisitos atuais"
    },
    {
      "name": "N/A",
      "description": "Não é aplicável para o design atual"
    }
  ],
  "metadata": {
    "name": "Análise de desktop virtual do Azure"
  },
  "items": [
    {
      "category": "Fundação",
      "subcategory": "Geral",
      "text": "Determine em que as piscinas de host avd da região do Azure/do Azure serão implantadas",
      "description": "O AVD é um serviço não regional, os Grupos de Host podem ser criados em qualquer região, o redirecionamento automático do front-end mais próximo acontecerá automaticamente. ",
      "guid": "42e52f47-21d9-428c-8b1b-d521e44a29a9",
      "severity": "Alto",
      "link": "https://azure.microsoft.com/global-infrastructure/services/?products=virtual-desktop"
    },
    {
      "category": "Fundação",
      "subcategory": "Geral",
      "text": "Determine se a conectividade híbrida é necessária para se conectar ao ambiente local",
      "description": "Se necessário para se conectar ao ambiente local, avalie a opção de conectividade atual ou planeje a conectividade necessária. ",
      "guid": "dd399cfd-7b28-4dc8-9555-6202bfe4563b",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/architecture/reference-architectures/hybrid-networking/"
    },
    {
      "category": "Fundação",
      "subcategory": "Geral",
      "text": "Você avaliou a latência entre a localização dos usuários e a infraestrutura avd do Azure?",
      "description": "Execute a ferramenta 'Windows Virtual Desktop Experience Estimator' para selecionar a melhor região do Azure para implantar Host Pools. Além da latência de 150m, a experiência do usuário pode não ser a ideal. ",
      "guid": "0d834a34-8b26-43e6-bc60-512a26498f6d",
      "severity": "Alto",
      "link": "https://azure.microsoft.com/services/virtual-desktop/assessment/"
    },
    {
      "category": "Fundação",
      "subcategory": "Geral",
      "text": "Determine a localização dos metadados para o serviço AVD",
      "description": "Os metadados da loja AVD apenas para executar o serviço em locais geográficos específicos, determinar o que está disponível hoje e se for adequado com base nas necessidades do cliente. ",
      "guid": "bad37ead-53cc-47ce-8d7a-aab3571449ab",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/data-locations"
    },
    {
      "category": "Fundação",
      "subcategory": "Geral",
      "text": "Verifique as cotas do Azure e a disponibilidade para tamanhos de VM específicos nas regiões selecionadas",
      "description": "Verifique se há SKUs VM específicos, especialmente se você precisa de GPU ou SKUs de alta especificação e, eventualmente, disponibilidade de arquivos do Azure NetApp, se usado. ",
      "guid": "8053d89e-89dc-47b3-9be2-a1a27f7a9e91",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/azure-resource-manager/management/azure-subscription-service-limits"
    },
    {
      "category": "Fundação",
      "subcategory": "Geral",
      "text": "Verifique a disponibilidade da Zona de Disponibilidade (AZ) na região selecionada",
      "description": "Consulte a seção BCDR para obter mais detalhes.",
      "guid": "be1f38ce-f398-412b-b463-cbbac89c199d",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/availability-zones/az-region"
    },
    {
      "category": "Fundação",
      "subcategory": "Clientes e Usuários",
      "text": "Avalie quantos usuários se conectarão ao AVD e de quais regiões",
      "description": "Para o planejamento e implantação adequados, é importante fazer o máximo número de usuários e as sessões simultâneas médias. ",
      "guid": "bb91a33d-90ca-4e2c-a881-3706f7c0cb9f",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/faq"
    },
    {
      "category": "Fundação",
      "subcategory": "Clientes e Usuários",
      "text": "Determine se todos os usuários terão o mesmo conjunto de aplicativos e/ou diferentes configurações do Host Pool e/ou imagens do SISTEMA OPERACIONAL",
      "description": "Mutiple Host Pools talvez necessário para suportar diferentes conjuntos de usuários, é recomendável estimar quantos serão necessários. ",
      "guid": "a1cf2049-9013-4a5d-9ce4-74dbcbd8682a",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/environment-setup"
    },
    {
      "category": "Fundação",
      "subcategory": "Clientes e Usuários",
      "text": "Avalie as dependências externas de cada Pool de Host",
      "description": "As dependências de recursos externos ao pool AVD devem ser avaliadas e revisadas, por exemplo, Active Directory, compartilhamentos externos de arquivos ou outros armazenamentos, serviços e recursos no local, componentes de infraestrutura de rede como VPN e ou Express Route, serviços externos e componentes de terceiros. Para todos esses recursos, a latência do Pool de Host AVD precisa ser avaliada e a conectividade considerada. Além disso, as considerações do BCDR também precisam ser aplicadas a essas dependências.",
      "guid": "6abca2a4-fda1-4dbf-9dc9-5d48c7c791dc",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/overview"
    },
    {
      "category": "Fundação",
      "subcategory": "Clientes e Usuários",
      "text": "Revise o sistema operacional usado do cliente e o tipo de cliente AVD",
      "description": "Revise as limitações de cada cliente e compare várias opções quando possível.",
      "guid": "a1f6d565-99e5-458b-a37d-4985e1112dbd",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/connect-windows-7-10"
    },
    {
      "category": "Fundação",
      "subcategory": "Clientes e Usuários",
      "text": "Verifique os requisitos de licenciamento",
      "description": "Os clientes que estão devidamente licenciados para executar cargas de trabalho do Windows Virtual Desktop são elegíveis para aplicar uma licença do Windows em suas máquinas virtuais de host de sessão e executá-las sem pagar por outra licença.",
      "guid": "7ba012e7-b94e-4f6e-847d-2ea2992b1cd6",
      "severity": "Baixo",
      "link": "https://azure.microsoft.com/pricing/details/virtual-desktop/"
    },
    {
      "category": "Fundação",
      "subcategory": "Clientes e Usuários",
      "text": "Execute um PoC para testar a experiência do usuário de ponta a ponta para verificar o impacto causado pela latência da rede",
      "description": "Dependendo das localizações do usuário e da implantação da região AVD, os usuários podem ter uma experiência não ideal, por isso é importante testar o mais rápido possível em um pequeno ambiente PoC. ",
      "guid": "d2f54b29-769e-43a6-a1e8-838ac936667e",
      "severity": "Alto",
      "link": "https://azure.microsoft.com/services/virtual-desktop/assessment/"
    },
    {
      "category": "Fundação",
      "subcategory": "Clientes e Usuários",
      "text": "Determine se os usuários acessarão o AVD usando desktops completos e/ou aplicativos remotos ",
      "description": "Determine se os usuários serão oferecidos desktops completos e/ou grupos de aplicativos remotos. ",
      "guid": "13c00567-4b1e-4945-a459-837ee7ad6c6d",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/manage-app-groups"
    },
    {
      "category": "Fundação",
      "subcategory": "Clientes e Usuários",
      "text": "Todos os usuários terão as mesmas configurações de RDP? ",
      "description": "As configurações de RDP atualmente só podem ser configuradas no nível do pool host, não por usuário/grupo.",
      "guid": "3b365a5c-7acb-4e48-abe5-4cd79f2e8776",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/customize-rdp-properties"
    },
    {
      "category": "Fundação",
      "subcategory": "Clientes e Usuários",
      "text": "Avalie o RDP ShortPath para clientes conectados a partir de redes internas gerenciadas",
      "description": "RdP Shortpath para redes gerenciadas é um recurso do Azure Virtual Desktop que estabelece um transporte direto baseado em UDP entre o cliente de desktop remoto e o host Session. A remoção do relé extra reduz o tempo de ida e volta, o que melhora a experiência do usuário com aplicativos sensíveis à latência e métodos de entrada. Para suportar o RDP Shortpath, o cliente do Azure Virtual Desktop precisa de uma linha de visão direta para o host da sessão, e deve estar executando o Windows 10 ou o Windows 7 e ter o cliente do Windows Desktop instalado.",
      "guid": "b2074747-d01a-4f61-b1aa-92ad793d9ff4",
      "severity": "Média",
      "link": "https://docs.microsoft.com/en-us/azure/virtual-desktop/shortpath"
    },
    {
      "category": "Fundação",
      "subcategory": "Planejamento de Capacidade",
      "text": "Determine o tipo de pool host a ser usado",
      "description": "Compartilhado/Pooled ou Dedicado/Pessoal",
      "guid": "8468c55a-775c-46e-a5b8-6ad88844ce3b2",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/create-host-pools-azure-marketplace"
    },
    {
      "category": "Fundação",
      "subcategory": "Planejamento de Capacidade",
      "text": "Para o tipo de pool de host pessoal, decida sobre o tipo de atribuição",
      "description": "Confirme que a diferença entre atribuição automática e direta é bem compreendida e a opção selecionada é apropriada para o cenário em questão.",
      "guid": "b38b875b-a1cf-4204-a901-3a5d3ce474db",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/configure-host-pool-personal-desktop-assignment-type"
    },
    {
      "category": "Fundação",
      "subcategory": "Planejamento de Capacidade",
      "text": "Para o tipo pool pooled host pool, decida sobre o método de balanceamento de carga",
      "description": "Verifique quais usar e opções disponíveis, esteja ciente de que, se o autoscalamento for usado, ele define-o como primeiro. ",
      "guid": "cbd8682a-6abc-4a2a-9fda-1dbf3dc95d48",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/host-pool-load-balancing"
    },
    {
      "category": "Fundação",
      "subcategory": "Planejamento de Capacidade",
      "text": "Estime o número de diferentes pools de host para implantar ",
      "description": "Com base em seus critérios de seleção, quantos Pools de Hospedagem você precisaria? Você deve considerar ter vários se:? Várias imagens do SISTEMA OPERACIONAL? Várias regiões? HW diferente necessário? Tipo de pool de host diferente (compartilhado vs. pessoal)? Diferentes requisitos de usuário e SLA (Principais usuários, Executivos, Office Worker vs. Developers, etc.)? Diferentes configurações rdp (aplicadas no nível do Host Pool), veja https://docs.microsoft.com/azure/virtual-desktop/customize-rdp-properties? Número necessário de VMs no pool de host excedendo capacidades máximas",
      "guid": "c7c791dc-a1f6-4d56-999e-558b937d4985",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/environment-setup"
    },
    {
      "category": "Fundação",
      "subcategory": "Planejamento de Capacidade",
      "text": "Execute o teste de desempenho da carga de trabalho para determinar o melhor Azure VM SKU e tamanho a usar (determine o número de hosts por pool)",
      "description": "Use o link fornecido para definir um ponto de partida para a decisão do SKU e, em seguida, valide usando um teste de desempenho. Certifique-se de que um mínimo de 4 núcleos para produção seja selecionado por Host de Sessão (multi-sessão)",
      "guid": "e1112dbd-7ba0-412e-9b94-ef6e047d2ea2",
      "severity": "Média",
      "link": "https://docs.microsoft.com/windows-server/remote/remote-desktop-services/virtual-machine-recs"
    },
    {
      "category": "Fundação",
      "subcategory": "Planejamento de Capacidade",
      "text": "Verifique os limites de escalabilidade do AVD para o ambiente",
      "description": "É fundamental verificar a capa da AVD e os limites relatados no artigo referenciado. ",
      "guid": "992b1cd6-d2f5-44b2-a769-e3a691e8838a",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop"
    },
    {
      "category": "Fundação",
      "subcategory": "Planejamento de Capacidade",
      "text": "Determine se os hosts de sessão exigirão GPU",
      "description": "Os Grupos host com GPU exigem configuração especial, por favor, certifique-se de revisar o artigo referenciado. ",
      "guid": "c936667e-13c0-4056-94b1-e945a459837e",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/configure-vm-gpu"
    },
    {
      "category": "Fundação",
      "subcategory": "Planejamento de Capacidade",
      "text": "Recomendado para usar SKUs VM capazes de aproveitar o recurso de rede acelerada no Azure.",
      "description": "Sempre que possível, recomenda-se aproveitar as SKUs VM com o recurso Accelerated Networking. Hoje, o sistema operacional Windows Server é suportado (veja lista no artigo), no futuro Windows Client OS talvez também incluído. ",
      "guid": "b47a393a-0803-4272-a479-8b1578b219a4",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-network/create-vm-accelerated-networking-powershell"
    },
    {
      "category": "Identidade",
      "subcategory": "Requisitos",
      "text": "Um inquilino do Azure Active Directory deve estar disponível com pelo menos uma assinatura vinculada",
      "description": "Uma assinatura do Azure deve ser parental para o mesmo inquilino do Azure AD, que contém uma rede virtual que contém ou está conectada à instância do Windows Server Active Directory ou do Azure AD DS.",
      "guid": "6ceb5443-5125-4922-9442-93bb628537a5",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/overview"
    },
    {
      "category": "Identidade",
      "subcategory": "Requisitos",
      "text": "Um diretório ativo do Windows Server está em sincronia com o Diretório Ativo do Azure",
      "description": "Você pode configurá-lo usando o Azure AD Connect (para organizações híbridas) ou os Serviços de Domínio Azure (para organizações híbridas ou em nuvem).",
      "guid": "5119bf8e-8f58-4542-a7d9-cec166cd072a",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/overview"
    },
    {
      "category": "Identidade",
      "subcategory": "Requisitos",
      "text": "Verifique os requisitos da Conta do Usuário para se conectar à área virtual do Windows",
      "description": "(1) O usuário deve ser originado do mesmo Active Directory conectado ao Azure AD. O Windows Virtual Desktop não suporta contas B2B ou MSA. (2) O UPN que você usa para assinar o Windows Virtual Desktop deve existir no domínio Active Directory ao que o VM está aderido.",
      "guid": "f9b141a8-98a5-435e-9378-97e71ca7da7b",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/overview"
    },
    {
      "category": "Identidade",
      "subcategory": "Requisitos",
      "text": "Verifique os requisitos de VM para hosts de sessão AVD que serão criados",
      "description": "Os VMs devem ser de domínio padrão ou híbridos unidos por AD. Máquinas virtuais não podem ser aderidas ao Azure AD.",
      "guid": "ea962a15-9394-46da-a7cc-3923266b2258",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/overview"
    },
    {
      "category": "Identidade",
      "subcategory": "Requisitos",
      "text": "Antes de usar os Azure Active Directory Domain Services (AAD-DS) para AVD, certifique-se de rever as limitações. ",
      "description": "Compare os serviços de domínio do Active Directory auto-gerenciados, o Azure Active Directory e o gerenciado Azure Active Directory Domain Services",
      "guid": "6f4a1651-bddd-4ea8-a487-cdeb4861bc3b",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/active-directory-domain-services/compare-identity-solutions"
    },
    {
      "category": "Identidade",
      "subcategory": "Diretório Ativo",
      "text": "Crie pelo menos dois DCs (Active Directory Domain Controllers, controladores de domínio ativos) no ambiente Azure VNET perto do POOL DE HOST AVD",
      "description": "Os DCs de AD no Azure são recomendados para reduzir a latência para os usuários que fazem login em hosts de sessão AVD e, eventualmente, para arquivos do Azure NetApp e integração de AD. ADC precisa ser capaz de falar com DCs para TODOS os domínios infantis. Como alternativa, a conectividade no local deve ser usada para atingir DCs AD. ",
      "guid": "c14aea7e-65e8-4d9a-9aec-218e6436b073",
      "severity": "Média",
      "link": "https://docs.microsoft.com/en-us/azure/architecture/reference-architectures/identity/adds-extend-domain"
    },
    {
      "category": "Identidade",
      "subcategory": "Diretório Ativo",
      "text": "Crie um OU específico no Diretório Ativo para cada Pool host",
      "description": "Recomendado para criar um OU separado por Host Pool sob uma hierarquia de OU separada. Estes OUs conterão contas de máquinas de hosts de sessão AVD. ",
      "guid": "6db55f57-9603-4334-adf9-cc23418db612",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/create-host-pools-azure-marketplace"
    },
    {
      "category": "Identidade",
      "subcategory": "Diretório Ativo",
      "text": "Revise o GPO de domínio que será aplicado ao OU e impactando as funcionalidades VM do Host Pool",
      "description": "Revise cuidadosamente e, eventualmente, bloqueie/filtre a herança de GPOs para as OUs que contêm pools de host AVD. ",
      "guid": "7126504b-b47a-4393-a080-327294798b15",
      "severity": "Média",
      "link": "https://docs.microsoft.com/previous-versions/windows/desktop/Policy/group-policy-hierarchy"
    },
    {
      "category": "Identidade",
      "subcategory": "Diretório Ativo",
      "text": "Crie uma conta de usuário dedicada com apenas permissões para se juntar ao VM ao domínio",
      "description": "Recomendado ter uma conta dedicada específica com permissões específicas, e sem a limitação padrão 10 se junta. ",
      "guid": "347dc560-28a7-41ff-b1cd-15dd2f0d5e77",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/create-host-pools-azure-marketplace"
    },
    {
      "category": "Identidade",
      "subcategory": "Diretório Ativo",
      "text": "Crie um grupo de usuários de domínio para cada conjunto de usuários que terá acesso a cada Grupo de Aplicativos do Pool host (DAG ou RAG)",
      "description": "Evite conceder acesso por usuário, em vez disso, use grupos de AD e replique-os usando ADC no Azure AD. ",
      "guid": "2d41e361-1cc5-47b4-a4b1-410d43958a8c",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/manage-app-groups"
    },
    {
      "category": "Identidade",
      "subcategory": "Diretório Ativo",
      "text": "Revise sua política de expiração de senha da organização para contas usadas pela integração do Azure Files AD",
      "description": "Como parte do procedimento para integrar o Azure File Share e o Active Directory authenticaton, uma conta AD para representar a conta de armazenamento (compartilhamento de arquivos) será criada. Você pode optar por se registrar como uma conta de computador ou conta de logon de serviço, consulte FAQ para obter detalhes. Para contas de computador, há uma idade de validade de senha padrão definida em A em 30 dias. Da mesma forma, a conta de logon do serviço pode ter uma idade de validade de senha padrão definida no domínio AD ou unidade organizacional (OU). Para ambos os tipos de conta, recomendamos que você verifique a idade de validade da senha configurada em seu ambiente de AD e planeje atualizar a senha da identidade da sua conta de armazenamento da conta AD antes da idade máxima da senha. Você pode considerar a criação de uma nova Unidade Organizacional (OU) AD em AD e desativar a política de expiração de senha em contas de computador ou contas de logon de serviço de acordo.",
      "guid": "2289b3d6-b57c-4fc6-9546-1e1a3e3453a33",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/storage/files/storage-files-identity-ad-ds-enable"
    },
    {
      "category": "Rede",
      "subcategory": "Rede",
      "text": "Revise a arquitetura híbrida de conectividade para ambiente local",
      "description": "Que tipo de conectividade híbrida? Rota expressa, VPN, NVA?",
      "guid": "c8639648-a652-4d6c-85e5-02965388e5de",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/architecture/reference-architectures/hybrid-networking/"
    },
    {
      "category": "Rede",
      "subcategory": "Rede",
      "text": "Avalie quais recursos os usuários precisarão acessar desde os Pools de Host DO AVD até os locais",
      "description": "Avalie os requisitos de largura de banda, garanta que a largura de banda VPN/ER seja suficiente e a latência tolerável. ",
      "guid": "d227dd14-2b06-4c21-a799-9a646f4389a7",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/architecture/reference-architectures/hybrid-networking/"
    },
    {
      "category": "Rede",
      "subcategory": "Rede",
      "text": "Revise a topologia de rede da zona de pouso para o serviço AVD",
      "description": "Revise ou recomende um novo onde colocar piscinas de host AVD com base no CAF (vWAN vs. Hub & Spoke)",
      "guid": "f42c78e7-8c06-4a63-a21a-4956e6a8dc4a",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/cloud-adoption-framework/ready/considerations/networking-options"
    },
    {
      "category": "Rede",
      "subcategory": "Rede",
      "text": "Avalie a colocação de VNET e sub-rede para vários pools host",
      "description": "Certifique-se de que cada sub-rede terá espaço suficiente para dimensionar o POOL DE HOST AVD. Para diferentes pools host, recomenda-se usar sub-redes separadas, se possível. ",
      "guid": "20e27b3e-2971-41b1-952b-eee079b588de",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix"
    },
    {
      "category": "Rede",
      "subcategory": "Rede",
      "text": "Precisa controlar/restringir o tráfego de saída da Internet para hosts AVD? ",
      "description": "Várias opções estão disponíveis. Você pode usar o Azure Firewall ou NVA Firewall, NSG e/ou Proxy. O NSG não é capaz de ativar/desativar por URL, apenas portas e protocolos. O proxy deve ser usado apenas como configuração explícita no navegador do usuário. Detalhes sobre o uso do Azure Firewall Premium com AVD estão aqui no https://aka.ms/AVDfirewall e aqui https://docs.microsoft.com/azure/firewall/protect-windows-virtual-desktop. Certifique-se de revisar a lista completa de requisitos para acesso aos URLs AVD.",
      "guid": "fc4972cd-3cd2-41bf-9703-6e5e6b4bed3d",
      "severity": "Média",
      "link": "https://aka.ms/AVDfirewall"
    },
    {
      "category": "Rede",
      "subcategory": "Rede",
      "text": "Precisa controlar/restringir o tráfego de saída da Internet apenas para usuários em hosts AVD? ",
      "description": "Considere o uso do Azure Defender Endpoint para controlar a navegação da Web do usuário, consulte a seção Segurança para obter mais detalhes. ",
      "guid": "73676ae4-6691-4e88-95ad-a42223e13810",
      "severity": "Média",
      "link": "https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/windows-virtual-desktop-support-is-now-generally-available/ba-p/2103712"
    },
    {
      "category": "Rede",
      "subcategory": "Rede",
      "text": "Revise udr para sub-rede do Pool de HostS AVD",
      "description": "O UDR personalizado pode ser aplicado à sub-rede DO Pool de Hostd AVD, por exemplo, para redirecionar para o Azure Firewall ou NVA. Neste caso, recomenda-se revisar cuidadosamente para garantir que o caminho ideal para o tráfego de saída para o avião de controle AVD seja usado. As tags de serviço agora podem ser usadas com UDR, então o tráfego de avião de gerenciamento AVD pode ser facilmente listado. https://docs.microsoft.com/azure/firewall/protect-windows-virtual-desktop#host-pool-outbound-access-to-windows-virtual-desktop ",
      "guid": "523181a9-4174-4158-93ff-7ae7c6d37431",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/firewall/protect-windows-virtual-desktop"
    },
    {
      "category": "Rede",
      "subcategory": "Rede",
      "text": "Certifique-se de que os pontos finais do plano de controle AVD estejam acessíveis",
      "description": "Os URLs necessários para acesso ao avião de controle AVD por hosts de sessão estão documentados aqui: https://docs.microsoft.com/azure/virtual-desktop/safe-url-list. Uma ferramenta de verificação está disponível para verificar a conectividade dos hosts da sessão: https://docs.microsoft.com/azure/virtual-desktop/safe-url-list#required-url-check-tool.",
      "guid": "65c7acbe-45bb-4e60-ad89-f2e87778424d",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/safe-url-list"
    },
    {
      "category": "Rede",
      "subcategory": "Rede",
      "text": "Verifique a largura de banda da rede necessária para cada usuário e no total para o VM SKU",
      "description": "Recomenda-se avaliar e revisar os requisitos de largura de banda de rede para os usuários, com base no tipo de carga de trabalho específica. O artigo referenciado fornece estimativas e recomendações gerais, mas são necessárias medidas específicas para o dimensionamento adequado. ",
      "guid": "516785c6-fa96-4c96-ad88-408f372734c8",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/windows-server/remote/remote-desktop-services/network-guidance"
    },
    {
      "category": "Calcular",
      "subcategory": "Host de sessão",
      "text": "Avalie o uso do Gen2 VM para implantação do Host Pool",
      "description": "Uma vez selecionado o VM SKU que será usado para a implantação do Host Pool, recomenda-se usar o tipo Gen2 do SKU para maior segurança e recursos aprimorados.",
      "guid": "e4633254-3185-40a1-b120-bd563a1c8e9d",
      "severity": "Média",
      "link": "https://docs.microsoft.com/en-us/azure/virtual-machines/generation-2"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Determine como os aplicativos serão implantados em piscinas de host AVD",
      "description": "Os aplicativos podem ser pré-instalados na imagem/s dourados, podem ser anexados usando o recurso MSIX & AppAttach ou distribuindo para hosts após a implantação do pool usando métodos tradicionais de distribuição SW.",
      "guid": "86ba2802-1459-4014-95d3-8e5309ccbd97",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/set-up-customize-master-image"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Estime o número de imagens douradas que serão necessárias",
      "description": "Será que eles usarão mascaramento de aplicativos fslogix que se prestam a uma única imagem, ou multi-imagens com diferentes aplicativos assados: o que está exigindo mais de uma imagem para ser usado?",
      "guid": "9266bcca-274f-4aa1-abf3-9d95d44c7c89",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/create-host-pools-azure-marketplace"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Determine qual imagem/s do SISTEMA OPERACIONAL você usará para a implantação do Host Pool",
      "description": "Determine qual sistema operacional convidado será usado para implantar cada Pool de Host: Windows 10 vs. Windows Server, Marketplace vs. Imagens personalizadas",
      "guid": "19ca1f6d-5315-4ae5-84ba-34d4585e2213",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/overview"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Se uma imagem personalizada for usada, determine se há um processo de compilação automatizado?",
      "description": "Se nada existir, considere usar o Azure Image Builder para automatizar o processo de compilação. ",
      "guid": "9bd7bb01-2f7b-495e-86e1-54e2aa359282",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-machines/image-builder-overview"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Se uma imagem personalizada for usada, existe um plano para organizar e gerenciar o ciclo de vida de suas imagens?",
      "description": "Avalie a Azure Compute Gallery.",
      "guid": "5a2adb2c-3e23-426b-b225-ca44e1696fdd",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-machines/windows/shared-image-galleries"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Se a imagem personalizada for usada, verifique as práticas recomendadas para AVD sobre como construir imagem mestre",
      "description": "Existem algumas práticas e recomendações conhecidas para a personalização de imagem dourada, não deixe de conferir o artigo referenciado. ",
      "guid": "deace4cb-1dec-44c6-90c3-fc14eebb36a3",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/set-up-customize-master-image"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Avalie o uso da Ferramenta de Otimização virtual-desktop",
      "description": "Este conjunto de ferramentas foi criado para aplicar automaticamente a configuração referenciada no white paper 'Otimizando o Windows 10, versão 2004 para uma função VDI (Virtual Desktop Infrastructure, infraestrutura de desktop virtual)\": https://docs.microsoft.com/windows-server/remote/remote-desktop-services/rds-vdi-recommendations-2004. Deve-se considerar o uso da ferramenta e/ou otimizações mencionadas no white-paper. ",
      "guid": "829e3fec-2183-4687-a017-7a2b5945bda4",
      "severity": "Média",
      "link": "https://github.com/The-Virtual-Desktop-Team/Virtual-Desktop-Optimization-Tool"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Planejar/avaliar a estratégia de gerenciamento de configuração do host de sessão AVD",
      "description": "Determine se uma ferramenta de gerenciamento de configuração já está no local para gerenciar a configuração do Host Pool VM após a implantação inicial, por exemplo SCCM, MEM/Intune, GPO, soluções de terceiros.",
      "guid": "3334fdf9-1c23-4418-8b65-285269440b4b4b",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/mem/intune/fundamentals/windows-virtual-desktop-multi-session"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Determine se o Microsoft OneDrive fará parte da implantação do AVD",
      "description": "Revise o artigo fornecido e verifique os recursos 'Redirecionamento de pastas conhecidas' e 'Arquivos OnDemand' OneDrive devem ser considerados e eventualmente adotados.",
      "guid": "e3d3e084-4276-4d4b-bc01-5bcf219e4a1e",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/install-office-on-AVD-master-image"
    },
    {
      "category": "Calcular",
      "subcategory": "Imagem/s dourados",
      "text": "Determine se as equipes da Microsoft farão parte da implantação do AVD",
      "description": "Certifique-se de revisar este artigo e usar a versão mais recente, revisar e avaliar as exclusões das equipes para reduzir o tamanho do perfil.",
      "guid": "b5887953-5d22-4788-9d30-b66c67be5951",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/teams-on-AVD"
    },
    {
      "category": "Calcular",
      "subcategory": "MSIX & AppAttach",
      "text": "Não use a mesma conta de armazenamento/compartilhamento que os contêineres Profile/Office ",
      "description": "É altamente recomendável usar contas/ações de armazenamento separadas para armazenar pacotes MSIX. Se necessário, o armazenamento pode ser ampliado independentemente e não ser impactado pelas atividades de I/O do perfil. O Azure oferece várias opções de armazenamento que podem ser usadas para anexar o aplicativo MISX. Recomendamos o uso de Arquivos Azure ou Arquivos Azure NetApp, pois essas opções oferecem o melhor valor entre custo e sobrecarga de gerenciamento. ",
      "guid": "90083845-c587-4cb3-a1ec-16a1d076ef9f",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-file-share"
    },
    {
      "category": "Calcular",
      "subcategory": "MSIX & AppAttach",
      "text": "Revisar considerações de desempenho para MSIX",
      "description": "No artigo referenciado, relatamos poucas considerações de desempenho importantes para o uso do MSIX no contexto AVD, certifique-se de revisar cuidadosamente.",
      "guid": "241addce-5793-477b-adb3-751ab2ac1fad",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-file-share"
    },
    {
      "category": "Calcular",
      "subcategory": "MSIX & AppAttach",
      "text": "Verifique as permissões adequadas do host de sessão para compartilhar o MSIX",
      "description": "A anexação do aplicativo MSIX requer permissões somente leitura para acessar o compartilhamento do arquivo. Se você estiver armazenando seus aplicativos MSIX em Arquivos Azure e, em seguida, para os hosts de sessão, você precisará atribuir todos os VMs de host de sessão, tanto o controle de acesso baseado em função da conta de armazenamento (RBAC) quanto o NTFS (New Technology File System) no share.",
      "guid": "66e15d4d-5a2a-4db2-a3e2-326bf225ca41",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-file-share"
    },
    {
      "category": "Calcular",
      "subcategory": "MSIX & AppAttach",
      "text": "Pacotes MSIX para aplicações de terceiros",
      "description": "O fornecedor de software de terceiros deve fornecer um pacote MSIX, não é recomendado para o cliente tentar o procedimento de conversão sem o suporte adequado do proprietário do aplicativo.",
      "guid": "bd362caa-ab79-4b19-adab-81932c9fc9d1",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-faq"
    },
    {
      "category": "Calcular",
      "subcategory": "MSIX & AppAttach",
      "text": "Desativar a atualização automática para pacotes MSIX",
      "description": "O anexo do aplicativo MSIX não suporta atualização automática para aplicativos MSIX e, em seguida, deve ser desativado.",
      "guid": "bb88037f-5e6b-4fbb-aed5-03547cc447e8",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-faq"
    },
    {
      "category": "Calcular",
      "subcategory": "MSIX & AppAttach",
      "text": "Revisar o suporte a sistemas operacionais",
      "description": "Para aproveitar o MSIX & App Attach, a imagem do SISTEMA OPERACIONAL convidado para o pool AVD Host deve ser o Windows 10 Enterprise ou o Windows 10 Enterprise Multi-session, versão 2004 ou posterior.",
      "guid": "26128a71-f0f1-4cac-9d9e-f1d5e832e42e",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-faq"
    },
    {
      "category": "Armazenamento",
      "subcategory": "Host de sessão ",
      "text": "Determine qual tipo de disco gerenciado será usado para os Hosts de Sessão  ",
      "description": "HDD padrão, SSD padrão ou SSD Premium, discos efêmeros não são suportados, ultra-discos não recomendados. Recomendado para avaliar premium para disco do SISTEMA se a densidade do usuário não for baixa, e se você vai usar o Cloud Cache. ",
      "guid": "3611c818-b0a0-4bc5-80e4-3a18a9cd289c",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-machines/disks-types"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Determine qual solução de backend de armazenamento será usada para o perfil FSLogix e contêineres de escritório",
      "description": "Arquivos Azure NetApp, Arquivos Azure, Servidor de Arquivos baseado em VM. Servidor de arquivos não recomendado. Azure Files Premium normalmente é um bom ponto de partida. O NetApp só geralmente é necessário para ambientes de grande escala/alto desempenho. ",
      "guid": "ed6b17db-8255-4462-b2ae-e4553afc8339",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/store-fslogix-profile"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Avalie a possibilidade de separar contêineres de perfil de contêineres de escritório",
      "description": "A recomendação no Windows Virtual Desktop é usar o Contêiner de Perfil sem o Contêiner office, a menos que você esteja planejando cenários específicos de continuidade de negócios e recuperação de desastres (BCDR), conforme descrito na seção de recuperação de desastres abaixo. https://docs.microsoft.com/fslogix/profile-container-office-container-cncpt ",
      "guid": "df47d2d9-2881-4b1c-b5d1-e54a29759e39",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/fslogix/profile-container-office-container-cncpt"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Verifique os limites de escalabilidade do armazenamento para suportar os requisitos do Host Pool",
      "description": "Como ponto de partida para estimar os requisitos de desempenho de armazenamento de contêineres de perfil, recomendamos assumir 10 IOPS por usuário em estado constante e 50 IOPS por usuário durante o login/login.",
      "guid": "680e7828-9c93-4665-9d02-bff4564b0d93",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Se o armazenamento do NetApp Files for usado, verifique a disponibilidade do serviço de armazenamento em sua região específica.",
      "description": "Se uma segunda região for necessária para fins de DR, verifique a disponibilidade do NetApp lá também.",
      "guid": "4a359836-ee79-4d6c-9d3a-364a5b7abae3",
      "severity": "Média",
      "link": "https://azure.microsoft.com/global-infrastructure/services/"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Para um desempenho ideal, a solução de armazenamento e o contêiner de perfil FSLogix devem estar no mesmo local do data center.",
      "description": "Evite introduzir latência adicional e custos associados ao tráfego de rede entre regiões, sempre que possível.",
      "guid": "8aad53cc-79e2-4e86-9673-57c549675c5e",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/fslogix-containers-azure-files"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Configure as exclusões de antivírus recomendadas para FSLogix (inclui não digitalizar arquivos VHD(x) no connect).",
      "description": "Certifique-se de configurar as seguintes exclusões antivírus para discos rígidos virtuais FSLogix Profile Container, conforme documentado no artigo referenciado.",
      "guid": "83f63047-22ee-479d-9b5c-3632054b69ba",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Revise as chaves de registro do FSLogix e determine quais aplicar",
      "description": "As configurações básicas e recomendadas padrão estão aqui: https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix#best-practice-settings-for-enterprises Veja aqui para o conjunto principal: https://docs.microsoft.com/fslogix/configure-profile-container-tutorialSee aqui para referência completa: https://docs.microsoft.com/fslogix/profile-container-configuration-reference ",
      "guid": "d34aad5e-8c78-4e1d-9666-7313c405674c",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Verifique o uso de conexões simultâneas ou múltiplas para o mesmo perfil",
      "description": "Conexões simultâneas ou múltiplas são desencorajadas no Windows Virtual Desktop. A melhor prática é criar um local de perfil diferente para cada sessão (como um pool de host).",
      "guid": "5e985b85-9c77-43e7-b261-623b775a917e",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Revise as melhores práticas e considerações-chave para o dimensionamento do armazenamento",
      "description": "Como estimativa geral, a ser validada em um ambiente de teste, para cada usuário 5 - 15 IOPS deve ser primeiro considerado, dependendo da carga de trabalho. Arquivos Azure: Premium max 100k IOPS por ação (máximo 100TB) e até 5Gbps com latência de 3ms. Esteja ciente de como os Arquivos Azure são provisionados, ou seja, o IOPS estritamente vinculado ao TAMANHO provisionado. Capacidade de dimensionamento de rajadas em alguns casos. Certifique-se de prover UPFRONT mais espaço do que o necessário para ter certeza de ter IOPS suficiente. NOTA: O Azure Premium talvez seja mais barato que o Standard porque você não paga transações, então detalhes importantes para ter em mente. Arquivos Azure NetApp: lembre-se no máximo 1000 IPs conectados, pode ajustar IOPS em tempo real, capacidade mínima de 4 TB provisionada. ",
      "guid": "1f348ff3-64d2-47d4-8e8b-bbc868155abb",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/store-fslogix-profile"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Verifique as práticas recomendadas para arquivos Azure (se usado)",
      "description": "Certifique-se de verificar a lista de melhores práticas e recomendações descritas no artigo referenciado.",
      "guid": "9164e990-9ae2-48c8-9c33-b6b7808bafe6",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Verifique as práticas recomendadas de Arquivos NetApp (se usado)",
      "description": "Certifique-se de verificar a lista de melhores práticas e recomendações descritas no artigo referenciado.",
      "guid": "c42149d4-13a9-423c-9574-d11028ac6aae",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Revise e confirme o tamanho máximo do perfil configurado no FSLogix",
      "description": "Os recipientes de perfil têm um tamanho máximo padrão de 30GB. Se grandes contêineres de perfil forem antecipados e os clientes quiserem tentar mantê-los pequenos, considere usar o OneDrive para hospedar arquivos do Office 365 fora do perfil FSLogix.",
      "guid": "01e6a84d-e5df-443d-8992-481718d5d1e5",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/fslogix/profile-container-configuration-reference"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Se o FSLogix Cloud Cache for usado, mova o diretório Cache para unidade temporária.",
      "description": "O Cloud Cache usa o disco local como cache e pode gerar muita pressão no disco VM. Recomendado para aproveitar a potência do disco VM temporário (e conectado localmente), se possível com base no VM SKU. ",
      "guid": "b2d1215a-e114-4ba3-9df5-85ecdcd9bd3b",
      "severity": "Média",
      "link": "https://docs.microsoft.com/fslogix/cloud-cache-configuration-reference"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Revise o uso do redirecionamento FSLogix.",
      "description": "REDIRECIONAMENTO.XML arquivo é usado para controlar quais pastas são redirecionadas do recipiente de perfil para a unidade C: As exclusões devem ser a exceção e nunca devem ser usadas a menos que a exclusão específica seja completamente compreendida pela pessoa que configura a exclusão. As exclusões devem ser sempre totalmente testadas no ambiente onde se destinam a ser implementadas. A configuração de exclusões pode afetar a funcionalidade, a estabilidade e o desempenho.",
      "guid": "0b50ca97-b1d2-473c-b4d9-6e98b0f912de",
      "severity": "Média",
      "link": "https://docs.microsoft.com/fslogix/manage-profile-content-cncpt#redirectionsxml"
    },
    {
      "category": "Armazenamento",
      "subcategory": "FSLogix",
      "text": "Se o armazenamento do Azure NetApp Files for usado, verifique a configuração do nome do Site de AD na conexão AD.",
      "description": "Um Site de Diretório Ativo deve ser criado para o ambiente de rede virtual do Azure, onde a sub-rede ANF será criada, e esse nome do site deve ser especificado na propriedade de conexão ANF ao executar o procedimento de ação, conforme explicado no artigo de referência.",
      "guid": "6647e977-db49-48a8-bc35-743f17499d42",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/en-us/azure/azure-netapp-files/create-active-directory-connections"
    },
    {
      "category": "Segurança",
      "subcategory": "Configuração do host",
      "text": "Certifique-se de que os usuários de AVD não terão privilégios de administração locais em hosts AVD. ",
      "description": "Recomendamos que você não conceda aos seus usuários acesso administrativo a desktops virtuais. Se você precisar de pacotes de software, recomendamos que os disponibilize através de utilitários de gerenciamento de configuração, como o Microsoft Endpoint Manager. Em um ambiente de várias sessões, recomendamos que você não deixe que os usuários instalem software diretamente.",
      "guid": "a0cdb3b5-4eb2-4eb0-9dda-a3592718e2ed",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/security-guide"
    },
    {
      "category": "Segurança",
      "subcategory": "Configuração do host",
      "text": "Certifique-se de que a solução antivírus e anti-malware seja usada",
      "description": "O Microsoft Defender for Endpoint agora suporta o Windows Virtual Desktop para multi-sessão do Windows 10 Enterprise. Verifique o artigo para dispositivos VDI (Virtual Desktop Infrastructure, infraestrutura de desktop virtual não persistente) de onboarding: https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/configure-endpoints-vdi",
      "guid": "b1172576-9ef6-4691-a483-5ac932223ece",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/security-guide"
    },
    {
      "category": "Segurança",
      "subcategory": "Configuração do host",
      "text": "Certifique-se de que as exclusões de AV adequadas estejam no lugar",
      "description": "Certifique-se de que as seguintes exclusões estão em vigor: https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix#antivirus-exclusions .",
      "guid": "80b12308-1a54-4174-8583-3ea3ad2c2de7",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/architecture/example-scenario/AVD/windows-virtual-desktop-fslogix"
    },
    {
      "category": "Segurança",
      "subcategory": "Configuração do host",
      "text": "Avalie os requisitos de criptografia de disco para hosts AVD",
      "description": "Os discos no Azure já estão criptografados em repouso por padrão com as chaves gerenciadas pela Microsoft. A criptografia de disco host VM OS é possível e suportada usando ADE e DES: dados de usuário sensíveis e peristent não devem ser armazenados no disco Session Host, então ele deve ser usado apenas se estritamente necessário por motivo de conformidade. A criptografia do armazenamento FSLogix usando arquivos Azure pode ser feita usando SSE no Azure Storage.For OneDrive encryption, consulte este artigo: https://docs.microsoft.com/compliance/assurance/assurance-encryption-for-microsoft-365-services.",
      "guid": "0fd32907-98bc-4178-adc5-a06ca7144351",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/security-guide"
    },
    {
      "category": "Segurança",
      "subcategory": "Configuração do host",
      "text": "Precisa controlar/restringir a navegação do usuário na Internet dos hosts de sessões AVD?",
      "description": "Considere o uso do Azure Defender Endpoint para controlar a navegação web do usuário. ",
      "guid": "e19dd344-29eb-4722-a237-a151c5bb4e4f",
      "severity": "Média",
      "link": "https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/windows-virtual-desktop-support-is-now-generally-available/ba-p/2103712"
    },
    {
      "category": "Segurança",
      "subcategory": "Segurança",
      "text": "Avalie o uso do Azure Security Center (ASC) para hosts de sessão AVD",
      "description": "Recomendamos que você habilite o Azure Security Center Standard para assinaturas, máquinas virtuais, cofres-chave e contas de armazenamento. Com o Azure Security Center Standard é possível avaliar e gerenciar vulnerabilidades, avaliar a conformidade com estruturas comuns como o PCI, fortalecer a segurança geral do seu ambiente AVD.",
      "guid": "1814387e-5ca9-4c26-a9b3-2ab5bdfc6998",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/security-guide"
    },
    {
      "category": "Segurança",
      "subcategory": "Segurança",
      "text": "Revise gpos ativos do diretório para garantir sessões de RDP",
      "description": "Deve ser usado, por exemplo, para impor bloqueio de desktop e término da sessão ociosa. Os GPOs existentes aplicados ao ambiente local devem ser revisados e eventualmente aplicados para garantir também hosts AVD. ",
      "guid": "a135e337-897e-431c-97d6-8cb6a22ac19f",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/security-guide"
    },
    {
      "category": "Segurança",
      "subcategory": "Segurança",
      "text": "Avalie o uso de MFA para usuários de AVD",
      "description": "Para obter mais detalhes e insights, consulte este artigo: https://christiaanbrinkhoff.com/2020/03/23/learn-how-to-increase-the-security-level-of-your-windows-virtual-desktop-environment-e-g-windows-client-with-azure-mfa-and-conditional-access",
      "guid": "916d697d-8ead-4ed2-9bdd-186f1ac252b9",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/set-up-mfa"
    },
    {
      "category": "Segurança",
      "subcategory": "Segurança",
      "text": "Avalie o uso do Acesso Condicional para usuários",
      "description": "A ativação do Acesso Condicional permite gerenciar riscos antes de conceder aos usuários acesso ao ambiente de desktop virtual do Windows. Ao decidir a quais usuários conceder acesso, recomendamos que você também considere quem é o usuário, como ele faz login e qual dispositivo eles estão usando.",
      "guid": "556246b4-3856-44b4-bc74-a748b6633ad2",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/security-guide"
    },
    {
      "category": "Segurança",
      "subcategory": "Segurança",
      "text": "Habilite o login de diagnóstico e auditoria no espaço de trabalho central do Log Analytics",
      "description": "A ativação da coleta de log de auditoria permite visualizar a atividade do usuário e do administrador relacionada ao Windows Virtual Desktop. Este também é um requisito para eanble e usar ferramenta de monitoramento AVD. Altamente recomendado para habilitar. ",
      "guid": "a0916a76-4980-4ad0-b278-ee293c1bc352",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/security-guide"
    },
    {
      "category": "Segurança",
      "subcategory": "Segurança",
      "text": "Avalie a exigência de usar funções de RBAC personalizadas para gerenciamento de AVD ",
      "description": "O AVD usa controles de acesso baseados em funções do Azure (RBAC) para atribuir funções aos usuários e administradores. Essas funções dão permissão aos administradores para realizar determinadas tarefas. Se a separação de tarefas for necessária, o Windows Virtual Desktop tem funções adicionais que permitem separar funções de gerenciamento para pools de host, grupos de aplicativos e espaços de trabalho. Essa separação permite que você tenha mais controle granular sobre tarefas administrativas. Essas funções são nomeadas em conformidade com os papéis padrão do Azure e a metodologia de menor privilégio.",
      "guid": "baaab757-1849-4ab8-893d-c9fc9d1bb73b",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/rbac"
    },
    {
      "category": "Segurança",
      "subcategory": "Segurança",
      "text": "Revise todas as práticas recomendadas de segurança para o ambiente AVD",
      "description": "Um conjunto abrangente de práticas e recomendações de segurança estão contidos no artigo referenciado, recomenda-se revisar. ",
      "guid": "36a5a67f-bb9e-4d5b-9547-8c4479816b28",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/security-guide"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Monitorização",
      "text": "Habilite o monitoramento do Azure para AVD",
      "description": "O Azure Monitor for Windows Virtual Desktop é um painel baseado em Workbooks do Monitor Azure que ajuda os profissionais de TI a entender seus ambientes de Desktop Virtual do Windows. Leia o artigo referenciado para saber como configurar o Azure Monitor for Windows Virtual Desktop para monitorar seus ambientes de desktop virtual do Windows.",
      "guid": "63cfff1c-ac59-49ef-8d5a-83dd4de36c1c",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/azure-monitor"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Monitorização",
      "text": "Habilite e redirecione as configurações de diagnóstico para espaços de trabalho, pools de host, grupos de aplicativos e VMs de host para log analytics espaço de trabalho",
      "description": "O Windows Virtual Desktop usa o Azure Monitor e o Log Analytics para monitoramento e alertas como muitos outros serviços do Azure. Isso permite que os administradores identifiquem problemas através de uma única interface. O serviço cria registros de atividades para ações tanto do usuário quanto administrativas.  Cada registro de atividade se enquadra nas seguintes categorias: Gerenciamento, Alimentação, Conexões, Registro de Host, Erros, Pontos de Verificação. ",
      "guid": "81770afb-c4c0-4e43-a186-58d2857ed671",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/diagnostics-log-analytics"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Monitorização",
      "text": "Crie alertas sobre o armazenamento do perfil para serem alertados em caso de alto uso e estrangulamento",
      "description": "Consulte o artigo referenciado e este adicional para configurar o monitoramento adequado e alerta para armazenamento: https://docs.microsoft.com/azure/storage/files/storage-troubleshooting-files-performance. ",
      "guid": "2463cffe-179c-4599-be0d-5973dd4ce32c",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/storage/files/storage-files-monitoring?tabs=azure-portal"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Monitorização",
      "text": "Configure a saúde do serviço Azure para alertas de AVD ",
      "description": "Você pode usar o Azure Service Health para monitorar problemas de serviço e avisos de saúde para o Windows Virtual Desktop. O Azure Service Health pode notificá-lo com diferentes tipos de alertas (por exemplo, e-mail ou SMS), ajudá-lo a entender o efeito de um problema e mantê-lo atualizado à medida que o problema se resolve.",
      "guid": "18813706-f7c4-4c0d-9e51-4548d2457ed6",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/set-up-service-alerts"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Gestão",
      "text": "Avalie o requisito para o recurso de dimensionamento automático do pool host",
      "description": "A ferramenta de dimensionamento oferece uma opção de automação de baixo custo para clientes que desejam otimizar os custos de VM do host de sessão. Você pode usar a ferramenta de dimensionamento para agendar VMs para iniciar e parar com base nos horários comerciais de Peak e Off-Peak, dimensionar VMs com base no número de sessões por núcleo de CPU, escalar em VMs durante o horário de off-Peak, deixando o número mínimo de VMs de hospedagem de sessão em execução. Ainda não está disponível para o tipo de Pool de Host Pessoal, recomendado ter uma configuração separada para cada pool de host. ",
      "guid": "7138b820-102c-4e16-be30-1e6e872e52e3",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/set-up-scaling-script"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Gestão",
      "text": "Verifique periodicamente as recomendações do Azure Advisor para AVD",
      "description": "O Azure Advisor analisa suas configurações e telemetria para oferecer recomendações personalizadas para resolver problemas comuns. Com essas recomendações, você pode otimizar seus recursos do Azure para confiabilidade, segurança, excelência operacional, desempenho e custo.",
      "guid": "611dd68c-5a4b-4252-8e44-a59a9c2399c4",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/azure-advisor"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Gestão",
      "text": "Plano para uma estratégia de gerenciamento de atualização de imagem dourada",
      "description": "Prepare uma estratégia para gerenciar atualizações para imagens douradas, por exemplo, para aplicar hotfixes de segurança e/ou atualizar aplicativos instalados dentro da imagem. O Azure Image Builder Service é uma solução de primeira parte para automatizar a compilação e personalização de modelos VMs.ARM pode ser usado para criar novos hosts, e então desativar os antigos: https://github.com/Azure/RDS-Templates/tree/master/ARM-AVD-templates/AddVirtualMachinesToHostPool Abordagem recomendada é criar uma nova piscina lado a lado, mais fácil de reverter, não utilizável para pool dedicadoRe-implantar e aumentar o número de VMs com o modelo ARM também é uma opção viável. Os clientes também podem querer usar métodos de distribuição de software existentes para atualizar a imagem sem reimplantura, para exames com SCCM ou similares.",
      "guid": "d7b68d0c-7555-462f-8b3e-4563b4d874a7",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-machines/windows/image-builder-virtual-desktop"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Gestão",
      "text": "Planeje uma estratégia de patches e atualização do Host Session Host",
      "description": "Os clientes podem ter várias opções:- Microsoft Endpoint Configuration Manager, este artigo explica como configurar o Microsoft Endpoint Configuration Manager para aplicar automaticamente atualizações em um host de desktop virtual do Windows executando multi-sessão do Windows 10 Enterprise: https://docs.microsoft.com/azure/virtual-desktop/configure-automatic-updates- Microsoft Intune: https://docs.microsoft.com/mem/intune/fundamentals/windows-virtual-desktop-multi-session- Windows Server Update Services (WSUS)-  3ª Parte que lhe suporta OS.- Azure Update Management (Azure Automation), hoje não suportada para o SO do cliente: https://docs.microsoft.com/azure/automation/update-management/overview#unsupported-operating-systemsIt é recomendado para se afastar de uma estratégia de patches e passar para uma estratégia de re-imagem, se possível. ",
      "guid": "04722da2-9c2b-41cd-922f-54b29bade3aa",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-machines/windows/image-builder-virtual-desktop"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Gestão",
      "text": "Avalie a exigência de um ambiente canário de teste DE AVD",
      "description": "Os grupos host são uma coleção de uma ou mais máquinas virtuais idênticas no ambiente Windows Virtual Desktop. Recomendamos que você crie um pool de host de validação onde as atualizações de serviço são aplicadas primeiro. Isso permite monitorar as atualizações de serviço antes que o serviço as aplique ao seu ambiente padrão ou não de validação.",
      "guid": "d1e8c38e-c936-4667-913c-005674b1e944",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/create-validation-host-pool"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Gestão",
      "text": "Determine a estratégia de implantação do Host Pool",
      "description": "Um Pool de Host AVD pode ser implantado de várias maneiras: Portal Azure, modelos ARM, ferramenta Azure CLI, Powershell, criação manual de VM com token de registro, Terraform, etc. É importante adotar métodos/s adequados para suportar a implantação automática por meio de ferramentas de automação e CI/CD.",
      "guid": "a459c373-e7ed-4616-83b3-65a917ecbe48",
      "severity": "Média",
      "link": "https://github.com/Azure/RDS-Templates/tree/master/AVD-templates"
    },
    {
      "category": "Monitoramento e Gestão",
      "subcategory": "Gestão",
      "text": "Ligue os VMs regularmente a cada 90 dias para atualização de token",
      "description": "Depois de registrar um VM em um pool de host dentro do serviço Windows Virtual Desktop, o agente atualiza regularmente o token do VM sempre que o VM estiver ativo. O certificado para o token de registro é válido por 90 dias. Devido a este limite de 90 dias, recomendamos que os VMs fiquem on-line por 20 minutos a cada 90 dias para que a máquina possa atualizar seus tokens e atualizar o agente e os componentes da pilha lado a lado.",
      "guid": "ebe54cd7-df2e-48bb-ac35-81559bb9153e",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/faq"
    },
    {
      "category": "BC/DR",
      "subcategory": "Calcular",
      "text": "Determine o SLA de alta disponibilidade esperado para aplicativos/desktops publicados através do AVD",
      "description": "O plano de controle AVD não oferece um contrato de nível de serviço apoiado financeiramente. Nós nos esforçamos para alcançar pelo menos 99,9% de disponibilidade para os URLs do serviço windows virtual desktop. A disponibilidade das máquinas virtuais de hospedagem de sessão em sua assinatura é coberta pelo SLA de Máquinas Virtuais. Os recursos/serviços/serviços dependentes e a disponibilidade de infraestrutura também devem ser considerados para satisfazer adequadamente os requisitos globais de alta disponibilidade. ",
      "guid": "56c57ba5-9119-4bf8-b8f5-c586c7d9cdc1",
      "severity": "Alto",
      "link": "https://azure.microsoft.com/support/legal/sla/virtual-desktop/v1_0/"
    },
    {
      "category": "BC/DR",
      "subcategory": "Calcular",
      "text": "Avalie a região de recuperação de desastres geo para piscinas de host AVD",
      "description": "O modelo Active-Active pode ser alcançado com vários grupos de host em diferentes regiões. Não é recomendado um único Host Pool com VMs de diferentes regiões. Se vários pools para mesmos usuários serão usados, o problema de como sincronizar/replicar perfis de usuários deve ser resolvido. O FSLogix Cloud Cache pode ser usado, mas precisa ser cuidadosamente revisado e planejado, ou os clientes podem decidir não sincronizar/replicar. 'Ativo-passivo' pode ser alcançado usando a implantação do Azure Site Recovery (ASR) ou do Pool sob demanda com mecanismo automatizado.",
      "guid": "6acc076e-f9b1-441a-a989-579e76b897e7",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery"
    },
    {
      "category": "BC/DR",
      "subcategory": "Calcular",
      "text": "Aplicativos críticos separados em diferentes pools de host AVD",
      "description": "Antes de abordar o planejamento e o design do BCDR do Windows Virtual Desktop, é importante considerar inicialmente quais aplicativos são consumidos através do AVD. Você pode querer separá-los de aplicativos não críticos e usar um Host Pool separado com uma abordagem e recursos diferentes de recuperação de desastres.",
      "guid": "10a7da7b-e996-46e1-9d3c-4ada97cc3d13",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery"
    },
    {
      "category": "BC/DR",
      "subcategory": "Calcular",
      "text": "Planeje a melhor opção de resiliência para implantação do POOL DE HOST AVD",
      "description": "? Você selecionou o nível de resiliência adequado para seus VMs de Pool host (Availability Set vs. Availability Zones)?? Você está ciente das implicações no HA SLA e nos limites de escalabilidade que vêm com AS ou AZ? Atualmente, você pode implantar 399 VMs por implantação de modelo DE ARMA de desktop virtual do Windows sem conjuntos de disponibilidade ou 200 VMs por Conjunto de Disponibilidade.? Você pode aumentar o número de VMs por implantação desligando os Conjuntos de Disponibilidade no modelo ARM ou no registro do pool de host do portal Azure. Implantar AZ agora é possível, um AZ no momento, precisa criar manualmente uma fração de VMs em cada AZ desejado. ",
      "guid": "25ab225c-6f4e-4168-9fdd-dea8a4b7cdeb",
      "severity": "Alto",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/faq"
    },
    {
      "category": "BC/DR",
      "subcategory": "Calcular",
      "text": "Avalie a exigência de backup de hosts de sessão AVD",
      "description": "O Backup Azure também pode ser usado para proteger VMs do Host Pool, essa prática é suportada, mesmo que os VMs do Host Pool sejam apátridas. Esta opção pode ser considerada para piscinas de host pessoal. ",
      "guid": "4c61fc3f-c14e-4ea6-b69e-8d9a3eec218e",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery"
    },
    {
      "category": "BC/DR",
      "subcategory": "Armazenamento",
      "text": "Avalie quais dados precisam ser protegidos dentro dos Contêineres de Perfil e Escritório",
      "description": "Nem todos os dados dentro dos perfis de usuários do FSLogix podem merecer proteção contra desastres. Além disso, se o armazenamento externo for usado, por exemplo, o OneDrive ou File Servers/Shares, o que permanece no perfil FSLogix é mínimo e pode ser perdido em algumas circunstâncias extremas. Em outros casos, os dados dentro do perfil podem ser reconstruídos a partir de outros armazenamentos (por exemplo, outlook inbox no modo em cache). ",
      "guid": "687ab077-adb5-49e5-a960-3334fdf8cc23",
      "severity": "Média",
      "link": "https://docs.microsoft.com/fslogix/manage-profile-content-cncpt"
    },
    {
      "category": "BC/DR",
      "subcategory": "Armazenamento",
      "text": "Construa uma estratégia de proteção de backup para contêineres de perfil e escritório",
      "description": "Prevenir a perda de dados para dados críticos do usuário é importante, o primeiro passo é avaliar quais dados precisam ser salvos e protegidos. Se usar o OneDrive ou outro armazenamento externo, salvar dados do Perfil do Usuário e/ou contêineres do Office talvez não seja necessário. O mecanismo apropriado deve ser considerado para fornecer proteção aos dados críticos do usuário. O serviço de backup Azure pode ser usado para proteger dados de contêineres de perfil e escritório quando armazenados nos níveis Padrão e Premium de Arquivos Azure. Instantâneos e políticas de arquivos do Azure NetApp podem ser usados para arquivos do Azure NetApp (todos os níveis).",
      "guid": "fc4972cc-3cd2-45bf-a707-6e9eab4bed32",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery"
    },
    {
      "category": "BC/DR",
      "subcategory": "Armazenamento",
      "text": "Avalie os requisitos de replicação de armazenamento de contêiner de perfil e a resiliência para fins do BCDR",
      "description": "Em AVD, vários mecanismos e estratégias de replicação podem ser usados para dados de usuários residentes em contêineres FSLogix:? Padrão de perfil #1: Mecanismos nativos de replicação de armazenamento do Azure, por exemplo, replicação GRS padrão de arquivos Azure, replicação transversal de arquivos do Azure ou sincronização de arquivos Azure para servidores de arquivos baseados em VM? O ZRS (Zone Replicated Storage, armazenamento replicado na zona) ou o armazenamento geo replicado (GRS) para arquivos Azure é recomendado.? O LRS com resiliência local só pode ser usado se não for necessária proteção de zona/região.? NOTA: O Azure Files Share Standard é LRS/ZRS/GRS, mas com suporte de 100 TB habilitado apenas LRS/ZRS são suportados. ? Padrão de perfil #2: O FSLogix Cloud Cache é incorporado em mecanismo automático para replicar contêineres entre diferentes (até 4) contas de armazenamento. O Cloud Cache só deve ser usado quando:? O perfil do usuário ou os contêineres do Office necessários para a SLA de alta disponibilidade é fundamental e precisa ser resiliente à falha na região.? A opção de armazenamento selecionada não é capaz de satisfazer os requisitos do BCDR. Por exemplo, com o nível Azure File Share Premium ou o Azure File Share Standard com suporte de arquivo grande ativado, o GRS não está disponível.? Quando a replicação entre armazenamento díspare é necessária.? Padrão de perfil #3: Configure apenas a recuperação geofíslica de desastres para dados de aplicativos e não para dados/recipientes de perfil do usuário: armazene dados importantes de aplicativos em armazenamentos separados, como o OneDrive ou outro armazenamento externo com seu próprio mecanismo de DR incorporado.",
      "guid": "9f7547c1-746d-4c56-868a-714435bd09d",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery"
    },
    {
      "category": "BC/DR",
      "subcategory": "Armazenamento",
      "text": "Revise a estratégia de DR de arquivos do Azure NetApp",
      "description": "Geo Disaster Recovery: Azure NetApp Files é essencialmente LRS (armazenamento replicado localmente), então você precisa arquitetar algo mais se quiser a replicação entre regiões. A recomendação para cross-region no momento é o NetApp Cloud Sync, replicando-se para outra região do Azure (e NetApp Volume). Backup: Os backups são manuseados por instantâneos, mas não são automáticos, precisam ser agendados usando políticas. https://docs.microsoft.com/azure/azure-netapp-files/azure-netapp-files-manage-snapshots. Há um limite máximo de instantâneos (255) por volume conforme documentado aqui: https://docs.microsoft.com/azure/azure-netapp-files/azure-netapp-files-resource-limits.",
      "guid": "23429db7-2281-4376-85cc-57b4a4b18142",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/azure-netapp-files/azure-netapp-files-manage-snapshots"
    },
    {
      "category": "BC/DR",
      "subcategory": "Armazenamento",
      "text": "Revisar a estratégia de DR de arquivos Azure",
      "description": "Geo Disaster Recovery: GRS for Azure Files só está disponível com SKU padrão e sem suporte a ações grandes, então não é adequado na maioria dos cenários de clientes. Se for necessária a replicação georreferida, ao usar o Azure File Share Premium, a replicação com o FSLogix Cloud Cache deve ser avaliada ou a resiliência da Zona de Disponibilidade (AZ) da região deve ser considerada. Backup: O Azure Backup suporta totalmente o Azure File Share all SKUs, e é a solução recomendada para proteger os contêineres de perfil. Se usar o OneDrive ou outro armazenamento externo, salvar dados do Perfil do Usuário e/ou contêineres do Office talvez não seja necessário.",
      "guid": "3d4f3537-c134-46dc-9602-7a71efe1bd05",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/backup/backup-afs"
    },
    {
      "category": "BC/DR",
      "subcategory": "Dependências",
      "text": "Plano para disponibilidade entre regiões de imagem dourada",
      "description": "Se imagens personalizadas forem usadas para implantar VMs de Pool de Host, é importante garantir que esses artefatos estejam disponíveis em todas as regiões, mesmo que em caso de um grande desastre. O serviço Azure Compute Gallery pode ser usado para replicar imagens em todas as regiões onde um Host Pool é implantado, com armazenamento redundante e em várias cópias.",
      "guid": "dd2e0d5d-771d-441e-9610-cc57b4a4a141",
      "severity": "Baixo",
      "link": "https://docs.microsoft.com/azure/virtual-machines/windows/shared-images-portal"
    },
    {
      "category": "BC/DR",
      "subcategory": "Dependências",
      "text": "Avaliar dependências de infraestrutura e aplicativos ",
      "description": "Se os usuários da infraestrutura AVD precisarem de acesso aos recursos no local, a alta disponibilidade de infraestrutura de rede necessária para se conectar também é crítica e deve ser considerada. A resiliência da infraestrutura de autenticação precisa ser avaliada e avaliada. Os aspectos bcdr para aplicações dependentes e outros recursos precisam ser considerados para garantir a disponibilidade no local dr secundário.",
      "guid": "fd339489-8c12-488b-9c6a-57cfb644451e",
      "severity": "Média",
      "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery"
    }
  ],
  "severities": [
    {
      "name": "Alto"
    },
    {
      "name": "Média"
    },
    {
      "name": "Baixo"
    }
  ],
  "categories": [
    {
      "name": "Fundação"
    },
    {
      "name": "Identidade"
    },
    {
      "name": "Rede"
    },
    {
      "name": "Calcular"
    },
    {
      "name": "Armazenamento"
    },
    {
      "name": "Segurança"
    },
    {
      "name": "Monitoramento e Gestão"
    },
    {
      "name": "BC/DR"
    }
  ]
}
