{
    "categories": [
        {
            "name": "Fundación"
        },
        {
            "name": "Identidad"
        },
        {
            "name": "Calcular"
        },
        {
            "name": "Gestión de redes"
        },
        {
            "name": "Almacenamiento"
        },
        {
            "name": "Seguimiento y gestión"
        },
        {
            "name": "Seguridad"
        },
        {
            "name": "Continuidad del negocio y recuperación ante desastres"
        }
    ],
    "items": [
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "El plano de control de AVD no ofrece un acuerdo de nivel de servicio respaldado financieramente. Nos esforzamos por lograr al menos un 99,9 % de disponibilidad para las direcciones URL del servicio Azure Virtual Desktop. La disponibilidad de las máquinas virtuales de host de sesión de la suscripción está cubierta por el Acuerdo de Nivel de Servicio de Máquinas Virtuales. También se deben tener en cuenta los recursos/servicios dependientes y la disponibilidad de la infraestructura para satisfacer adecuadamente los requisitos globales de alta disponibilidad.",
            "guid": "56c57ba5-9119-4bf8-b8f5-c586c7d9cdc1",
            "id": "A01.01",
            "link": "https://azure.microsoft.com/support/legal/sla/virtual-desktop/v1_0/",
            "severity": "Alto",
            "subcategory": "Calcular",
            "text": "Determinar el Acuerdo de Nivel de Servicio de Alta Disponibilidad esperado para aplicaciones o escritorios publicados a través de AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "El modelo \"Activo-Activo\" se puede lograr con varios grupos de hosts en diferentes regiones. No se recomienda un único grupo de hosts con máquinas virtuales de diferentes regiones. Si se van a utilizar varios grupos para los mismos usuarios, se debe resolver el problema de cómo sincronizar/replicar los perfiles de usuario. Se puede usar la caché en la nube de FSLogix, pero debe revisarse y planificarse cuidadosamente, o los clientes pueden decidir no sincronizar ni replicar en absoluto. \"Activo-pasivo\" se puede lograr mediante Azure Site Recovery (ASR) o la implementación de grupos a petición con un mecanismo automatizado. Para obtener una explicación detallada sobre BCDR multirregional, lea el artículo complementario en la columna \"Más información\" y esta página relacionada con FSLogix: https://learn.microsoft.com/fslogix/concepts-container-recovery-business-continuity.",
            "guid": "6acc076e-f9b1-441a-a989-579e76b897e7",
            "id": "A01.02",
            "link": "https://learn.microsoft.com/azure/architecture/example-scenario/wvd/azure-virtual-desktop-multi-region-bcdr",
            "severity": "Medio",
            "subcategory": "Calcular",
            "text": "Evalúe los requisitos de recuperación ante desastres geográfica para grupos de hosts de AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Antes de abordar la planeación y el diseño de BCDR de Azure Virtual Desktop, es importante tener en cuenta inicialmente qué aplicaciones consumidas a través de AVD son críticas. Es posible que desee separarlos de las aplicaciones no críticas y usar un grupo de hosts independiente con un enfoque y capacidades de recuperación ante desastres diferentes.",
            "guid": "10a7da7b-e996-46e1-9d3c-4ada97cc3d13",
            "id": "A01.03",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery",
            "severity": "Bajo",
            "subcategory": "Calcular",
            "text": "Separe las aplicaciones críticas en diferentes grupos de hosts de AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Cada grupo de hosts se puede implementar mediante zonas de disponibilidad (AZ) o conjunto de disponibilidad (AS). Para maximizar la resistencia, se recomienda el uso de AZ: en el momento de la creación del grupo de hosts, puede decidir distribuir los hosts de sesión del grupo de hosts entre todas las zonas de disponibilidad disponibles. El uso de AS no protegerá de errores de un solo centro de datos, por lo que solo debe usarse en regiones donde AZ no esté disponible. Más detalles sobre AZ y AVD en el artículo complementario. Para una comparación entre AZ y AS puedes leer aquí: https://learn.microsoft.com/azure/virtual-machines/availability.",
            "guid": "25ab225c-6f4e-4168-9fdd-dea8a4b7cdeb",
            "id": "A01.04",
            "link": "https://techcommunity.microsoft.com/t5/azure-virtual-desktop-blog/announcing-general-availability-of-support-for-azure/ba-p/3636262",
            "severity": "Alto",
            "subcategory": "Calcular",
            "text": "Planear la mejor opción de resistencia para la implementación del grupo de hosts de AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Azure Backup se puede usar para proteger las máquinas virtuales del grupo de hosts. En el caso de los grupos agrupados, esto no es necesario, ya que no debe tener estado. En su lugar, esta opción se puede considerar para los grupos de anfitriones personales.",
            "guid": "4c61fc3f-c14e-4ea6-b69e-8d9a3eec218e",
            "id": "A01.05",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery",
            "severity": "Medio",
            "subcategory": "Calcular",
            "text": "Evaluar el requisito de hacer una copia de seguridad de las VM de host de sesión de AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Incluso en el caso de los grupos personales, se recomienda el uso de zonas de disponibilidad, cuando estén disponibles. Son posibles tres posibles estrategias de recuperación ante desastres en la región, se recomienda seleccionar la mejor en función del costo, RTO/RPO y si es realmente necesario guardar todo el disco del sistema operativo de la máquina virtual: (1) crear cada host de sesión en una zona específica (AZ) y, a continuación, usar Azure Site Recovery (ASR) para replicar en una zona diferente. (2) Use Azure Backup para realizar copias de seguridad y restaurar el host de sesión específico en una zona de disponibilidad diferente. (3) Cree un nuevo host de sesión en una zona de disponibilidad diferente y confíe en FSLogix o OneDrive para que los datos y la configuración estén disponibles en la nueva máquina. Todas las opciones requieren la intervención del administrador para la recuperación ante desastres y la asignación directa de usuarios en el nivel del grupo de hosts, luego deben planificarse y configurarse de antemano.",
            "guid": "5da58639-ca3a-4961-890b-29663c5e10d",
            "id": "A01.06",
            "link": "https://learn.microsoft.com/azure/site-recovery/azure-to-azure-how-to-enable-zone-to-zone-disaster-recovery",
            "severity": "Medio",
            "subcategory": "Calcular",
            "text": "Preparación de una estrategia de recuperación ante desastres local para hosts de sesión de grupo de hosts personales",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Si se usan imágenes personalizadas para implementar VM de AVD Host Pool, es importante asegurarse de que esos artefactos estén disponibles en todas las regiones en las que se implementa AVD. El servicio Azure Compute Gallery se puede usar para replicar imágenes en todas las regiones en las que se implementa un grupo de hosts, con almacenamiento redundante y en varias copias. Tenga en cuenta que el servicio Azure Compute Gallery no es un recurso global. En el caso de los escenarios de recuperación ante desastres, el procedimiento recomendado es tener al menos dos galerías en diferentes regiones.",
            "guid": "dd2e0d5d-771d-441e-9610-cc57b4a4a141",
            "id": "A02.01",
            "link": "https://learn.microsoft.com/azure/virtual-machines/azure-compute-gallery",
            "severity": "Bajo",
            "subcategory": "Dependencias",
            "text": "Planear la disponibilidad de Golden Image entre regiones",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Si los usuarios de la infraestructura AVD necesitan acceso a recursos locales, la alta disponibilidad de la infraestructura de red necesaria para conectarse también es fundamental y debe tenerse en cuenta. Es necesario evaluar la resiliencia de la infraestructura de autenticación. Es necesario tener en cuenta los aspectos de BCDR para las aplicaciones dependientes y otros recursos para garantizar la disponibilidad en la ubicación de recuperación ante desastres secundaria.",
            "guid": "fd339489-8c12-488b-9c6a-57cfb644451e",
            "id": "A02.02",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery",
            "severity": "Medio",
            "subcategory": "Dependencias",
            "text": "Evalúe las dependencias de la infraestructura y las aplicaciones ",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Es posible que no todos los datos dentro de los perfiles de usuario de FSLogix merezcan protección contra desastres. Además, si se usa almacenamiento externo, por ejemplo, OneDrive o servidores de archivos/recursos compartidos, lo que queda en el perfil de FSLogix es mínimo y podría perderse en algunas circunstancias extremas. En otros casos, los datos dentro del perfil se pueden reconstruir desde otros almacenamientos (por ejemplo, la bandeja de entrada de Outlook en modo de caché).",
            "guid": "687ab077-adb5-49e5-a960-3334fdf8cc23",
            "id": "A03.01",
            "link": "https://docs.microsoft.com/fslogix/manage-profile-content-cncpt",
            "severity": "Medio",
            "subcategory": "Almacenamiento",
            "text": "Evalúe qué datos deben protegerse en los contenedores de perfiles y Office",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Es importante evitar la pérdida de datos de los usuarios críticos, el primer paso es evaluar qué datos deben guardarse y protegerse. Si usa OneDrive u otro almacenamiento externo, es posible que no sea necesario guardar el perfil de usuario o los datos de los contenedores de Office. Se debe considerar un mecanismo adecuado para proporcionar protección a los datos críticos de los usuarios. El servicio Azure Backup se puede usar para proteger los datos de los contenedores de Office y de perfil cuando se almacenan en los niveles Estándar y Premium de Azure Files. Las instantáneas y directivas de Azure NetApp Files se pueden usar para Azure NetApp Files (todos los niveles).",
            "guid": "fc4972cc-3cd2-45bf-a707-6e9eab4bed32",
            "id": "A03.02",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery",
            "severity": "Medio",
            "subcategory": "Almacenamiento",
            "text": "Creación de una estrategia de protección de copia de seguridad para contenedores de perfiles y Office",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "En AVD, se pueden usar varios mecanismos y estrategias de replicación para los datos de usuario que residen en contenedores de FSLogix: [Patrón de perfil #1]: mecanismos de replicación de almacenamiento nativo de Azure, por ejemplo, replicación GRS estándar de Azure Files, replicación entre regiones de Azure NetApp Files. Se recomienda usar el almacenamiento replicado de zona (ZRS) o el almacenamiento replicado geográficamente (GRS) para Azure Files. LRS con resistencia solo local se puede usar si no se requiere protección de zona o región. NOTA: Azure Files Share Standard es LRS/ZRS/GRS, pero con la compatibilidad con 100 TB de gran tamaño habilitada, solo se admiten LRS/ZRS. [Patrón de perfil #2]: FSLogix Cloud Cache está integrado en un mecanismo automático para replicar contenedores entre diferentes (hasta 4) cuentas de almacenamiento. Cloud Cache solo se debe usar cuando:(1) La disponibilidad de datos de perfil de usuario o contenedores de Office requiere un acuerdo de nivel de servicio de alta disponibilidad crítico y debe ser resistente a errores de región. (2) La opción de almacenamiento seleccionada no puede satisfacer los requisitos de BCDR. Por ejemplo, con el nivel Premium de Azure File Share o Azure File Share Standard con compatibilidad con archivos grandes habilitada, GRS no está disponible. (3) Cuando se requiere la replicación entre almacenamiento dispar. [Patrón de perfil #3]: Configure solo la recuperación ante desastres geográfica para los datos de la aplicación y no para los contenedores de datos de usuario/perfil: almacene los datos importantes de la aplicación en almacenamientos separados, como OneDrive u otro almacenamiento externo con su propio mecanismo de recuperación ante desastres incorporado.",
            "guid": "9f7547c1-746d-4c56-868a-714435bd09dd",
            "id": "A03.03",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/disaster-recovery",
            "severity": "Medio",
            "subcategory": "Almacenamiento",
            "text": "Evalúe los requisitos de replicación y la resistencia del almacenamiento de contenedores de perfiles para el propósito de BCDR",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Para la recuperación ante desastres local, se puede usar Azure Backup para Azure Files. Para la recuperación ante desastres geográfica entre regiones: GRS para Azure Files solo está disponible con una SKU estándar y no es compatible con recursos compartidos grandes, por lo que no es adecuado en la mayoría de los escenarios de clientes. Si se requiere la replicación geográfica con Azure File Share Premium, se puede evaluar la replicación con la caché en la nube de FSLogix o se debe tener en cuenta la resistencia solo de la zona de disponibilidad (AZ) \"en la región\".",
            "guid": "3d4f3537-c134-46dc-9602-7a71efe1bd05",
            "id": "A03.04",
            "link": "https://docs.microsoft.com/azure/backup/backup-afs",
            "severity": "Medio",
            "subcategory": "Almacenamiento",
            "text": "Revisión de la estrategia de recuperación ante desastres de Azure Files",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "El almacenamiento con redundancia de zona maximizará la resistencia en la región para los datos de perfil de usuario. ZRS es compatible con recursos compartidos de archivos premium a través del tipo de cuenta de almacenamiento \"FileStorage\". ZRS es compatible con las cuentas de almacenamiento estándar de uso general v2. El uso del almacenamiento con redundancia de zona debe combinarse con la implementación con redundancia de zona de los hosts de sesión en cada grupo de hosts. ",
            "guid": "10d4e875-d502-4142-a795-f2b6eff34f88",
            "id": "A03.05",
            "link": "https://learn.microsoft.com/azure/storage/files/files-redundancy#zone-redundant-storage",
            "severity": "Alto",
            "subcategory": "Almacenamiento",
            "text": "Uso del almacenamiento con redundancia de zona (ZRS) para Azure Files para maximizar la resistencia",
            "waf": "Fiabilidad"
        },
        {
            "category": "Continuidad del negocio y recuperación ante desastres",
            "description": "Para la recuperación ante desastres local, está disponible la copia de seguridad nativa de Azure NetApp Files (ANF). ANF es esencialmente redundante localmente, por lo que para la recuperación ante desastres geográfica entre regiones es necesario usar un mecanismo adicional que es la replicación entre regiones (CRR) https://learn.microsoft.com/azure/azure-netapp-files/cross-region-replication-create-peering. Actualmente, ANF no proporciona replicación ni redundancia entre diferentes zonas de disponibilidad (AZ), solo la posibilidad de seleccionar en qué única AZ colocar el volumen ANF: https://learn.microsoft.com/azure/azure-netapp-files/manage-availability-zone-volume-placement.",
            "guid": "23429db7-2281-4376-85cc-57b4a4b18142",
            "id": "A03.06",
            "link": "https://learn.microsoft.com/azure/azure-netapp-files/cross-region-replication-create-peering",
            "severity": "Medio",
            "subcategory": "Almacenamiento",
            "text": "Revisión de la estrategia de recuperación ante desastres de Azure NetApp Files",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Las aplicaciones se pueden preinstalar en las imágenes maestras, se pueden adjuntar mediante la función MSIX y AppAttach o se pueden distribuir a los hosts de sesión después de la implementación del grupo de hosts mediante métodos tradicionales de distribución de software.",
            "guid": "86ba2802-1459-4014-95d3-8e5309ccbd97",
            "id": "B01.01",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/set-up-golden-image",
            "severity": "Alto",
            "subcategory": "Imágenes doradas",
            "text": "Determinar cómo se implementarán las aplicaciones en los grupos de hosts de AVD",
            "waf": "Operaciones"
        },
        {
            "category": "Calcular",
            "description": "Es posible que se requieran varias imágenes maestras para admitir diferentes versiones y/o configuraciones del sistema operativo, diferentes grupos de aplicaciones que deben separarse y no se pueden incluir en una sola imagen.",
            "guid": "9266bcca-274f-4aa1-abf3-9d95d44c7c89",
            "id": "B01.02",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/set-up-golden-image",
            "severity": "Medio",
            "subcategory": "Imágenes doradas",
            "text": "Calcule el número de imágenes áureas que se necesitarán",
            "waf": "Operaciones"
        },
        {
            "category": "Calcular",
            "description": "Determinar qué sistema operativo invitado se usará para implementar cada grupo de hosts: Windows 10 frente a Windows Server, Marketplace frente a imágenes personalizadas",
            "guid": "19ca1f6d-5315-4ae5-84ba-34d4585e2213",
            "id": "B01.03",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/prerequisites?tabs=portal#operating-systems-and-licenses",
            "severity": "Medio",
            "subcategory": "Imágenes doradas",
            "text": "Determine qué imágenes del sistema operativo usará para la implementación del grupo de hosts",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Las imágenes personalizadas de máquinas virtuales de Azure se pueden crear y almacenar de diferentes maneras: en una instancia de Azure Compute Gallery, como un objeto de imagen administrada o como un disco administrado en el almacenamiento. La manera recomendada es usar Azure Compute Gallery.",
            "guid": "5a2adb2c-3e23-426b-b225-ca44e1696fdd",
            "id": "B01.04",
            "link": "https://learn.microsoft.com/azure/virtual-machines/shared-image-galleries",
            "severity": "Bajo",
            "subcategory": "Imágenes doradas",
            "text": "Seleccione la tienda adecuada para imágenes personalizadas",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Si se van a usar imágenes personalizadas, planifique un proceso de compilación automatizado. Si no existe ninguna fábrica de software preexistente, considere la posibilidad de usar plantillas de imagen personalizadas o Azure Image Builder para automatizar el proceso de compilación.",
            "guid": "9bd7bb01-2f7b-495e-86e1-54e2aa359282",
            "id": "B01.05",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/create-custom-image-templates",
            "severity": "Bajo",
            "subcategory": "Imágenes doradas",
            "text": "Diseña tu proceso de compilación para imágenes personalizadas",
            "waf": "Operaciones"
        },
        {
            "category": "Calcular",
            "description": "Hay algunas prácticas recomendadas y recomendaciones conocidas para la personalización de la imagen dorada, asegúrese de consultar el artículo al que se hace referencia.",
            "guid": "deace4cb-1dec-44c6-90c3-fc14eebb36a3",
            "id": "B01.06",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/set-up-golden-image",
            "severity": "Medio",
            "subcategory": "Imágenes doradas",
            "text": "Si se va a usar una imagen personalizada, consulta las prácticas recomendadas para AVD sobre cómo crear una imagen personalizada",
            "waf": "Operaciones"
        },
        {
            "category": "Calcular",
            "description": "La pila de FSLogix instalada en hosts de sesión de AVD no proporciona capacidad de actualización automática. Por esta razón, se recomienda descargar la última versión de FSLogix e incluirla en el proceso de actualización de la imagen dorada.",
            "guid": "ed5c9027-dd1a-4343-86ca-52b199223186",
            "id": "B01.07",
            "link": "https://learn.microsoft.com/fslogix/how-to-install-fslogix",
            "severity": "Alto",
            "subcategory": "Imágenes doradas",
            "text": "Incluir la versión más reciente de FSLogix en el proceso de actualización de la imagen maestra",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Este conjunto de herramientas se ha creado para aplicar automáticamente la configuración a la que se hace referencia en las notas del producto \"Optimización de Windows 10, versión 2004 para un rol de infraestructura de escritorio virtual (VDI)\": https://docs.microsoft.com/windows-server/remote/remote-desktop-services/rds-vdi-recommendations-2004. Se debe tener en cuenta el uso de la herramienta y/o las optimizaciones mencionadas en el documento técnico. ",
            "guid": "829e3fec-2183-4687-a017-7a2b5945bda4",
            "id": "B01.08",
            "link": "https://github.com/The-Virtual-Desktop-Team/Virtual-Desktop-Optimization-Tool",
            "severity": "Bajo",
            "subcategory": "Imágenes doradas",
            "text": "Evalúe el uso de Virtual-Desktop-Optimization-Tool",
            "waf": "Rendimiento"
        },
        {
            "category": "Calcular",
            "description": "Si se usa OneDrive y se incluye en una imagen maestra, asegúrese de seguir el procedimiento de configuración que se indica en el artículo complementario de la sección \"Más información\". No está en el ámbito de esta lista de comprobación de AVD, pero las optimizaciones de OneDrive como \"Redirección de carpetas conocidas\" y \"Archivos a petición\" deben evaluarse para reducir el espacio utilizado en los perfiles de FSLogix y proporcionar una mejor experiencia de usuario. Actualmente, OneDrive no es compatible con aplicaciones remotas.",
            "guid": "e3d3e084-4276-4d4b-bc01-5bcf219e4a1e",
            "id": "B01.09",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/install-office-on-wvd-master-image#install-onedrive-in-per-machine-mode",
            "severity": "Bajo",
            "subcategory": "Imágenes doradas",
            "text": "Determinar si Microsoft OneDrive formará parte de la implementación de AVD",
            "waf": "Operaciones"
        },
        {
            "category": "Calcular",
            "description": "Asegúrese de revisar los requisitos y el procedimiento de configuración contenidos en el artículo complementario en la columna \"Más información\". Dado que las actualizaciones automáticas de Teams estarán deshabilitadas, se recomienda verificar e incluir la última versión de Teams en el proceso de actualización de la imagen dorada.",
            "guid": "b5887953-5d22-4788-9d30-b66c67be5951",
            "id": "B01.10",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/teams-on-AVD",
            "severity": "Bajo",
            "subcategory": "Imágenes doradas",
            "text": "Determinar si Microsoft Teams formará parte de la implementación de AVD",
            "waf": "Rendimiento"
        },
        {
            "category": "Calcular",
            "description": "AVD puede admitir usuarios con diferentes requisitos de idioma y localización en el mismo grupo de hosts. Esto se puede hacer personalizando imágenes doradas para garantizar que los usuarios puedan seleccionar el idioma que necesiten. El procedimiento para configurar paquetes de idioma adicionales en Windows 11 se documenta en el artículo de referencia.",
            "guid": "7c336f3b-822a-498e-8cd1-667d1150df4a",
            "id": "B01.11",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/windows-11-language-packs",
            "severity": "Bajo",
            "subcategory": "Imágenes doradas",
            "text": "Evalúe el requisito de admitir varios idiomas",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Se recomienda encarecidamente usar cuentas de almacenamiento o recursos compartidos independientes para almacenar paquetes MSIX. Si es necesario, el almacenamiento se puede escalar horizontalmente de forma independiente y no se ve afectado por las actividades de E/S de perfil. Azure ofrece varias opciones de almacenamiento que se pueden usar para la conexión de aplicaciones MISX. Se recomienda usar Azure Files o Azure NetApp Files, ya que estas opciones ofrecen el mejor valor entre costo y sobrecarga de administración. ",
            "guid": "90083845-c587-4cb3-a1ec-16a1d076ef9f",
            "id": "B02.01",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-file-share",
            "severity": "Medio",
            "subcategory": "MSIX y AppAttach",
            "text": "No use la misma cuenta de almacenamiento o recurso compartido que los perfiles de FSLogix",
            "waf": "Rendimiento"
        },
        {
            "category": "Calcular",
            "description": "En el artículo al que se hace referencia, informamos sobre pocas pero importantes consideraciones de rendimiento para el uso de MSIX en el contexto de AVD, asegúrese de revisarlas detenidamente.",
            "guid": "241addce-5793-477b-adb3-751ab2ac1fad",
            "id": "B02.02",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-file-share",
            "severity": "Medio",
            "subcategory": "MSIX y AppAttach",
            "text": "Revisión de las consideraciones de rendimiento para MSIX",
            "waf": "Rendimiento"
        },
        {
            "category": "Calcular",
            "description": "La conexión de la aplicación MSIX requiere permisos de solo lectura para acceder al recurso compartido de archivos. Si va a almacenar las aplicaciones MSIX en Azure Files, para los hosts de sesión, deberá asignar a todas las máquinas virtuales de host de sesión permisos de control de acceso basado en rol (RBAC) de cuenta de almacenamiento y de sistema de archivos de nueva tecnología (NTFS) en el recurso compartido.",
            "guid": "66e15d4d-5a2a-4db2-a3e2-326bf225ca41",
            "id": "B02.03",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-file-share",
            "severity": "Medio",
            "subcategory": "MSIX y AppAttach",
            "text": "Comprobación de los permisos de host de sesión adecuados para el recurso compartido MSIX",
            "waf": "Seguridad"
        },
        {
            "category": "Calcular",
            "description": "El proveedor de software de terceros debe proporcionar un paquete MSIX, no se recomienda que el cliente intente el procedimiento de conversión sin el soporte adecuado del propietario de la aplicación.",
            "guid": "bd362caa-ab79-4b19-adab-81932c9fc9d1",
            "id": "B02.04",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-faq",
            "severity": "Bajo",
            "subcategory": "MSIX y AppAttach",
            "text": "Paquetes MSIX para aplicaciones de terceros",
            "waf": "Costar"
        },
        {
            "category": "Calcular",
            "description": "La conexión de aplicaciones MSIX no admite la actualización automática para aplicaciones MSIX, por lo que deben estar deshabilitadas.",
            "guid": "bb88037f-5e6b-4fbb-aed5-03547cc447e8",
            "id": "B02.05",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-faq",
            "severity": "Bajo",
            "subcategory": "MSIX y AppAttach",
            "text": "Deshabilitar la actualización automática de paquetes MSIX",
            "waf": "Operaciones"
        },
        {
            "category": "Calcular",
            "description": "Para aprovechar MSIX y App Attach, la imagen del sistema operativo invitado para el grupo de hosts AVD debe ser Windows 10/11 Enterprise o Windows 10/11 Enterprise Multisesión, versión 2004 o posterior.",
            "guid": "26128a71-f0f1-4cac-9d9e-f1d5e832e42e",
            "id": "B02.06",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/app-attach-faq",
            "severity": "Medio",
            "subcategory": "MSIX y AppAttach",
            "text": "Revisión de la compatibilidad con los sistemas operativos",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Una vez seleccionada la SKU de máquina virtual que se usará para la implementación del grupo de hosts, se recomienda usar el tipo Gen2 de la SKU para obtener una mayor seguridad y capacidades mejoradas.",
            "guid": "e4633254-3185-40a1-b120-bd563a1c8e9d",
            "id": "B03.01",
            "link": "https://docs.microsoft.com/azure/virtual-machines/generation-2",
            "severity": "Medio",
            "subcategory": "Anfitrión de la sesión",
            "text": "Evaluación del uso de la máquina virtual Gen2 para la implementación del grupo de hosts",
            "waf": "Rendimiento"
        },
        {
            "category": "Calcular",
            "description": "MMR redirige el contenido multimedia del host de sesión a su máquina local para un procesamiento y procesamiento más rápidos. Solo funciona cuando reproduce contenido multimedia en Microsoft Edge o Google Chrome. Consulte la URL vinculada para obtener más detalles.",
            "guid": "adecb27f-dc40-40f5-aca2-0090f633b1c9",
            "id": "B03.02",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/multimedia-redirection",
            "severity": "Bajo",
            "subcategory": "Anfitrión de la sesión",
            "text": "Considere la posibilidad de utilizar MMR (MultiMedia Redirection) para obtener un mejor rendimiento de vídeo en el navegador",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "Un grupo de hosts es una colección de máquinas virtuales de Azure que se registran en Azure Virtual Desktop como hosts de sesión. Un grupo de hosts puede ser de dos tipos: Personal y Agrupado. Qué tipo usar, y cuántos, es una decisión de diseño clave que debe documentarse y validarse. Consulte el artículo complementario en la columna \"Más información\" para obtener más detalles.",
            "guid": "8468c55a-775c-46ee-a5b8-6ad8844ce3b2",
            "id": "C01.01",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/terminology#host-pools",
            "severity": "Alto",
            "subcategory": "Planificación de la capacidad",
            "text": "Determinar el tipo de grupo de hosts que se va a utilizar",
            "waf": "Costar"
        },
        {
            "category": "Fundación",
            "description": "Utilice los criterios de diseño para determinar el número de grupos de hosts que se van a implementar. Esto se basará en factores como las diferentes imágenes del sistema operativo, la compatibilidad con varias regiones, las diferencias de hardware de la máquina virtual invitada (como la compatibilidad o no con la GPU), las diferentes expectativas de los usuarios y los requisitos de tiempo de actividad (los ejemplos pueden ser \"Ejecutivos\", \"Trabajadores de oficina\", \"Desarrolladores\", etc.) y la configuración de RDP del grupo de hosts (como la compatibilidad con la redirección de unidades). Estos determinarán el número de grupos de hosts, así como el número de hosts que habrá en cada grupo.",
            "guid": "4e98495f-d3c0-4af2-aa59-a793395a32a7",
            "id": "C01.02",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/terminology?WT.mc_id=Portal-fx#host-pools",
            "severity": "Alto",
            "subcategory": "Planificación de la capacidad",
            "text": "Estimación del número de grupos de hosts diferentes que se van a implementar ",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "Confirme que se entiende bien la diferencia entre la asignación automática y la directa y que la opción seleccionada es adecuada para el escenario en cuestión. Automático es la configuración predeterminada.",
            "guid": "b38b875b-a1cf-4204-a901-3a5d3ce474db",
            "id": "C01.03",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/configure-host-pool-personal-desktop-assignment-type",
            "severity": "Bajo",
            "subcategory": "Planificación de la capacidad",
            "text": "En Personal Host Pool type (Tipo de grupo de hosts personales), seleccione el tipo de asignación adecuado",
            "waf": "Operaciones"
        },
        {
            "category": "Fundación",
            "description": "Compruebe cuál usar y las opciones disponibles, el escalado automático ignora los algoritmos de equilibrio de carga existentes.",
            "guid": "cbd8682a-6abc-4a2a-9fda-1dbf3dc95d48",
            "id": "C01.04",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/host-pool-load-balancing",
            "severity": "Bajo",
            "subcategory": "Planificación de la capacidad",
            "text": "En Tipo de grupo de hosts agrupados, seleccione el mejor método de equilibrio de carga",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "El número de núcleos aumenta, la sobrecarga de sincronización del sistema también aumenta. Especialmente para el inicio de sesión de varios usuarios simultáneamente. Asegúrese de no usar una máquina virtual que sea demasiado grande para el host de sesión",
            "guid": "b3724959-4943-4577-a3a9-e10ff6345f24",
            "id": "C01.05",
            "link": "https://learn.microsoft.com/windows-server/remote/remote-desktop-services/virtual-machine-recs",
            "severity": "Medio",
            "subcategory": "Planificación de la capacidad",
            "text": "Para el tipo de grupo de hosts agrupados, las máquinas virtuales no deben tener más de 32 núcleos",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "AVD no admite la asignación de RemoteApp y el grupo de aplicaciones de escritorio (DAG) en un solo grupo de hosts al mismo conjunto de usuarios. Si lo hace, un solo usuario tendrá dos sesiones de usuario en un único grupo de hosts. Se supone que los usuarios no deben tener dos sesiones activas al mismo tiempo en el mismo grupo de hosts con el mismo perfil.",
            "guid": "b384b7ed-1cdd-457e-a2cd-c8d4d55bc144",
            "id": "C01.06",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/terminology?WT.mc_id=Portal-fx#application-groups",
            "severity": "Alto",
            "subcategory": "Planificación de la capacidad",
            "text": "No use el mismo grupo de hosts para ofrecer escritorios completos (DAG) y aplicaciones remotas al mismo conjunto de usuarios",
            "waf": "Seguridad"
        },
        {
            "category": "Fundación",
            "description": "Hay un límite de 500 grupos de aplicaciones que se pueden crear en AVD para cada inquilino de Microsoft Entra ID (anteriormente Azure AD). El límite se puede aumentar (consulte el enlace complementario para obtener más detalles), pero no se recomienda.",
            "guid": "971cc4a4-b1f7-4c12-90e0-1ad96808f00c",
            "id": "C01.07",
            "link": "https://learn.microsoft.com/azure/azure-resource-manager/management/azure-subscription-service-limits#azure-virtual-desktop-service-limits",
            "severity": "Medio",
            "subcategory": "Planificación de la capacidad",
            "text": "Calcular el número de grupos de aplicaciones necesarios en todos los grupos de hosts del inquilino de Microsoft Entra ID",
            "waf": "Fiabilidad"
        },
        {
            "category": "Fundación",
            "description": "Las aplicaciones se agrupan en grupos de aplicaciones como contenedores para publicar y asignar permisos: se recomienda no publicar más de 50 aplicaciones por grupo de aplicaciones.",
            "guid": "fa9f2895-473d-439b-ab8e-5a5cf92c7f32",
            "id": "C01.08",
            "link": "https://learn.microsoft.com/azure/architecture/example-scenario/wvd/windows-virtual-desktop#considerations",
            "severity": "Bajo",
            "subcategory": "Planificación de la capacidad",
            "text": "Estimar el número de solicitudes para cada grupo de aplicaciones",
            "waf": "Fiabilidad"
        },
        {
            "category": "Fundación",
            "description": "FSLogix no es necesario para los grupos de hosts personales, ya que cada máquina virtual se asigna estáticamente a un solo usuario, por lo que no se necesita una solución de perfil móvil inmediata. En algunos escenarios de uso, FSLogix puede ayudar. Por ejemplo, se puede reasignar una máquina virtual, mover el usuario a otro escritorio o usar un perfil móvil para guardar el perfil de usuario en una ubicación diferente con fines de recuperación ante desastres.",
            "guid": "38b19ab6-0693-4992-9394-5590883916ec",
            "id": "C01.09",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/configure-host-pool-personal-desktop-assignment-type?tabs=azure#reassign-a-personal-desktop",
            "severity": "Bajo",
            "subcategory": "Planificación de la capacidad",
            "text": "Evaluación del uso de FSLogix para grupos de hosts personales",
            "waf": "Fiabilidad"
        },
        {
            "category": "Fundación",
            "description": "Utilice el vínculo proporcionado para establecer un punto de partida para la decisión de SKU y, a continuación, valide mediante una prueba de rendimiento. Asegúrese de que se selecciona un mínimo de cuatro núcleos para producción por host de sesión (multisesión)",
            "guid": "e1112dbd-7ba0-412e-9b94-ef6e047d2ea2",
            "id": "C01.10",
            "link": "https://docs.microsoft.com/windows-server/remote/remote-desktop-services/virtual-machine-recs",
            "severity": "Alto",
            "subcategory": "Planificación de la capacidad",
            "text": "Ejecución de la prueba de rendimiento de la carga de trabajo para determinar la mejor SKU y tamaño de máquina virtual de Azure que se va a usar",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "Es fundamental verificar la capacidad y los límites de AVD informados en el artículo al que se hace referencia. Se aplican límites y umbrales adicionales para la administración de redes, computación, almacenamiento y servicios. ",
            "guid": "992b1cd6-d2f5-44b2-a769-e3a691e8838a",
            "id": "C01.11",
            "link": "https://learn.microsoft.com/azure/architecture/example-scenario/wvd/windows-virtual-desktop#considerations",
            "severity": "Alto",
            "subcategory": "Planificación de la capacidad",
            "text": "Verificar los límites de escalabilidad de AVD para el entorno",
            "waf": "Fiabilidad"
        },
        {
            "category": "Fundación",
            "description": "Los grupos de hosts con GPU requieren una configuración especial, asegúrese de revisar el artículo al que se hace referencia.",
            "guid": "c936667e-13c0-4056-94b1-e945a459837e",
            "id": "C01.12",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/configure-vm-gpu",
            "severity": "Bajo",
            "subcategory": "Planificación de la capacidad",
            "text": "Determinar si los hosts de sesión requerirán GPU",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "Siempre que sea posible, se recomienda aprovechar las SKU de máquina virtual con la característica de redes aceleradas. Esta característica requiere una SKU o tamaño de máquina virtual específicos y versiones del sistema operativo, consulte la lista y los requisitos en el artículo complementario.",
            "guid": "b47a393a-0803-4272-a479-8b1578b219a4",
            "id": "C01.13",
            "link": "https://learn.microsoft.com/azure/virtual-network/accelerated-networking-overview",
            "severity": "Bajo",
            "subcategory": "Planificación de la capacidad",
            "text": "Uso de SKU de máquina virtual de Azure capaces de aprovechar las redes aceleradas",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "Para una planeación e implementación adecuadas, es importante evaluar el número máximo de usuarios simultáneos y totales para cada grupo de hosts. Además, los usuarios de diferentes regiones pueden requerir diferentes grupos de hosts para garantizar la mejor experiencia de usuario.",
            "guid": "bb91a33d-90ca-4e2c-a881-3706f7c0cb9f",
            "id": "C02.01",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/overview",
            "severity": "Medio",
            "subcategory": "Clientes y Usuarios",
            "text": "Evalúe cuántos usuarios se conectarán a AVD y desde qué regiones",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "Se deben evaluar y revisar las dependencias de recursos externos al grupo de AVD, por ejemplo, Active Directory, recursos compartidos de archivos externos u otro almacenamiento, servicios y recursos locales, componentes de infraestructura de red como VPN o ExpressRoute, servicios externos y componentes de terceros. Para todos estos recursos, se debe evaluar la latencia del grupo de hosts AVD y tener en cuenta la conectividad. Además, las consideraciones de BCDR también deben aplicarse a estas dependencias.",
            "guid": "6abca2a4-fda1-4dbf-9dc9-5d48c7c791dc",
            "id": "C02.02",
            "link": "https://learn.microsoft.com/azure/architecture/example-scenario/wvd/windows-virtual-desktop?toc=%2Fazure%2Fvirtual-desktop%2Ftoc.json&bc=%2Fazure%2Fvirtual-desktop%2Fbreadcrumb%2Ftoc.json",
            "severity": "Medio",
            "subcategory": "Clientes y Usuarios",
            "text": "Evaluación de las dependencias externas para cada grupo de hosts",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "AVD ofrece una variedad de tipos de clientes (gruesos, delgados, web) para conectarse a través de diferentes plataformas (Windows, MacOS, iOS, Android). Revise las limitaciones de cada cliente y compare varias opciones cuando sea posible.",
            "guid": "a1f6d565-99e5-458b-a37d-4985e1112dbd",
            "id": "C02.03",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/users/connect-windows",
            "severity": "Bajo",
            "subcategory": "Clientes y Usuarios",
            "text": "Revisar el sistema operativo del cliente de usuario utilizado y el tipo de cliente AVD",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "Dependiendo de las ubicaciones de los usuarios y de la implementación de la región de AVD, es posible que los usuarios tengan una experiencia no óptima, por lo que es importante realizar pruebas lo antes posible en un entorno de PoC pequeño. Ejecute la herramienta \"Estimador de experiencia de Azure Virtual Desktop\" para seleccionar la mejor región de Azure para implementar grupos de hosts. Más allá de la latencia de 150 ms, la experiencia del usuario puede no ser óptima.",
            "guid": "d2f54b29-769e-43a6-a1e8-838ac936667e",
            "id": "C02.04",
            "link": "https://azure.microsoft.com/services/virtual-desktop/assessment/",
            "severity": "Alto",
            "subcategory": "Clientes y Usuarios",
            "text": "Ejecute una prueba de concepto para validar la experiencia del usuario de extremo a extremo y el impacto de la latencia de la red",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "Actualmente, la configuración de RDP solo se puede configurar en el nivel de grupo de hosts, no por usuario o grupo. Si se requiere una configuración diferente para diferentes conjuntos de usuarios, se recomienda crear varios grupos de hosts.",
            "guid": "3b365a5c-7acb-4e48-abe5-4cd79f2e8776",
            "id": "C02.05",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/customize-rdp-properties",
            "severity": "Bajo",
            "subcategory": "Clientes y Usuarios",
            "text": "Evalúe y documente la configuración de RDP para todos los grupos de usuarios",
            "waf": "Seguridad"
        },
        {
            "category": "Fundación",
            "description": "AVD es un servicio no regional, los grupos de hosts se pueden crear en cualquier región, la redirección automática desde el front-end más cercano se realizará automáticamente.",
            "guid": "42e52f47-21d9-428c-8b1b-d521e44a29a9",
            "id": "C03.01",
            "link": "https://azure.microsoft.com/global-infrastructure/services/?products=virtual-desktop",
            "severity": "Alto",
            "subcategory": "General",
            "text": "Determine en qué regiones de Azure se implementarán los grupos de hosts de AVD.",
            "waf": "Rendimiento"
        },
        {
            "category": "Fundación",
            "description": "AVD debe almacenar metadatos para admitir el servicio; Esto se almacena en la geografía especificada. Sin embargo, esto es independiente de las regiones en las que se encuentran los grupos de hosts.",
            "guid": "bad37ead-53cc-47ce-8d7a-aab3571449ab",
            "id": "C03.02",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/data-locations",
            "severity": "Medio",
            "subcategory": "General",
            "text": "Determinar la ubicación de los metadatos para el servicio AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Fundación",
            "description": "Compruebe si hay SKU de máquina virtual específicas, especialmente si necesita SKU de GPU o de especificaciones altas y, finalmente, Azure NetApp Files, si se usa.",
            "guid": "8053d89e-89dc-47b3-9be2-a1a27f7a9e91",
            "id": "C03.03",
            "link": "https://docs.microsoft.com/azure/azure-resource-manager/management/azure-subscription-service-limits",
            "severity": "Bajo",
            "subcategory": "General",
            "text": "Comprobación de las cuotas y la disponibilidad de Azure para tamaños y tipos de máquinas virtuales específicos en las regiones seleccionadas",
            "waf": "Fiabilidad"
        },
        {
            "category": "Identidad",
            "description": "Se recomiendan controladores de dominio de AD en Azure (al menos dos en diferentes zonas de disponibilidad) para reducir la latencia de los usuarios que inician sesión en hosts de sesión de AVD y, finalmente, para Azure NetApp Files y la integración de AD. Un controlador de dominio debe poder comunicarse con los controladores de dominio de TODOS los dominios secundarios. Como alternativa, se debe usar la conectividad local para llegar a los controladores de dominio de AD.",
            "guid": "c14aea7e-65e8-4d9a-9aec-218e6436b073",
            "id": "D01.01",
            "link": "https://docs.microsoft.com/azure/architecture/reference-architectures/identity/adds-extend-domain",
            "severity": "Medio",
            "subcategory": "Active Directory",
            "text": "Creación de al menos dos controladores de dominio (DC) de Active Directory en el entorno de red virtual de Azure cerca del grupo de hosts de AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Identidad",
            "description": "Se recomienda crear una unidad organizativa independiente por grupo de hosts en una jerarquía de unidades organizativas independiente. Estas unidades organizativas contendrán cuentas de máquina de hosts de sesión de AVD. ",
            "guid": "6db55f57-9603-4334-adf9-cc23418db612",
            "id": "D01.02",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/create-host-pools-azure-marketplace",
            "severity": "Medio",
            "subcategory": "Active Directory",
            "text": "Creación de una unidad organizativa específica en Active Directory para cada grupo de hosts",
            "waf": "Operaciones"
        },
        {
            "category": "Identidad",
            "description": "Revisa detenidamente y, potencialmente, bloquea o filtra la herencia de GPO a las unidades organizativas que contienen grupos de hosts de AVD. ",
            "guid": "7126504b-b47a-4393-a080-327294798b15",
            "id": "D01.03",
            "link": "https://docs.microsoft.com/previous-versions/windows/desktop/Policy/group-policy-hierarchy",
            "severity": "Medio",
            "subcategory": "Active Directory",
            "text": "Revise los GPO de dominio que se aplicarán a la unidad organizativa y que afectan a las funcionalidades de hosts de sesión del grupo de hosts",
            "waf": "Operaciones"
        },
        {
            "category": "Identidad",
            "description": "Si se usan GPO de dominio de Active Directory, se recomienda configurar FSLogix mediante la plantilla ADMX de GPO proporcionada integrada a la que se hace referencia en el artículo complementario de la columna \"Más información\"",
            "guid": "2226a8e3-50a4-4ac3-8bd6-ee150553051f",
            "id": "D01.04",
            "link": "https://learn.microsoft.com/fslogix/how-to-use-group-policy-templates",
            "severity": "Medio",
            "subcategory": "Active Directory",
            "text": "Configuración de las opciones de FSLogix mediante la plantilla ADMX de GPO proporcionada integrada",
            "waf": "Operaciones"
        },
        {
            "category": "Identidad",
            "description": "Se recomienda tener una cuenta dedicada específica con permisos mínimos y sin la limitación predeterminada de 10 uniones. Revise el artículo complementario para obtener más detalles.",
            "guid": "347dc560-28a7-41ff-b1cd-15dd2f0d5e77",
            "id": "D01.05",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/prerequisites?tabs=portal#session-hosts",
            "severity": "Medio",
            "subcategory": "Active Directory",
            "text": "Cree una cuenta de usuario dedicada con solo permisos para unir la máquina virtual al dominio",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Evite conceder acceso por usuario, en su lugar, use grupos de AD y replíquelos mediante el conector de Active Directory (ADC) en el identificador de Microsoft Entra (anteriormente Azure AD). ",
            "guid": "2d41e361-1cc5-47b4-a4b1-410d43958a8c",
            "id": "D01.06",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/manage-app-groups",
            "severity": "Medio",
            "subcategory": "Active Directory",
            "text": "Cree un grupo de usuarios de dominio para cada conjunto de usuarios a los que se concederá acceso a cada grupo de aplicaciones de grupo de hosts (DAG o RAG)",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Si se usa la integración de Active Directory (AD) de Azure Files, como parte del procedimiento de configuración, se creará una cuenta de AD para representar la cuenta de almacenamiento (recurso compartido de archivos). Puede optar por registrarse como una cuenta de equipo o una cuenta de inicio de sesión de servicio, consulte las preguntas frecuentes para obtener más información. En el caso de las cuentas de equipo, hay una edad de expiración de contraseña predeterminada establecida en AD de 30 días. Del mismo modo, la cuenta de inicio de sesión del servicio puede tener una antigüedad de caducidad de contraseña predeterminada establecida en el dominio de AD o en la unidad organizativa (OU). Para ambos tipos de cuenta, se recomienda comprobar la antigüedad de expiración de la contraseña configurada en el entorno de AD y planear la actualización de la contraseña de la identidad de la cuenta de almacenamiento de la cuenta de AD antes de la antigüedad máxima de la contraseña. Puede considerar la posibilidad de crear una nueva unidad organizativa (OU) de AD en AD y deshabilitar la directiva de expiración de contraseñas en las cuentas de equipo o las cuentas de inicio de sesión de servicio según corresponda.",
            "guid": "2289b3d6-b57c-4fc6-9546-1e1a3e3453a3",
            "id": "D01.07",
            "link": "https://docs.microsoft.com/azure/storage/files/storage-files-identity-ad-ds-enable",
            "severity": "Alto",
            "subcategory": "Active Directory",
            "text": "Revisión de la directiva de expiración de contraseñas de la organización para las cuentas usadas por la integración de Azure Files AD",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Puede configurarlo mediante Active Directory Connect (ADC) o Azure AD Domain Services (para organizaciones híbridas o en la nube). Microsoft Entra ID es el nuevo nombre de Azure Active Directory (Azure AD).",
            "guid": "5119bf8e-8f58-4542-a7d9-cec166cd072a",
            "id": "D01.08",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/prerequisites?tabs=portal#identity",
            "severity": "Alto",
            "subcategory": "Active Directory",
            "text": "Un bosque/dominio de Windows Server Active Directory debe estar sincronizado con el identificador de Microsoft Entra",
            "waf": "Fiabilidad"
        },
        {
            "category": "Identidad",
            "description": "Si se usa Azure Files y se pueden cumplir los requisitos previos, se recomienda configurar la autenticación Kerberos (identificador de Microsoft Entra). Esta configuración permitirá almacenar perfiles de FSLogix a los que pueden acceder las identidades de usuario híbrido desde hosts de sesión unidos a Azure AD sin necesidad de una línea de visión de red para los controladores de dominio.",
            "guid": "e777fd5e-c5f1-4d6e-8fa9-fc210b88e338",
            "id": "D02.01",
            "link": "https://learn.microsoft.com/azure/storage/files/storage-files-identity-auth-hybrid-identities-enable",
            "severity": "Medio",
            "subcategory": "Id. de Microsoft Entra",
            "text": "Configuración del recurso compartido de Azure Files para el identificador de Microsoft Entra (anteriormente Azure AD) Autenticación Kerberos en el escenario unido al identificador de Microsoft Entra",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Una suscripción de Azure debe estar asociada al mismo inquilino de Microsoft Entra ID (antiguo Azure AD), que contiene una red virtual que contiene o está conectada a la instancia de Windows Server Active Directory Domain Services o Microsoft Entra ID Domain Services.",
            "guid": "6ceb5443-5125-4922-9442-93bb628537a5",
            "id": "D03.01",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/prerequisites?tabs=portal#identity",
            "severity": "Alto",
            "subcategory": "Requisitos",
            "text": "Un inquilino de Microsoft Entra ID debe estar disponible con al menos una suscripción vinculada",
            "waf": "Fiabilidad"
        },
        {
            "category": "Identidad",
            "description": "Azure Virtual Desktop admite diferentes tipos de identidades en función de la configuración que elija. Revise los escenarios admitidos mencionados en el artículo \"Más información\" y documente la decisión de diseño en consecuencia en la columna \"Comentario\". Fundamentalmente, las identidades externas (B2B o B2C) no son compatibles. Asegúrese de revisar también la lista de escenarios admitidos en https://learn.microsoft.com/azure/virtual-desktop/prerequisites?tabs=portal#supported-identity-scenarios.",
            "guid": "b4ce4781-7557-4a1f-8043-332ae199d44c",
            "id": "D03.02",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/authentication",
            "severity": "Alto",
            "subcategory": "Requisitos",
            "text": "Revisión y documentación del escenario de identidad",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Los usuarios necesitan cuentas que estén en el identificador de Microsoft Entra (anteriormente Azure AD). Si también usa AD DS o Azure AD Domain Services en la implementación de Azure Virtual Desktop, estas cuentas deberán ser identidades híbridas, lo que significa que las cuentas de usuario están sincronizadas. Si usa el identificador de Microsoft Entra con AD DS, deberá configurar Azure AD Connect para sincronizar los datos de identidad de usuario entre AD DS y el identificador de Microsoft Entra. Si usa el identificador de Microsoft Entra con Azure AD Domain Services, las cuentas de usuario se sincronizan de forma unidireccional desde el identificador de Microsoft Entra a Azure AD Domain Services. Este proceso de sincronización es automático. AVD también es compatible con las cuentas nativas de Microsoft Entra ID con algunas restricciones. No se admiten identidades externas (B2B o B2C).",
            "guid": "f9b141a8-98a5-435e-9378-97e71ca7da7b",
            "id": "D03.03",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/prerequisites?tabs=portal#supported-identity-scenarios",
            "severity": "Medio",
            "subcategory": "Requisitos",
            "text": "Evaluar los tipos y requisitos de cuentas de usuario",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "AVD admite el inicio de sesión único mediante los Servicios de federación de Active Directory (AD FS) o la autenticación de identificador de Microsoft Entra (anteriormente Azure AD). Esto último es recomendable, consulte los requisitos y la limitación en el artículo 'Más información'. El uso de AD FS podría ser una opción viable si ya está presente en el entorno del cliente, no se recomienda implementar una nueva infraestructura de ADFS solo para la implementación de AVD SSO.",
            "guid": "5f9f680a-ba07-4429-bbf7-93d7071561f4",
            "id": "D03.04",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/authentication#single-sign-on-sso",
            "severity": "Medio",
            "subcategory": "Requisitos",
            "text": "Si el inicio de sesión único (SSO) es un requisito, revise los escenarios admitidos y los requisitos previos",
            "waf": "Fiabilidad"
        },
        {
            "category": "Identidad",
            "description": "Las máquinas virtuales pueden estar unidas a un dominio de Windows Active Directory (AD), unidas a AD híbrido, unidas a Microsoft Entra ID (anteriormente Azure AD) unido o unido a Azure AD Domain Services. Asegúrese de revisar los escenarios, las limitaciones y los requisitos admitidos del artículo al que se hace referencia.",
            "guid": "ea962a15-9394-46da-a7cc-3923266b2258",
            "id": "D03.05",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/prerequisites?tabs=portal#supported-identity-scenarios",
            "severity": "Alto",
            "subcategory": "Requisitos",
            "text": "Seleccione el tipo de unión de dominio de host de sesión AVD adecuado",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Compare los servicios de dominio de Windows Active Directory autoadministrados, el identificador de Microsoft Entra (anteriormente Azure AD) y los servicios de dominio de Azure AD administrados (AAD-DS)",
            "guid": "6f4a1651-bddd-4ea8-a487-cdeb4861bc3b",
            "id": "D03.06",
            "link": "https://docs.microsoft.com/azure/active-directory-domain-services/compare-identity-solutions",
            "severity": "Bajo",
            "subcategory": "Requisitos",
            "text": "Antes de usar Azure AD Domain Services (AAD-DS) para AVD, asegúrese de revisar las limitaciones.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "AVD proporciona plantillas administrativas para Intune y GPO de Active Directory. Con estas plantillas es posible controlar de forma centralizada varios ajustes de configuración de AVD: registro de datos relacionados con gráficos, protección de captura de pantalla, RDP Shortpath para redes administradas, marca de agua. Consulte el artículo complementario en la columna 'Más información' para obtener más detalles. NOTA: FSLogix tiene su propia plantilla independiente.",
            "guid": "5549524b-36c0-4f1a-892b-ab3ca78f5db2",
            "id": "E01.01",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/administrative-template",
            "severity": "Bajo",
            "subcategory": "Administración",
            "text": "Usar las plantillas administrativas integradas proporcionadas para la configuración de AVD",
            "waf": "Operaciones"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Determine si ya existe una herramienta de administración de la configuración para administrar la configuración de la máquina virtual del grupo de hosts después de la implementación inicial, por ejemplo, SCCM/SCOM, Intune/ConfigurationManager, soluciones de terceros.",
            "guid": "3334fdf9-1c23-4418-8b65-285269440b4b",
            "id": "E01.02",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/management",
            "severity": "Bajo",
            "subcategory": "Administración",
            "text": "Planeación de la estrategia de administración de la configuración de hosts de sesión de AVD",
            "waf": "Operaciones"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Se recomienda usar Microsoft Intune, si se pueden cumplir los requisitos, para administrar el entorno de Azure Virtual Desktop. Revise los escenarios y requisitos admitidos para habilitar la administración de host de sesión de Intune para AVD en el artículo al que se hace referencia en la columna Más información. Documente su elección en la columna 'Comentario'. En ese artículo, revisa los diferentes requisitos y capacidades para el AVD de https://learn.microsoft.com/mem/intune/fundamentals/windows-virtual-desktop de sesión única y https://learn.microsoft.com/mem/intune/fundamentals/windows-virtual-desktop-multi-session de sesión múltiple.",
            "guid": "63a08be1-6004-4b4a-a79b-f3239faae113",
            "id": "E01.03",
            "link": "https://learn.microsoft.com/mem/intune/fundamentals/azure-virtual-desktop",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Evaluación de la administración de hosts de sesión de Intune para AVD",
            "waf": "Operaciones"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "La herramienta de escalado proporciona una opción de automatización de bajo costo para los clientes que desean optimizar los costos de la máquina virtual del host de sesión. Puede usar la herramienta de escalado para programar máquinas virtuales para que se inicien y detengan en función de las horas punta y las horas de menor actividad, escalar horizontalmente las máquinas virtuales en función del número de sesiones por núcleo de CPU, escalar las máquinas virtuales durante las horas de menor actividad, dejando el número mínimo de máquinas virtuales de host de sesión en ejecución. Todavía no está disponible para el tipo de grupo de anfitriones personales.",
            "guid": "7138b820-102c-4e16-be30-1e6e872e52e3",
            "id": "E01.04",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/autoscale-scenarios",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Evaluación de los requisitos para la capacidad de escalado automático del grupo de hosts",
            "waf": "Fiabilidad"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Start VM On Connect le permite reducir los costos al permitir que los usuarios finales enciendan sus máquinas virtuales (VM) de host de sesión solo cuando las necesiten. A continuación, puede desactivar las máquinas virtuales cuando no sean necesarias. Puede configurar Iniciar máquina virtual al conectarse para grupos de hosts personales o agrupados mediante Azure Portal o PowerShell. Iniciar máquina virtual al conectarse es una configuración de todo el grupo de hosts.",
            "guid": "55f612fe-f215-4f0d-a956-10e7dd96bcbc",
            "id": "E01.05",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/start-virtual-machine-connect",
            "severity": "Bajo",
            "subcategory": "Administración",
            "text": "Considere la posibilidad de usar Iniciar máquina virtual en Connect para grupos de hosts personales",
            "waf": "Costar"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "\"Iniciar VM al conectarse\" proporciona una forma inteligente de iniciar automáticamente hosts de sesión previamente detenidos, pero no proporciona un mecanismo para apagarse cuando no está en uso. Se recomienda a los administradores que configuren directivas adicionales para cerrar la sesión de los usuarios y ejecutar scripts de automatización de Azure para desasignar máquinas virtuales. No se debe permitir que los usuarios apaguen sus hosts personales, ya que no podrán desasignar máquinas virtuales de Azure, por lo que la facturación seguirá activa sin reducción de costos.",
            "guid": "79a686ea-d971-4ea0-a9a8-1aea074c94cb",
            "id": "E01.06",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/start-virtual-machine-connect-faq#are-vms-automatically-deallocated-when-a-user-stops-using-them",
            "severity": "Bajo",
            "subcategory": "Administración",
            "text": "Evaluar la implementación de un mecanismo ad-hoc para cerrar los hosts de sesión de AVD personal",
            "waf": "Costar"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "La facturación de Azure Virtual Desktop se basa principalmente en el costo asociado a los recursos de proceso, redes y almacenamiento consumidos por los grupos de hosts. Además de esto, los costos pueden ser generados por recursos dependientes, por ejemplo, VPN o ExpressRoute o vWAN, controladores de dominio de Active Directory, DNS, etc. No hay ningún costo directo asociado a los objetos AVD, como áreas de trabajo, grupos de hosts o grupos de aplicaciones. Para que los costos asociados a AVD sean más evidentes y se agrupen por grupo de hosts, se recomienda usar la etiqueta 'cm-resource-parent'. ",
            "guid": "51bcafca-476a-48fa-9b91-9645a7679f20",
            "id": "E01.07",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/tag-virtual-desktop-resources",
            "severity": "Bajo",
            "subcategory": "Administración",
            "text": "Revisión y adopción de las etiquetas de Azure sugeridas para Azure Virtual Desktop",
            "waf": "Costar"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Azure Advisor analiza las configuraciones y la telemetría para ofrecer recomendaciones personalizadas para resolver problemas comunes. Con estas recomendaciones, puede optimizar los recursos de Azure para la confiabilidad, la seguridad, la excelencia operativa, el rendimiento y el costo.",
            "guid": "611dd68c-5a4b-4252-8e44-a59a9c2399c4",
            "id": "E01.08",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/azure-advisor-recommendations",
            "severity": "Bajo",
            "subcategory": "Administración",
            "text": "Comprobación periódica de las recomendaciones de Azure Advisor para AVD",
            "waf": "Operaciones"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Los clientes tienen varias opciones: Microsoft Configuration Manager, en este artículo se explica cómo aplicar automáticamente actualizaciones a hosts de sesión de Azure Virtual Desktop que ejecutan Windows 10/11: https://learn.microsoft.com/azure/virtual-desktop/configure-automatic-updates, Microsoft Intune: https://docs.microsoft.com/mem/intune/fundamentals/windows-virtual-desktop-multi-session, Azure Update Management y WSUS solo para el sistema operativo Windows Server (no se admite el sistema operativo cliente):  https://learn.microsoft.com/azure/automation/update-management/operating-system-requirements), herramientas de terceros. Fuera de una situación de parches de seguridad de emergencia, se recomienda alejarse de una estrategia de parches de actualización \"in situ\" y adoptar un enfoque de recreación de imágenes.",
            "guid": "04722da2-9c2b-41cd-922f-54b29bade3aa",
            "id": "E01.09",
            "link": "https://learn.microsoft.com/mem/intune/fundamentals/azure-virtual-desktop-multi-session",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Planeación de una estrategia de actualización y aplicación de parches de emergencia del host de sesión",
            "waf": "Operaciones"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "La función Actualizaciones programadas del agente te permite crear hasta dos ventanas de mantenimiento por grupo de hosts para actualizar los componentes de AVD en un momento conveniente. Se recomienda especificar ventanas de mantenimiento y, a continuación, la actualización de los hosts de sesión no se realizará durante las horas de mayor actividad. Las actualizaciones programadas del agente están deshabilitadas de forma predeterminada. Esto significa que, a menos que habilite esta configuración, el servicio piloto de actualización del agente puede actualizarlo en cualquier momento.",
            "guid": "c067939b-e5ca-4698-b9ce-3bd91843e73f",
            "id": "E01.10",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/scheduled-agent-updates",
            "severity": "Bajo",
            "subcategory": "Administración",
            "text": "Configurar la función Actualizaciones programadas del agente",
            "waf": "Fiabilidad"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Los grupos de hosts son una colección de una o varias máquinas virtuales idénticas dentro del entorno de Azure Virtual Desktop. Se recomienda encarecidamente crear un grupo de hosts de validación en el que se apliquen primero las actualizaciones de servicio. Esto le permite supervisar las actualizaciones del servicio antes de que el servicio las aplique a su entorno estándar o sin validación.",
            "guid": "d1e8c38e-c936-4667-913c-005674b1e944",
            "id": "E01.11",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/create-validation-host-pool",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Creación de un grupo de hosts de validación (canary)",
            "waf": "Operaciones"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Un grupo de hosts de AVD se puede implementar de varias maneras: Azure Portal, plantillas de ARM, herramienta de la CLI de Azure, Powershell, creación manual de máquinas virtuales con token de registro, Terraform, herramientas de terceros. Es importante adoptar los métodos adecuados para admitir la implementación automática a través de herramientas de automatización y CI/CD.",
            "guid": "a459c373-e7ed-4616-83b3-65a917ecbe48",
            "id": "E01.12",
            "link": "https://learn.microsoft.com/azure/cloud-adoption-framework/scenarios/wvd/eslz-platform-automation-and-devops",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Determinación de la estrategia de implementación del grupo de hosts",
            "waf": "Operaciones"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Después de registrar una máquina virtual en un grupo de hosts dentro del servicio Azure Virtual Desktop, el agente actualiza periódicamente el token de la máquina virtual cada vez que la máquina virtual está activa. El certificado del token de registro es válido durante 90 días. Debido a este límite de 90 días, se recomienda que las máquinas virtuales estén en línea durante 20 minutos cada 90 días para que la máquina pueda actualizar sus tokens y actualizar el agente y los componentes de la pila en paralelo.",
            "guid": "ebe54cd7-df2e-48bb-ac35-81559bb9153e",
            "id": "E01.13",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/faq",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Activar las máquinas virtuales de host de sesión al menos cada 90 días para la actualización de tokens",
            "waf": "Operaciones"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Azure Virtual Desktop Insights es un panel basado en libros de Azure Monitor que ayuda a los profesionales de TI a comprender sus entornos de Azure Virtual Desktop. Lea el artículo al que se hace referencia para obtener información sobre cómo configurar Azure Monitor para Azure Virtual Desktop para supervisar los entornos de AVD.",
            "guid": "63cfff1c-ac59-49ef-8d5a-83dd4de36c1c",
            "id": "E02.01",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/insights",
            "severity": "Alto",
            "subcategory": "Monitorización",
            "text": "Habilitación de la supervisión de AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Azure Virtual Desktop usa Azure Monitor y Log Analytics para la supervisión y las alertas, como muchos otros servicios de Azure. Esto permite a los administradores identificar problemas a través de una única interfaz. El servicio crea registros de actividad para las acciones administrativas y de usuario.  Cada registro de actividad se divide en las siguientes categorías: Administración, Fuente, Conexiones, Registro de host, Errores, Puntos de control. ",
            "guid": "81770afb-c4c0-4e43-a186-58d2857ed671",
            "id": "E02.02",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/diagnostics-log-analytics",
            "severity": "Medio",
            "subcategory": "Monitorización",
            "text": "Habilitación de la configuración de diagnóstico para áreas de trabajo, grupos de hosts, grupos de aplicaciones y máquinas virtuales host en el área de trabajo de Log Analytics",
            "waf": "Fiabilidad"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Consulte el artículo al que se hace referencia y este adicional para configurar la supervisión y las alertas adecuadas para el almacenamiento: https://docs.microsoft.com/azure/storage/files/storage-troubleshooting-files-performance. ",
            "guid": "2463cffe-179c-4599-be0d-5973dd4ce32c",
            "id": "E02.03",
            "link": "https://docs.microsoft.com/azure/storage/files/storage-files-monitoring?tabs=azure-portal",
            "severity": "Medio",
            "subcategory": "Monitorización",
            "text": "Crear alertas en el almacenamiento de perfiles para recibir alertas en caso de uso elevado y limitación",
            "waf": "Fiabilidad"
        },
        {
            "category": "Seguimiento y gestión",
            "description": "Puede usar Azure Service Health para supervisar los problemas de servicio y los avisos de estado de Azure Virtual Desktop. Azure Service Health puede notificarle con diferentes tipos de alertas (por ejemplo, correo electrónico o SMS), ayudarle a comprender el efecto de un problema y mantenerlo actualizado a medida que se resuelve el problema.",
            "guid": "18813706-f7c4-4c0d-9e51-4548d2457ed6",
            "id": "E02.04",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/set-up-service-alerts",
            "severity": "Medio",
            "subcategory": "Monitorización",
            "text": "Configuración de Azure Service Health para alertas de AVD ",
            "waf": "Fiabilidad"
        },
        {
            "category": "Gestión de redes",
            "description": "Si es necesario para conectarse a un entorno local, evalúe la opción de conectividad actual o planee la conectividad necesaria (ExpressRoute, Azure S2S o VPN de NVA de terceros). ",
            "guid": "dd399cfd-7b28-4dc8-9555-6202bfe4563b",
            "id": "F01.01",
            "link": "https://docs.microsoft.com/azure/architecture/reference-architectures/hybrid-networking/",
            "severity": "Medio",
            "subcategory": "Gestión de redes",
            "text": "Determinar si se requiere conectividad híbrida para conectarse al entorno local",
            "waf": "Fiabilidad"
        },
        {
            "category": "Gestión de redes",
            "description": "Los grupos de hosts de AVD se pueden implementar en Azure Virtual WAN o en topologías de red tradicionales de \"Hub & Spoke\". Se recomienda implementar cada grupo de hosts en una red virtual de \"radio\" independiente, no se recomienda usar \"concentrador\".",
            "guid": "c8639648-a652-4d6c-85e5-02965388e5de",
            "id": "F01.02",
            "link": "https://learn.microsoft.com/azure/cloud-adoption-framework/scenarios/wvd/eslz-network-topology-and-connectivity",
            "severity": "Medio",
            "subcategory": "Gestión de redes",
            "text": "Determinación de la ubicación de Azure Virtual Network (VNet) para cada grupo de hosts de AVD",
            "waf": "Rendimiento"
        },
        {
            "category": "Gestión de redes",
            "description": "Evalúe los requisitos de ancho de banda, asegúrese de que el ancho de banda de VPN/ER sea suficiente, asegúrese de que se implementen las reglas de enrutamiento y firewall adecuadas, pruebe la latencia de extremo a extremo. ",
            "guid": "d227dd14-2b06-4c21-a799-9a646f4389a7",
            "id": "F01.03",
            "link": "https://docs.microsoft.com/azure/architecture/reference-architectures/hybrid-networking/",
            "severity": "Medio",
            "subcategory": "Gestión de redes",
            "text": "Evalúe qué recursos locales se requieren de los grupos de hosts de AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Gestión de redes",
            "description": "Hay varias opciones disponibles. Puede usar Azure Firewall o servidores equivalentes de NVA, grupo de seguridad de red (NSG) o servidores proxy. El grupo de seguridad de red no puede habilitar o deshabilitar por dirección URL, solo puertos y protocolos. El proxy solo debe usarse como configuración explícita en el navegador del usuario. Los detalles sobre el uso de Azure Firewall Premium con AVD se informan en el artículo complementario de la columna \"Más información\". Asegúrate de permitir el acceso adecuado a las URL de AVD requeridas. No se recomienda la tunelización forzada en el entorno local.",
            "guid": "fc4972cd-3cd2-41bf-9703-6e5e6b4bed3d",
            "id": "F01.04",
            "link": "https://docs.microsoft.com/azure/firewall/protect-windows-virtual-desktop",
            "severity": "Medio",
            "subcategory": "Gestión de redes",
            "text": "¿Necesitas controlar o restringir el tráfico saliente de Internet para los hosts AVD?",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Las URL necesarias para el acceso al plano de control de AVD por parte de los hosts de sesión se documentan aquí: https://docs.microsoft.com/azure/virtual-desktop/safe-url-list. Hay disponible una herramienta de comprobación para verificar la conectividad de los hosts de sesión: https://docs.microsoft.com/azure/virtual-desktop/safe-url-list#required-url-check-tool. No se recomienda la tunelización forzada en el entorno local.",
            "guid": "65c7acbe-45bb-4e60-ad89-f2e87778424d",
            "id": "F01.05",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/safe-url-list",
            "severity": "Alto",
            "subcategory": "Gestión de redes",
            "text": "Asegúrese de que los puntos de conexión del plano de control de AVD sean accesibles",
            "waf": "Fiabilidad"
        },
        {
            "category": "Gestión de redes",
            "description": "Tenga en cuenta el uso de Azure Defender Endpoint o agentes de terceros similares para controlar la navegación web del usuario, consulte la sección Seguridad para obtener más información.",
            "guid": "73676ae4-6691-4e88-95ad-a42223e13810",
            "id": "F01.06",
            "link": "https://learn.microsoft.com/microsoft-365/security/defender-endpoint/onboard-windows-multi-session-device?view=o365-worldwide",
            "severity": "Medio",
            "subcategory": "Gestión de redes",
            "text": "¿Necesita controlar o restringir el tráfico saliente de Internet solo para los usuarios de hosts AVD? ",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "La UDR y el grupo de seguridad de red personalizados se pueden aplicar a las subredes del grupo de hosts de AVD, por ejemplo, para redirigir a Azure Firewall o NVA, o para filtrar o bloquear el tráfico de red. En este caso, se recomienda revisar cuidadosamente para asegurarse de que se utiliza una ruta óptima para el tráfico saliente al plano de control AVD. Las etiquetas de servicio ahora se pueden usar con UDR y NSG, por lo que el tráfico del plano de administración de AVD se puede permitir fácilmente: https://learn.microsoft.com/azure/virtual-desktop/safe-url-list.",
            "guid": "523181a9-4174-4158-93ff-7ae7c6d37431",
            "id": "F01.07",
            "link": "https://docs.microsoft.com/azure/firewall/protect-windows-virtual-desktop",
            "severity": "Bajo",
            "subcategory": "Gestión de redes",
            "text": "Revisión de UDR y NSG personalizados para subredes de grupo de hosts AVD",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "El tráfico de red de las máquinas virtuales del host de sesión de AVD al plano de control de AVD debe ser lo más directo posible. Redirigir este tráfico a través de un proxy o firewall con inspección profunda de paquetes y/o terminación SSL podría causar problemas graves y una mala experiencia del cliente. Se recomienda omitir el proxy y el firewall solo para el plano de control del AVD. En cambio, el tráfico generado por el usuario que navega por la web debe ser filtrado por el Firewall y/o redirigido a un Proxy. Para obtener más información y directrices, consulte el artículo complementario en la columna \"Más información\".",
            "guid": "cc6edca0-aeca-4566-9e92-cf246f1465af",
            "id": "F01.08",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/proxy-server-support",
            "severity": "Alto",
            "subcategory": "Gestión de redes",
            "text": "No utilice servidores proxy, terminación SSL e inspección profunda de paquetes para el tráfico del plano de control AVD",
            "waf": "Fiabilidad"
        },
        {
            "category": "Gestión de redes",
            "description": "Se recomienda evaluar y revisar los requisitos de ancho de banda de red para los usuarios, en función del tipo de carga de trabajo específico. El artículo al que se hace referencia proporciona estimaciones y recomendaciones generales, pero se requieren medidas específicas para un tamaño adecuado. ",
            "guid": "516785c6-fa96-4c96-ad88-408f372734c8",
            "id": "F01.09",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/rdp-bandwidth",
            "severity": "Bajo",
            "subcategory": "Gestión de redes",
            "text": "Compruebe el ancho de banda de red necesario para cada usuario y en total para la SKU de la máquina virtual",
            "waf": "Rendimiento"
        },
        {
            "category": "Gestión de redes",
            "description": "Si se va a usar el recurso compartido SMB de Azure Files para almacenar perfiles de usuario a través de FSLogix, se recomienda el uso de Private Endpoint (PE) para el acceso privado al almacenamiento. Los hosts de sesión de AVD accederán al almacenamiento mediante una dirección IP privada en la misma red virtual, se recomienda una subred independiente. Esta característica tiene un costo adicional que debe ser evaluado. Si no se va a usar PE, se recomienda al menos el punto de conexión de servicio (sin costo asociado).",
            "guid": "ec27d589-9178-426d-8df2-ff60020f30a6",
            "id": "F01.10",
            "link": "https://learn.microsoft.com/azure/storage/files/storage-files-networking-endpoints",
            "severity": "Medio",
            "subcategory": "Gestión de redes",
            "text": "Evaluación del uso del punto de conexión privado para el recurso compartido de Azure Files",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Las conexiones a Azure Virtual Desktop pueden usar TCP o UDP. RDP Shortpath es una característica de AVD que establece un transporte directo basado en UDP entre un cliente de Escritorio remoto de Windows compatible y un host de sesión. si los clientes tienen línea de visión a los hosts de sesión AVD desde la red interna (no se recomienda el uso de VPN), esta función puede proporcionar una latencia más baja y los mejores rendimientos, como se explica en https://learn.microsoft.com/azure/virtual-desktop/rdp-shortpath?tabs=managed-networks#key-benefits.",
            "guid": "b2074747-d01a-4f61-b1aa-92ad793d9ff4",
            "id": "F01.11",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/shortpath",
            "severity": "Medio",
            "subcategory": "Gestión de redes",
            "text": "Evaluar el uso de RDP ShortPath para clientes que se conectan desde redes internas administradas",
            "waf": "Rendimiento"
        },
        {
            "category": "Seguridad",
            "description": "Se deben usar los mecanismos de seguridad proporcionados por GPO, si están disponibles. Por ejemplo, es posible imponer el bloqueo de pantalla del escritorio y el tiempo de desconexión de la sesión inactiva. Los GPO existentes aplicados al entorno local deben revisarse y, finalmente, aplicarse también para proteger también los hosts AVD cuando se unen al dominio.",
            "guid": "a135e337-897e-431c-97d6-8cb6a22ac19f",
            "id": "G01.01",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/security-guide#establish-maximum-inactive-time-and-disconnection-policies",
            "severity": "Medio",
            "subcategory": "Active Directory",
            "text": "Revisión del GPO de Active Directory para proteger las sesiones de RDP",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Microsoft Defender para punto de conexión admite Azure Virtual Desktop para Windows 10/11 Enterprise multisesión. Consulte el artículo para la incorporación de dispositivos de infraestructura de escritorio virtual (VDI) no persistentes: https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/configure-endpoints-vdi",
            "guid": "b1172576-9ef6-4691-a483-5ac932223ece",
            "id": "G02.01",
            "link": "https://learn.microsoft.com/microsoft-365/security/defender-endpoint/deployment-vdi-microsoft-defender-antivirus",
            "severity": "Alto",
            "subcategory": "Configuración del host",
            "text": "Asegúrese de que se utilizan soluciones antivirus y antimalware",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Los discos de Azure ya están cifrados en reposo de forma predeterminada con claves administradas de Microsoft. El cifrado de disco del sistema operativo de la máquina virtual host es posible y compatible con Azure Disk Encryption (ADE - BitLocker) y Disk Encryption Set (DES - Server Side Encryption), este último se recomienda. El cifrado del almacenamiento de FSLogix mediante Azure Files se puede realizar mediante SSE en Azure Storage. Para obtener información sobre el cifrado de OneDrive, consulte este artículo: https://docs.microsoft.com/compliance/assurance/assurance-encryption-for-microsoft-365-services.",
            "guid": "0fd32907-98bc-4178-adc5-a06ca7144351",
            "id": "G02.02",
            "link": "https://learn.microsoft.com/azure/virtual-machines/disk-encryption-overview",
            "severity": "Bajo",
            "subcategory": "Configuración del host",
            "text": "Evaluar los requisitos de cifrado de disco para hosts de sesión de AVD",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "El lanzamiento seguro son las máquinas virtuales de Azure Gen2 con características de seguridad mejoradas destinadas a proteger contra las amenazas de la parte inferior de la pila a través de vectores de ataque como rootkits, kits de arranque y malware a nivel de kernel. Se recomienda habilitar y aprovechar el arranque seguro, el TPM virtual (vTPM) y la supervisión de integridad.",
            "guid": "36a5a67f-bb9e-4d5b-9547-8c4479816b28",
            "id": "G02.03",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/security-guide#azure-virtual-desktop-support-for-trusted-launch",
            "severity": "Medio",
            "subcategory": "Configuración del host",
            "text": "Habilitación del inicio seguro en hosts de sesión de máquina virtual de Azure Gen2",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Trusted Launch y Gen2 VM no solo son características que mejoran la seguridad y el rendimiento, sino también requisitos del sistema para Windows 11. Al crear un entorno AVD basado en Windows 11, es esencial habilitar estas funciones.",
            "guid": "135d3899-4b31-44d3-bc8f-028871a359d8",
            "id": "G02.04",
            "link": "https://learn.microsoft.com/windows/whats-new/windows-11-requirements",
            "severity": "Alto",
            "subcategory": "Configuración del host",
            "text": "Habilitar el inicio seguro y usar la imagen Gen2 son requisitos del sistema para Windows 11",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "El contenido mostrado se bloqueará u ocultará automáticamente en las capturas de pantalla. Tenga en cuenta que el uso compartido de pantalla también se bloqueará cuando se use Teams u otro software de colaboración que use el uso compartido de pantalla.",
            "guid": "a49dc137-7896-4343-b2bc-1a31bf1d30b6",
            "id": "G02.05",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/screen-capture-protection",
            "severity": "Bajo",
            "subcategory": "Configuración del host",
            "text": "Considere la posibilidad de habilitar la protección de captura de pantalla para evitar que se capture información confidencial",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Si no es absolutamente necesario, la redirección de unidades, impresoras y dispositivos USB al dispositivo local de un usuario en una sesión de escritorio remoto debe estar deshabilitada o muy restringida. Restringir el acceso al Explorador de Windows ocultando las asignaciones de unidades locales y remotas también es una medida segura para adoptar que evita que los usuarios descubran información no deseada sobre la configuración del sistema y los usuarios.",
            "guid": "7ce2cd20-85b4-4f82-828e-6558736ede6a",
            "id": "G02.06",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/security-guide#other-security-tips-for-session-hosts",
            "severity": "Medio",
            "subcategory": "Configuración del host",
            "text": "Restrinja la redirección de dispositivos y la asignación de unidades",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Al elegir un modelo de implementación, puede proporcionar a los usuarios remotos acceso a escritorios virtuales completos o solo a aplicaciones seleccionadas. Las aplicaciones remotas, o RemoteApps, proporcionan una experiencia fluida a medida que el usuario trabaja con aplicaciones en su escritorio virtual. RemoteApps reduce el riesgo al permitir que el usuario solo trabaje con un subconjunto de la máquina remota expuesta por la aplicación.",
            "guid": "4e25d70e-3924-44f4-b66f-d6cdd4f4a973",
            "id": "G03.01",
            "link": "https://learn.microsoft.com/microsoft-365/security/defender-endpoint/web-protection-overview",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Cuando sea posible, prefiera las aplicaciones remotas en lugar de los escritorios completos (DAG)",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "La característica de filtrado de contenido web proporcionada por la funcionalidad de protección web de Microsoft Defender para punto de conexión se puede usar para controlar la navegación web del usuario. Si se utiliza esta herramienta, se recomienda configurar el filtrado web para la navegación web del usuario. Se debe garantizar el acceso del sistema SO invitado a las URL del plano de control AVD requeridas.",
            "guid": "e19dd344-29eb-4722-a237-a151c5bb4e4f",
            "id": "G03.02",
            "link": "https://learn.microsoft.com/microsoft-365/security/defender-endpoint/web-protection-overview",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "¿Necesita controlar o restringir la navegación por Internet de los usuarios desde los hosts de sesión de AVD?",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Le recomendamos que no conceda a los usuarios acceso de administrador a los escritorios virtuales. Si necesita paquetes de software, le recomendamos que los ponga a su disposición a través de las utilidades de administración de configuración.",
            "guid": "a0cdb3b5-4eb2-4eb0-9dda-a3592718e2ed",
            "id": "G03.03",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/security-guide",
            "severity": "Alto",
            "subcategory": "Administración",
            "text": "Asegúrate de que los usuarios de AVD no tengan privilegios de administrador local en los hosts de AVD",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Se recomienda habilitar Defender for Cloud para las suscripciones, las máquinas virtuales, los almacenes de claves y las cuentas de almacenamiento que usa AVD. Con esta herramienta es posible evaluar y gestionar las vulnerabilidades, evaluar el cumplimiento de marcos comunes como PCI, reforzar la seguridad general de tu entorno AVD y medirla a lo largo del tiempo utilizando 'Secure Score': https://learn.microsoft.com/azure/virtual-desktop/security-guide#improve-your-secure-score.",
            "guid": "1814387e-5ca9-4c26-a9b3-2ab5bdfc6998",
            "id": "G03.04",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/security-guide#enable-microsoft-defender-for-cloud",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Habilitación de Microsoft Defender for Cloud para administrar la posición de seguridad de hosts de sesión de AVD",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "La habilitación de la recopilación de registros de auditoría le permite ver la actividad de usuario y administrador relacionada con Azure Virtual Desktop y almacenarla en un repositorio central, como el área de trabajo de Log Analytics. ",
            "guid": "a0916a76-4980-4ad0-b278-ee293c1bc352",
            "id": "G03.05",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/security-guide#collect-audit-logs",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Habilitación del registro de diagnóstico y auditoría",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Asigne los privilegios mínimos necesarios mediante la definición de roles administrativos, de operaciones y de ingeniería a los roles de RBAC de Azure. Para limitar el acceso a roles con privilegios elevados dentro de la zona de aterrizaje de Azure Virtual Desktop, considere la posibilidad de integrarse con Azure Privileged Identity Management (PIM). Mantener el conocimiento de qué equipo es responsable de cada área administrativa determinada le ayuda a determinar los roles y la configuración del control de acceso basado en rol (RBAC) de Azure.",
            "guid": "baaab757-1849-4ab8-893d-c9fc9d1bb73b",
            "id": "G03.06",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/rbac",
            "severity": "Bajo",
            "subcategory": "Administración",
            "text": "Evaluar el requisito de usar roles RBAC personalizados para la administración de AVD",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Los usuarios de AVD no deben tener permiso para instalar la aplicación. Si es necesario, el Control de aplicaciones de Windows Defender (WDAC) se puede usar para controlar qué controladores y aplicaciones pueden ejecutarse en sus clientes de Windows. ",
            "guid": "b9ea80c8-0628-49fc-ae63-125aa4c0a284",
            "id": "G03.07",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/security-guide#windows-defender-application-control",
            "severity": "Medio",
            "subcategory": "Administración",
            "text": "Impedir que los usuarios instalen aplicaciones no autorizadas",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "La habilitación de MFA y CA te permite administrar los riesgos antes de otorgar a los usuarios acceso a tu entorno de AVD. A la hora de decidir a qué usuarios conceder acceso, te recomendamos que también tengas en cuenta quién es el usuario, cómo inicia sesión y qué dispositivo utiliza. En el artículo complementario se proporcionan detalles adicionales y procedimientos de configuración. Microsoft Entra ID es el nuevo nombre de Azure Active Directory (Azure AD).",
            "guid": "916d697d-8ead-4ed2-9bdd-186f1ac252b9",
            "id": "G04.01",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/set-up-mfa",
            "severity": "Medio",
            "subcategory": "Id. de Microsoft Entra",
            "text": "Evaluar el uso de la autenticación multifactor (MFA) y el acceso condicional (CA) para los usuarios de AVD",
            "waf": "Seguridad"
        },
        {
            "category": "Seguridad",
            "description": "Si Zero Trust es un requisito, revisa el artículo complementario en la columna \"Más información\". Proporciona pasos para aplicar los principios de Confianza cero a una implementación de Azure Virtual Desktop.",
            "guid": "221102d0-90af-49fc-b2b7-8d3fe397e43",
            "id": "G05.01",
            "link": "https://learn.microsoft.com/security/zero-trust/azure-infrastructure-avd",
            "severity": "Medio",
            "subcategory": "Confianza cero",
            "text": "Revisar y aplicar los principios y la guía de Zero Trust",
            "waf": "Seguridad"
        },
        {
            "category": "Almacenamiento",
            "description": "Si se utiliza, asegúrese de consultar la lista de prácticas recomendadas y recomendaciones descritas en el artículo al que se hace referencia.",
            "guid": "9164e990-9ae2-48c8-9c33-b6b7808bafe6",
            "id": "H01.01",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/fslogix-containers-azure-files#best-practices-for-azure-virtual-desktop",
            "severity": "Medio",
            "subcategory": "Archivos de Azure",
            "text": "Comprobación de los procedimientos recomendados para Azure Files",
            "waf": "Rendimiento"
        },
        {
            "category": "Almacenamiento",
            "description": "SMB Multichannel permite a los clientes utilizar varias conexiones de red que proporcionan un mayor rendimiento a la vez que reducen el coste de propiedad. El aumento del rendimiento se logra a través de la agregación de ancho de banda en varias NIC y el uso de la compatibilidad con el escalado del lado de recepción (RSS) para que las NIC distribuyan la carga de E/S entre varias CPU.",
            "guid": "5784b6ca-5e9e-4bcf-8b54-c95459ea7369",
            "id": "H01.02",
            "link": "https://learn.microsoft.com/azure/storage/files/storage-files-smb-multichannel-performance",
            "severity": "Bajo",
            "subcategory": "Archivos de Azure",
            "text": "Habilite SMB multicanal cuando use un recurso compartido de archivos premium para hospedar contenedores de perfiles de FSLogix.",
            "waf": "Rendimiento"
        },
        {
            "category": "Almacenamiento",
            "description": "Si se requiere una segunda región para fines de recuperación ante desastres, compruebe también la disponibilidad de NetApp allí.",
            "guid": "4a359836-ee79-4d6c-9d3a-364a5b7abae3",
            "id": "H02.01",
            "link": "https://azure.microsoft.com/global-infrastructure/services/",
            "severity": "Medio",
            "subcategory": "Azure NetApp Files",
            "text": "Si se requiere almacenamiento de NetApp Files, compruebe la disponibilidad del servicio de almacenamiento en su región específica.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Almacenamiento",
            "description": "La opción CA es una configuración recomendada en el escenario de FSLogix, ya que permite una sesión SMB más resistente entre el host de sesión y los archivos de NetApp.",
            "guid": "a2661898-866a-4c8d-9d1f-8cfc86e88024",
            "id": "H02.02",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/create-fslogix-profile-container",
            "severity": "Medio",
            "subcategory": "Azure NetApp Files",
            "text": "Si se utiliza el almacenamiento de archivos de NetApp, habilite la opción CA (disponibilidad continua) para aumentar la resiliencia",
            "waf": "Fiabilidad"
        },
        {
            "category": "Almacenamiento",
            "description": "Se debe crear un sitio de Active Directory para el entorno de red virtual de Azure en el que se creará la subred de Azure NetApp Files (ANF), y ese nombre de sitio debe especificarse en la propiedad de conexión ANF al ejecutar el procedimiento de combinación, como se explica en el artículo de referencia.",
            "guid": "6647e977-db49-48a8-bc35-743f17499d42",
            "id": "H02.03",
            "link": "https://docs.microsoft.com/azure/azure-netapp-files/create-active-directory-connections",
            "severity": "Alto",
            "subcategory": "Azure NetApp Files",
            "text": "Si se usa el almacenamiento de Azure NetApp Files, compruebe la configuración del nombre del sitio de Active Directory en la configuración de conexión de Active Directory",
            "waf": "Fiabilidad"
        },
        {
            "category": "Almacenamiento",
            "description": "Opciones posibles: HDD estándar, SSD estándar o SSD premium. Los discos efímeros no son compatibles, no se recomiendan los discos Ultra. Se recomienda evaluar Premium para el disco del sistema operativo si la densidad de usuarios no es baja y si se usará Cloud Cache. ",
            "guid": "3611c818-b0a0-4bc5-80e4-3a18a9cd289c",
            "id": "H03.01",
            "link": "https://docs.microsoft.com/azure/virtual-machines/disks-types",
            "severity": "Medio",
            "subcategory": "Planificación de la capacidad",
            "text": "Determinar qué tipo de disco administrado se usará para los hosts de sesión",
            "waf": "Rendimiento"
        },
        {
            "category": "Almacenamiento",
            "description": "Las opciones posibles son: Azure NetApp Files, Azure Files, servidor de archivos basado en máquina virtual. File-server no se recomienda. Azure Files Premium suele ser un buen punto de partida. Por lo general, NetApp es necesario para entornos a gran escala y de alto rendimiento. Para obtener una comparación detallada, consulte el artículo en la columna 'Más información'.",
            "guid": "ed6b17db-8255-4462-b2ae-e4553afc8339",
            "id": "H03.02",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/store-fslogix-profile",
            "severity": "Alto",
            "subcategory": "Planificación de la capacidad",
            "text": "Determinar qué solución de back-end de almacenamiento se usará para los perfiles de FSLogix",
            "waf": "Rendimiento"
        },
        {
            "category": "Almacenamiento",
            "description": "Cada grupo de hosts debe usar un conjunto independiente de cuentas o volúmenes de almacenamiento (al menos uno) y recursos compartidos. Los usuarios deben tener un perfil diferente para cada grupo de hosts, ya que los ajustes y las configuraciones son específicos de cada grupo de hosts. Además, el acceso a diferentes grupos de hosts al mismo tiempo puede provocar errores en el VHD/X del perfil de usuario compartido. También se recomienda el uso de diferentes cuentas de almacenamiento o volúmenes para varios recursos compartidos para escalar de forma independiente.",
            "guid": "2fad62bd-5004-453c-ace4-64d862e7f5a4",
            "id": "H03.03",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/store-fslogix-profile",
            "severity": "Alto",
            "subcategory": "Planificación de la capacidad",
            "text": "No comparta el almacenamiento y los perfiles entre diferentes grupos de hosts",
            "waf": "Rendimiento"
        },
        {
            "category": "Almacenamiento",
            "description": "Como punto de partida para calcular los requisitos de rendimiento del almacenamiento de contenedores de perfiles, se recomienda suponer 10 IOPS por usuario en el estado estable y 50 IOPS por usuario durante el inicio y cierre de sesión. Los requisitos de espacio se obtienen simplemente en función del tamaño máximo de perfiles en FSLogix por el número total de usuarios para cada grupo de hosts. Se pueden usar varias cuentas de almacenamiento para el mismo grupo de hosts si es necesario.",
            "guid": "680e7828-9c93-4665-9d02-bff4564b0d93",
            "id": "H03.04",
            "link": "https://learn.microsoft.com/azure/virtual-desktop/faq#what-s-the-largest-profile-size-fslogix-can-handle-",
            "severity": "Alto",
            "subcategory": "Planificación de la capacidad",
            "text": "Verifique los límites de escalabilidad del almacenamiento y los requisitos del grupo de hosts",
            "waf": "Fiabilidad"
        },
        {
            "category": "Almacenamiento",
            "description": "Evite introducir latencia y costos adicionales asociados con el tráfico de red entre regiones siempre que sea posible.",
            "guid": "8aad53cc-79e2-4e86-9673-57c549675c5e",
            "id": "H03.05",
            "link": "https://docs.microsoft.com/azure/virtual-desktop/fslogix-containers-azure-files",
            "severity": "Alto",
            "subcategory": "Planificación de la capacidad",
            "text": "Para obtener un rendimiento óptimo, la solución de almacenamiento y el contenedor de perfiles de FSLogix deben estar en la misma región de Azure.",
            "waf": "Rendimiento"
        },
        {
            "category": "Almacenamiento",
            "description": "La recomendación en Azure Virtual Desktop es usar el contenedor de perfiles sin la división del contenedor de Office (ODFC) a menos que esté planeando escenarios específicos de continuidad empresarial y recuperación ante desastres (BCDR), como se describe en la sección Recuperación ante desastres a continuación. https://docs.microsoft.com/fslogix/profile-container-office-container-cncpt ",
            "guid": "df47d2d9-2881-4b1c-b5d1-e54a29759e39",
            "id": "H04.01",
            "link": "https://learn.microsoft.com/fslogix/concepts-container-types#when-to-use-profile-and-odfc-containers",
            "severity": "Alto",
            "subcategory": "FSLogix",
            "text": "No use contenedores de Office (ODFC) si no es estrictamente necesario y justificado",
            "waf": "Fiabilidad"
        },
        {
            "category": "Almacenamiento",
            "description": "Asegúrese de configurar las siguientes exclusiones de antivirus para los discos duros virtuales de FSLogix Profile Container, como se documenta en el artículo al que se hace referencia en la columna \"Más información\".",
            "guid": "83f63047-22ee-479d-9b5c-3632054b69ba",
            "id": "H04.02",
            "link": "https://learn.microsoft.com/fslogix/overview-prerequisites#configure-antivirus-file-and-folder-exclusions",
            "severity": "Medio",
            "subcategory": "FSLogix",
            "text": "Configure las exclusiones de antivirus recomendadas para FSLogix (incluye no analizar archivos VHD(x) al conectarse).",
            "waf": "Seguridad"
        },
        {
            "category": "Almacenamiento",
            "description": "Los contenedores de perfiles tienen un tamaño máximo predeterminado de 30 GB. Si se prevén contenedores de perfiles grandes y los clientes quieren intentar mantenerlos pequeños, considere la posibilidad de usar OneDrive para hospedar archivos de Office 365 fuera del perfil de FSLogix.",
            "guid": "01e6a84d-e5df-443d-8992-481718d5d1e5",
            "id": "H04.03",
            "link": "https://docs.microsoft.com/fslogix/profile-container-configuration-reference",
            "severity": "Alto",
            "subcategory": "FSLogix",
            "text": "Revise y confirme el tamaño máximo de perfil configurado en FSLogix",
            "waf": "Costar"
        },
        {
            "category": "Almacenamiento",
            "description": "Los valores predeterminados y la configuración recomendada se indican en el artículo complementario de la columna \"Más información\". Si no se deben usar claves o valores recomendados, asegúrese de revisar con un experto en AVD de Microsoft y documentar claramente sus opciones.",
            "guid": "d34aad5e-8c78-4e1d-9666-7313c405674c",
            "id": "H04.04",
            "link": "https://learn.microsoft.com/fslogix/concepts-configuration-examples",
            "severity": "Alto",
            "subcategory": "FSLogix",
            "text": "Revise las claves del Registro de FSLogix y determine cuáles aplicar",
            "waf": "Fiabilidad"
        },
        {
            "category": "Almacenamiento",
            "description": "No se recomiendan las conexiones simultáneas o varias en Azure Virtual Desktop. Las conexiones simultáneas tampoco son compatibles con los hosts de sesión que se ejecutan en un grupo de hosts de Azure Virtual Desktop. OneDrive, si se usa, no admite conexiones simultáneas o varias con el mismo contenedor, bajo ninguna circunstancia. Para varias conexiones, no se recomienda el uso del mismo disco de perfil.",
            "guid": "5e985b85-9c77-43e7-b261-623b775a917e",
            "id": "H04.05",
            "link": "https://learn.microsoft.com/fslogix/concepts-multi-concurrent-connections",
            "severity": "Alto",
            "subcategory": "FSLogix",
            "text": "Evite el uso de conexiones simultáneas o múltiples",
            "waf": "Fiabilidad"
        },
        {
            "category": "Almacenamiento",
            "description": "Cloud Cache usa la unidad del sistema operativo como almacenamiento de caché local y puede generar mucha presión en el disco de la máquina virtual. Según la SKU y el tamaño de la máquina virtual usada, la unidad temporal de la máquina virtual puede ser una solución viable y eficaz para reubicar el contenido almacenado en caché de Cloud Cache. Antes de adoptar esta solución, se deben ejecutar pruebas para confirmar el rendimiento y la estabilidad. Puede encontrar más detalles sobre Cloud Cache aquí: https://learn.microsoft.com/fslogix/concepts-fslogix-cloud-cache. ",
            "guid": "b2d1215a-e114-4ba3-9df5-85ecdcd9bd3b",
            "id": "H04.06",
            "link": "https://docs.microsoft.com/fslogix/cloud-cache-configuration-reference",
            "severity": "Bajo",
            "subcategory": "FSLogix",
            "text": "Si se usa la caché en la nube de FSLogix, considere la posibilidad de mover el directorio de caché a la unidad temporal de la máquina virtual.",
            "waf": "Rendimiento"
        },
        {
            "category": "Almacenamiento",
            "description": "El archivo REDIRECTION.XML se utiliza para controlar qué carpetas se redirigen fuera del contenedor de perfiles a la unidad 'C:'. Las exclusiones deben ser la excepción y nunca deben usarse a menos que la persona que configura la exclusión específica comprenda completamente la exclusión. Las exclusiones siempre deben probarse completamente en el entorno en el que se pretende implementar. La configuración de exclusiones puede afectar a la funcionalidad, la estabilidad y el rendimiento.",
            "guid": "0b50ca97-b1d2-473c-b4d9-6e98b0f912de",
            "id": "H04.07",
            "link": "https://docs.microsoft.com/fslogix/manage-profile-content-cncpt#redirectionsxml",
            "severity": "Medio",
            "subcategory": "FSLogix",
            "text": "Revise el uso de la redirección de FSLogix.",
            "waf": "Costar"
        }
    ],
    "metadata": {
        "name": "Azure Virtual Desktop Review",
        "state": "GA",
        "timestamp": "November 09, 2023"
    },
    "severities": [
        {
            "name": "Alto"
        },
        {
            "name": "Medio"
        },
        {
            "name": "Bajo"
        }
    ],
    "status": [
        {
            "description": "Esta comprobación aún no se ha examinado",
            "name": "No verificado"
        },
        {
            "description": "Hay un elemento de acción asociado a esta comprobación",
            "name": "Abrir"
        },
        {
            "description": "Esta comprobación se ha verificado y no hay más elementos de acción asociados a ella",
            "name": "Cumplido"
        },
        {
            "description": "Recomendación entendida, pero no necesaria por los requisitos actuales",
            "name": "No es necesario"
        },
        {
            "description": "No aplicable para el diseño actual",
            "name": "N/A"
        }
    ],
    "waf": [
        {
            "name": "Fiabilidad"
        },
        {
            "name": "Seguridad"
        },
        {
            "name": "Costar"
        },
        {
            "name": "Operaciones"
        },
        {
            "name": "Rendimiento"
        }
    ],
    "yesno": [
        {
            "name": "Sí"
        },
        {
            "name": "No"
        }
    ]
}