{
    "categories": [
        {
            "name": "Geral"
        },
        {
            "name": "Dados"
        },
        {
            "name": "Calcular"
        },
        {
            "name": "Rede"
        }
    ],
    "items": [
        {
            "category": "Calcular",
            "description": "Os reparos automáticos de instâncias garantem que instâncias não íntegras sejam prontamente identificadas e substituídas, mantendo um conjunto de instâncias íntegras dentro do conjunto de escala.",
            "guid": "7e13c105-675c-41e9-95b4-59837ff7ae7c",
            "link": "https://learn.microsoft.com/azure/virtual-machine-scale-sets/virtual-machine-scale-sets-automatic-instance-repairs",
            "severity": "Baixo",
            "subcategory": "Conjuntos de dimensionamento de VM",
            "text": "Habilite reparos automáticos de instância para resiliência aprimorada de conjuntos de dimensionamento de VM",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Verifique se o Backup do Azure é utilizado adequadamente para atender aos requisitos de resiliência da sua organização para máquinas virtuais (VMs) do Azure.",
            "guid": "4d874a74-8b66-42d6-b150-512a66498f6d",
            "link": "https://learn.microsoft.com/azure/backup/backup-azure-vms-introduction",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Considere o Backup do Azure para atender aos seus requisitos de resiliência para VMs do Azure",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "VMs de instância única que usam SSD Premium ou Ultra Disk para todos os discos do sistema operacional e discos de dados têm a garantia de ter conectividade de máquina virtual de pelo menos 99,9%",
            "guid": "8052d88e-79d1-47b7-9b22-a5a67e7a8ed4",
            "link": "https://learn.microsoft.com/azure/virtual-machines/disks-types",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Usar discos Premium ou Ultra para VMs de produção",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "O Azure replica automaticamente discos gerenciados em uma região para garantir a durabilidade dos dados e proteger contra falhas de ponto único.",
            "guid": "b31e38c3-f298-412b-8363-cffe179b599d",
            "link": "https://learn.microsoft.com/azure/virtual-machines/managed-disks-overview",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Verifique se os discos gerenciados são usados para todas as VMs",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Os discos temporários destinam-se ao armazenamento de curto prazo de dados não persistentes, como arquivos de página, arquivos de permuta ou tempdb do SQL Server. O armazenamento de dados persistentes em discos temporários pode levar à perda de dados durante eventos de manutenção ou reimplantação de VM.",
            "guid": "e0d5973c-d4ce-432c-8881-37f6f7c4c0d4",
            "link": "https://learn.microsoft.com/azure/virtual-machines/managed-disks-overview#temporary-disk",
            "severity": "Média",
            "subcategory": "Máquinas Virtuais",
            "text": "Não use o disco Temp para nada que não seja aceitável ser perdido",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Coloque seus recursos de computação, armazenamento, rede e dados em uma zona de disponibilidade e replique essa organização em outras zonas de disponibilidade.",
            "guid": "e514548d-2447-4ec6-9138-b8200f1ce16e",
            "link": "https://learn.microsoft.com/azure/reliability/availability-zones-overview",
            "severity": "Média",
            "subcategory": "Máquinas Virtuais",
            "text": "Aproveite as zonas de disponibilidade para suas VMs em regiões onde elas são suportadas",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Use pelo menos duas VMs em Conjuntos de Disponibilidade para isolar VMs em domínios de falha e atualização diferentes.",
            "guid": "5a785d6f-e96c-496a-b884-4cf3b2b38c88",
            "link": "https://learn.microsoft.com/azure/virtual-machines/availability-set-overview",
            "severity": "Média",
            "subcategory": "Máquinas Virtuais",
            "text": "Para regiões que não oferecem suporte a zonas de disponibilidade, implante VMs em conjuntos de disponibilidade",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "O Azure fornece várias opções para redundância de VM para atender a diferentes requisitos (Zonas de Disponibilidade, Conjuntos de Dimensionamento de Máquina Virtual, Conjuntos de Disponibilidade, Azure Site Recovery)",
            "guid": "6ba2c021-4991-414a-9d3c-e574dccbd979",
            "link": "https://learn.microsoft.com/azure/virtual-machines/availability",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Evite executar uma carga de trabalho de produção em uma única VM",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "O Azure Site Recovery permite que você obtenha RTO (Recovery Time Objective, objetivo de tempo de recuperação) baixo para suas VMs híbridas e do Azure, fornecendo recursos de replicação contínua e failover.",
            "guid": "2a6bcca2-b5fe-4a1e-af3d-d95d48c7c891",
            "link": "https://learn.microsoft.com/azure/site-recovery/site-recovery-overview",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Para VMs do Azure e locais (Hyper-V/Phyiscal/VMware) com requisitos RTO baixos, use o Azure Site Recovery",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Usando Reservas de Capacidade, você pode gerenciar com eficiência a capacidade para cargas de trabalho críticas, garantindo a disponibilidade de recursos em regiões especificadas.",
            "guid": "bd7bb012-f7b9-45e0-9e15-8e3ea3992c2d",
            "link": "https://learn.microsoft.com/azure/virtual-machines/capacity-reservation-overview",
            "severity": "Baixo",
            "subcategory": "Máquinas Virtuais",
            "text": "Usar reservas de capacidade para cargas de trabalho críticas que exigem capacidade garantida",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Ao garantir que as cotas necessárias sejam aumentadas em sua região de DR antes de testar o failover com ASR, você pode evitar quaisquer restrições de recursos potenciais durante o processo de recuperação de VMs com failover.",
            "guid": "e6e2065b-3a76-4af4-a691-e8939ada4666",
            "link": "https://learn.microsoft.com/azure/quotas/per-vm-quota-requests",
            "severity": "Média",
            "subcategory": "Máquinas Virtuais",
            "text": "Aumentar as cotas na região de DR antes de testar o failover com ASR",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Eventos Agendados é um Serviço de Metadados do Azure que fornece informações sobre eventos de manutenção futuros para máquinas virtuais (VMs). Ao aproveitar os Eventos Agendados, você pode preparar proativamente seus aplicativos para manutenção de VMs, minimizando interrupções e melhorando a disponibilidade de suas VMs.",
            "guid": "6d3b475a-5c7a-4cbe-99bb-e64dd8902e87",
            "link": "https://learn.microsoft.com/azure/virtual-machines/windows/scheduled-events",
            "severity": "Baixo",
            "subcategory": "Máquinas Virtuais",
            "text": "Utilizar eventos agendados para se preparar para a manutenção da VM",
            "waf": "Fiabilidade"
        },
        {
            "category": "Dados",
            "description": "Use ZRS (Zone-redundant Storage, armazenamento com redundância de zona) na região primária para cenários que exijam alta disponibilidade e para restringir a replicação a um determinado país ou região. Para proteção contra desastres regionais, use o GZRS (Geo-zone-redundant Storage, armazenamento redundante de zona geográfica), que combina o ZRS na região primária com a replicação geográfica para uma região secundária?.",
            "guid": "48c7c891-dcb1-4f7d-9769-ae568ba38d4a",
            "link": "https://learn.microsoft.com/azure/storage/common/storage-redundancy",
            "severity": "Média",
            "subcategory": "Contas de armazenamento",
            "text": "Escolha a opção de redundância de dados mais apropriada para o Armazenamento do Azure com base em seus requisitos",
            "waf": "Fiabilidade"
        },
        {
            "category": "Dados",
            "description": "A atribuição de um bloqueio de exclusão à sua conta de armazenamento ajuda a proteger a disponibilidade dos dados, minimizando o risco de interrupções nas operações de negócios.",
            "guid": "85e2213d-bd7b-4b01-8f7b-95e06e158e3e",
            "link": "https://learn.microsoft.com/azure/storage/common/lock-account-resource",
            "severity": "Baixo",
            "subcategory": "Contas de armazenamento",
            "text": "Aplicar um bloqueio Excluir para evitar a exclusão acidental ou mal-intencionada de contas de armazenamento",
            "waf": "Fiabilidade"
        },
        {
            "category": "Dados",
            "description": "A exclusão suave do contêiner protege seus dados de serem excluídos acidentalmente, mantendo os dados excluídos no sistema por um período de tempo especificado.",
            "guid": "a3992c2d-e6e2-4065-a3a7-6af4a691e893",
            "link": "https://learn.microsoft.com/azure/storage/blobs/soft-delete-container-enable",
            "severity": "Baixo",
            "subcategory": "Contas de armazenamento",
            "text": "Habilitar exclusão flexível para contêineres de conta de armazenamento",
            "waf": "Fiabilidade"
        },
        {
            "category": "Dados",
            "description": "A exclusão flexível de blob protege um blob individual e suas versões, instantâneos e metadados contra exclusões ou substituições acidentais, mantendo os dados excluídos no sistema por um período de tempo especificado.",
            "guid": "9ada4666-7e13-4c10-96b9-153d89f89dc7",
            "link": "https://learn.microsoft.com/azure/storage/blobs/soft-delete-blob-enable",
            "severity": "Baixo",
            "subcategory": "Contas de armazenamento",
            "text": "Habilitar exclusão flexível para blobs",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "A exclusão flexível aprimorada do Backup do Azure fornece proteção crítica contra ataques de ransomware, retendo backups excluídos, permitindo a recuperação de possíveis criptografias ou exclusões de ransomware.",
            "guid": "b44be3b1-a27f-48b9-b91b-e1038df03a82",
            "link": "https://learn.microsoft.com/azure/backup/backup-azure-enhanced-soft-delete-about",
            "severity": "Média",
            "subcategory": "Backup",
            "text": "Habilitar a exclusão flexível aprimorada do Backup do Azure para melhorar a proteção e a recuperação de dados",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "A autorização multiusuário do Backup do Azure permite um controle refinado sobre o acesso do usuário aos recursos de backup, permitindo que você restrinja privilégios e garanta autenticação e autorização adequadas para operações de backup.",
            "guid": "2cd463cb-bbc8-4ac2-a9eb-c92a43da1dae",
            "link": "https://learn.microsoft.com/azure/backup/multi-user-authorization-concept",
            "severity": "Baixo",
            "subcategory": "Backup",
            "text": "Implementar autorização multiusuário para o Backup do Azure para garantir acesso seguro e controlado aos recursos de backup",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "O Armazenamento Imutável do Azure fornece uma camada adicional de segurança, garantindo que os dados de backup armazenados no cofre não possam ser modificados ou excluídos por um período de retenção especificado. Isso ajuda a proteger seus backups contra ataques de ransomware que podem tentar comprometer ou manipular seus dados de backup.",
            "guid": "2cc88147-0607-4c1c-aa0e-614658dd458e",
            "link": "https://learn.microsoft.com/azure/backup/backup-azure-immutable-vault-concept?source=recommendations&tabs=recovery-services-vault",
            "severity": "Baixo",
            "subcategory": "Backup",
            "text": "Implemente o armazenamento imutável para seus cofres para proteger contra ransomware e evitar modificações não autorizadas nos backups",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "Defina claramente os requisitos de continuidade de negócios e recuperação de desastres da sua organização para seu ambiente do Azure. Isso inclui identificar os aplicativos, dados e serviços críticos que precisam ser protegidos, bem como especificar os objetivos e estratégias de recuperação desejados.",
            "guid": "72e52e36-11dd-458c-9a4b-1521e43a58a9",
            "link": "https://learn.microsoft.com/azure/cloud-adoption-framework/ready/landing-zone/design-area/management-business-continuity-disaster-recovery",
            "severity": "Alto",
            "subcategory": "Projetar",
            "text": "Definir requisitos de continuidade de negócios e recuperação de desastres",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "Certifique-se de que suas arquiteturas do Azure sejam projetadas com foco na confiabilidade. Considere a implementação de mecanismos tolerantes a falhas, redundância e padrões de resiliência para minimizar o impacto de falhas e maximizar a disponibilidade de seus aplicativos e serviços.",
            "guid": "c2399c4d-7b67-4d0c-9555-62f2b3e4563a",
            "link": "https://learn.microsoft.com/azure/architecture/reliability/architect",
            "severity": "Alto",
            "subcategory": "Projetar",
            "text": "Implementar práticas recomendadas de confiabilidade em arquiteturas do Azure",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "As configurações de IaC podem desempenhar um papel em seu plano de recuperação de desastres, especialmente em situações em que o tempo de recuperação não é sensível ao tempo. Em caso de recreação de infraestrutura em uma segunda região, o IaC pode ser usado para reproduzir a infraestrutura necessária.",
            "guid": "fe237de2-43b1-46c3-8d7a-a9b7570449aa",
            "link": "https://learn.microsoft.com/azure/well-architected/devops/automation-infrastructure",
            "severity": "Média",
            "subcategory": "DevOps",
            "text": "Implementar infraestrutura como código (IaC) para recuperação rápida de infraestrutura",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "O Azure oferece pares de regiões que são separados geograficamente e podem ser usados para replicação entre regiões e recuperação de desastres. Esses pares de regiões fornecem redundância e proteção contra desastres regionais ou de grande escala.",
            "guid": "dcb1f7d5-769a-4e56-aba3-8d4a85e2213d",
            "link": "https://learn.microsoft.com/azure/reliability/cross-region-replication-azure",
            "severity": "Média",
            "subcategory": "Multi-região",
            "text": "Planejar a recuperação entre regiões aproveitando os pares de regiões",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao implantar um Application Gateway com uma contagem mínima de instâncias de duas, você terá pelo menos duas instâncias disponíveis em circunstâncias normais. Caso uma das instâncias encontre um problema, a outra instância manipulará o tráfego enquanto uma nova instância estiver sendo criada. Essa abordagem reduz significativamente o risco de interrupção do serviço e garante uma experiência perfeita para seus usuários.",
            "guid": "93c76286-37a5-451c-9b04-e4f1854387e5",
            "link": "https://learn.microsoft.com/azure/application-gateway/application-gateway-autoscaling-zone-redundant#autoscaling-and-high-availability",
            "severity": "Média",
            "subcategory": "Gateways de aplicativos",
            "text": "Implante gateways de aplicativos com uma contagem mínima de instâncias de 2 para evitar o tempo de inatividade do provisionamento de instâncias",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "O SKU v2 oferece várias vantagens e novos recursos críticos que aumentam a disponibilidade e a resiliência de sua infraestrutura de aplicativos. Um recurso notável suportado pela SKU v2 é a redundância de zona, que permite que uma implantação do Application Gateway abranja várias zonas de disponibilidade.",
            "guid": "ced126cd-032a-4f5b-8fc6-998a535e3378",
            "link": "https://learn.microsoft.com/azure/application-gateway/overview-v2",
            "severity": "Alto",
            "subcategory": "Gateways de aplicativos",
            "text": "Implantar o Gateway de Aplicativo do Azure v2 para suporte à redundância de zona",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "O Azure Front Door fornece recursos de failover automático, garantindo a continuidade no caso de uma região primária ficar indisponível. No entanto, durante o processo de failover, pode haver um breve período (normalmente 20-60 segundos) quando os clientes não podem acessar o aplicativo. É essencial revisar o SLA (contrato de nível de serviço) do Azure Front Door para determinar se confiar exclusivamente no Front Door atende aos seus requisitos de negócios para alta disponibilidade. ",
            "guid": "97e31c67-d68c-4f6a-92a1-194956d697dc",
            "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/app-service-web-app/multi-region#azure-front-door",
            "severity": "Baixo",
            "subcategory": "Azure Front Door",
            "text": "Considere uma solução de gerenciamento de tráfego redundante em conjunto com o Azure Front Door",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao implementar o Gerenciador de Tráfego, você pode configurá-lo para monitorar continuamente a integridade dos pontos de extremidade do aplicativo e redirecionar automaticamente o tráfego para um ponto de extremidade alternativo quando necessário. Essa automação minimiza o tempo de inatividade e fornece uma experiência mais perfeita para seus usuários durante cenários de recuperação de desastres.",
            "guid": "8df03a82-2cd4-463c-abbc-8ac299ebc92a",
            "link": "https://learn.microsoft.com/azure/networking/disaster-recovery-dns-traffic-manager",
            "severity": "Baixo",
            "subcategory": "DNS",
            "text": "Planejar failover automatizado usando o Gerenciador de Tráfego para Tráfego DNS",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Para eliminar um único ponto de falha em seus serviços DNS locais e garantir uma resolução DNS confiável durante cenários de continuidade de negócios e recuperação de desastres, é recomendável utilizar os Resolvedores Privados de DNS do Azure em várias regiões. Ao implantar dois ou mais resolvedores privados de DNS do Azure em regiões diferentes, você pode habilitar o failover de DNS e obter resiliência em sua infraestrutura de DNS.",
            "guid": "43da1dae-2cc8-4814-9060-7c1cca0e6146",
            "link": "https://learn.microsoft.com/azure/dns/tutorial-dns-private-resolver-failover",
            "severity": "Baixo",
            "subcategory": "DNS",
            "text": "Implementar o failover de DNS usando os resolvedores privados de DNS do Azure",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Use um cluster de gateway de dados local para evitar pontos únicos de falha e balancear a carga do tráfego entre gateways.",
            "guid": "89f89dc7-b44b-4e3b-8a27-f8b9e91be103",
            "link": "https://learn.microsoft.com/data-integration/gateway/service-gateway-high-availability-clusters",
            "severity": "Média",
            "subcategory": "Gateways de dados",
            "text": "Usar clusters de gateway de dados locais para garantir alta disponibilidade para dados críticos para os negócios",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao usar a Rota Expressa, é importante projetar para alta disponibilidade incorporando redundância nas redes de parceiros e clientes. Isso pode incluir vários circuitos de Rota Expressa, conexões redundantes da rede para a Microsoft e garantir que o equipamento de rede local tenha conexões redundantes.",
            "guid": "c0e7c28d-c936-4657-802b-ff4564b0d934",
            "link": "https://learn.microsoft.com/azure/expressroute/designing-for-high-availability-with-expressroute",
            "severity": "Média",
            "subcategory": "Rota Expressa",
            "text": "Garanta redundância na rede de parceiros e na rede de clientes ao utilizar o ExpressRoute para alta disponibilidade",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "O circuito primário deve lidar com o tráfego regular enquanto o circuito de backup permanece pronto para assumir o controle se o circuito primário falhar. Utilize atributos BGP para influenciar o roteamento e designar seus circuitos primários e de backup de forma eficaz.",
            "guid": "a359c373-e7dd-4616-83a3-64a907ebae48",
            "link": "https://learn.microsoft.com/azure/expressroute/designing-for-disaster-recovery-with-expressroute-privatepeering",
            "severity": "Média",
            "subcategory": "Rota Expressa",
            "text": "Ao usar vários circuitos da Rota Expressa, certifique-se de que o roteamento permita um primário e um backup",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "A conexão VPN S2S pode fornecer uma solução de backup resiliente e econômica no caso de uma falha de circuito da Rota Expressa. Usando a VPN S2S como um failover, você pode manter a conectividade com seus recursos do Azure sem depender apenas da Rota Expressa.",
            "guid": "ead53cc7-de2e-48aa-ab35-71549ab9153d",
            "link": "https://learn.microsoft.com/azure/expressroute/use-s2s-vpn-as-backup-for-expressroute-privatepeering",
            "severity": "Baixo",
            "subcategory": "Rota Expressa",
            "text": "Considere a implantação de VPN site a site como um backup para seu emparelhamento privado da Rota Expressa",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "O SKU do Standard Load Balancer oferece um SLA de 99,99% e um nível mais alto de disponibilidade de serviço em comparação com o SKU do Basic Load Balancer.",
            "guid": "778468d5-5a78-45d6-be96-c96ad8844cf3",
            "link": "https://learn.microsoft.com/azure/load-balancer/skus",
            "severity": "Média",
            "subcategory": "Balanceadores de Carga",
            "text": "Aproveite a SKU padrão para balanceadores de carga que lidam com o tráfego para aplicativos de produção",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao configurar o balanceador de carga com um frontend redundante de zona, ele pode servir recursos zonais em qualquer região com um único endereço IP. Contanto que pelo menos uma região permaneça íntegra dentro da região, o endereço IP associado ao front-end pode sobreviver a uma ou mais falhas de zona. É recomendável ter vários recursos zonais, como máquinas virtuais de zonas diferentes, no pool de back-end do balanceador de carga. ",
            "guid": "b2b38c88-6ba2-4c02-8499-114a5d3ce574",
            "link": "https://learn.microsoft.com/azure/load-balancer/load-balancer-standard-availability-zones",
            "severity": "Baixo",
            "subcategory": "Balanceadores de Carga",
            "text": "Para balanceadores de carga, considere o uso de um frontend com redundância de zona com vários recursos zonais no back-end",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao projetar testes de integridade para o Balanceador de Carga do Azure, é importante seguir as práticas recomendadas para garantir o monitoramento confiável e preciso de suas instâncias de back-end.",
            "guid": "dccbd979-2a6b-4cca-8b5f-ea1ebf3dd95d",
            "link": "https://learn.microsoft.com/azure/load-balancer/load-balancer-custom-probe-overview#design-guidance",
            "severity": "Baixo",
            "subcategory": "Balanceadores de Carga",
            "text": "Selecione o protocolo correto, intervalos e tempos limite apropriados, caminhos representativos e respostas de teste ao definir os testes de integridade do Load Balancer",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao escolher a melhor opção para implantar NVAs no Azure, é crucial considerar as recomendações do fornecedor e validar se o design específico foi verificado e validado pelo fornecedor de NVA. O fornecedor também deve fornecer a configuração NVA necessária para uma integração perfeita no Azure.",
            "guid": "8b1188b3-c6a4-46ce-a544-451e192d3442",
            "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/dmz/nva-ha",
            "severity": "Alto",
            "subcategory": "NVAs",
            "text": "Implantar NVAs (Network Virtual Appliances) em uma configuração suportada pelo fornecedor para alta disponibilidade",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao implantar gateways VPN em um modo ativo-ativo, você pode distribuir o tráfego VPN em vários gateways, melhorando a confiabilidade e garantindo conectividade contínua em caso de falhas ou manutenção.",
            "guid": "927139b8-2110-42db-b6ea-f11e6f843e53",
            "link": "https://learn.microsoft.com/azure/vpn-gateway/vpn-gateway-highlyavailable",
            "severity": "Média",
            "subcategory": "VPN Gateways",
            "text": "Implante os Gateways de VPN do Azure em um modo ativo-ativo para garantir alta disponibilidade e redundância para suas conexões VPN.",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "As SKUs com redundância de zona garantem que seus gateways VPN estejam física e logicamente separados dentro de uma região, fornecendo resiliência e escalabilidade. Essa configuração de implantação protege sua conectividade de rede local com o Azure contra falhas no nível da zona.",
            "guid": "f4722d92-8c1b-41cd-921f-54b29b9de39a",
            "link": "https://learn.microsoft.com/azure/vpn-gateway/about-zone-redundant-vnet-gateways",
            "severity": "Média",
            "subcategory": "VPN Gateways",
            "text": "Use SKUs com redundância de zona ao implantar gateways VPN para aumentar a resiliência e proteger contra falhas no nível da zona",
            "waf": "Fiabilidade"
        }
    ],
    "metadata": {
        "name": "Resiliency Review",
        "state": "Preview",
        "timestamp": "May 12, 2023"
    },
    "severities": [
        {
            "name": "Alto"
        },
        {
            "name": "Média"
        },
        {
            "name": "Baixo"
        }
    ],
    "status": [
        {
            "description": "Esta verificação ainda não foi analisada",
            "name": "Não verificado"
        },
        {
            "description": "Há um item de ação associado a essa verificação",
            "name": "Abrir"
        },
        {
            "description": "Essa verificação foi verificada e não há outros itens de ação associados a ela",
            "name": "Cumprido"
        },
        {
            "description": "Recomendação compreendida, mas não necessária pelos requisitos atuais",
            "name": "Não é necessário"
        },
        {
            "description": "Não aplicável ao projeto atual",
            "name": "N/A"
        }
    ],
    "waf": [
        {
            "name": "Fiabilidade"
        },
        {
            "name": "Segurança"
        },
        {
            "name": "Custar"
        },
        {
            "name": "Operações"
        },
        {
            "name": "Desempenho"
        }
    ]
}