{
    "categories": [
        {
            "name": "Geral"
        },
        {
            "name": "Dados"
        },
        {
            "name": "Calcular"
        },
        {
            "name": "Rede"
        }
    ],
    "items": [
        {
            "category": "Calcular",
            "description": "Os reparos automáticos de instância garantem que as instâncias não íntegras sejam prontamente identificadas e substituídas, mantendo um conjunto de instâncias íntegras em seu conjunto de dimensionamento.",
            "guid": "7e13c105-675c-41e9-95b4-59837ff7ae7c",
            "link": "https://learn.microsoft.com/azure/virtual-machine-scale-sets/virtual-machine-scale-sets-automatic-instance-repairs",
            "service": "VMSS",
            "severity": "Baixo",
            "subcategory": "Conjuntos de dimensionamento de VM",
            "text": "Habilitar reparos automáticos de instância para resiliência aprimorada de Conjuntos de Dimensionamento de VM",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Verifique se o Backup do Azure é utilizado adequadamente para atender aos requisitos de resiliência da sua organização para VMs (máquinas virtuais) do Azure.",
            "guid": "4d874a74-8b66-42d6-b150-512a66498f6d",
            "link": "https://learn.microsoft.com/azure/backup/backup-azure-vms-introduction",
            "service": "VM",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Considere o Backup do Azure para atender aos seus requisitos de resiliência para VMs do Azure",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "As VMs de Instância Única que usam SSD Premium ou Disco Ultra para todos os Discos do Sistema Operacional e Discos de Dados têm a garantia de ter Conectividade de Máquina Virtual de pelo menos 99,9%",
            "guid": "8052d88e-79d1-47b7-9b22-a5a67e7a8ed4",
            "link": "https://learn.microsoft.com/azure/virtual-machines/disks-types",
            "service": "VM",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Usar discos Premium ou Ultra para VMs de produção",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "O Azure replica automaticamente os discos gerenciados em uma região para garantir a durabilidade dos dados e proteger contra falhas de ponto único.",
            "guid": "b31e38c3-f298-412b-8363-cffe179b599d",
            "link": "https://learn.microsoft.com/azure/virtual-machines/managed-disks-overview",
            "service": "VM",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Verifique se os Managed Disks são usados para todas as VMs",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Os discos temporários destinam-se ao armazenamento de curto prazo de dados não persistentes, como arquivos de paginação, arquivos de permuta ou tempdb do SQL Server. O armazenamento de dados persistentes em discos temporários pode levar à perda de dados durante eventos de manutenção ou reimplantação de VM.",
            "guid": "e0d5973c-d4ce-432c-8881-37f6f7c4c0d4",
            "link": "https://learn.microsoft.com/azure/virtual-machines/managed-disks-overview#temporary-disk",
            "service": "VM",
            "severity": "Média",
            "subcategory": "Máquinas Virtuais",
            "text": "Não use o disco temporário para qualquer coisa que não seja aceitável para ser perdida",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Colocalize seus recursos de computação, armazenamento, rede e dados em uma zona de disponibilidade e replique essa organização em outras zonas de disponibilidade.",
            "guid": "e514548d-2447-4ec6-9138-b8200f1ce16e",
            "link": "https://learn.microsoft.com/azure/reliability/availability-zones-overview",
            "service": "VM",
            "severity": "Média",
            "subcategory": "Máquinas Virtuais",
            "text": "Aproveite as Zonas de Disponibilidade para suas VMs em regiões em que elas têm suporte",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Use pelo menos duas VMs em Conjuntos de Disponibilidade para isolar VMs em diferentes domínios de falha e atualização.",
            "guid": "5a785d6f-e96c-496a-b884-4cf3b2b38c88",
            "link": "https://learn.microsoft.com/azure/virtual-machines/availability-set-overview",
            "service": "VM",
            "severity": "Média",
            "subcategory": "Máquinas Virtuais",
            "text": "Para regiões que não oferecem suporte a Zonas de Disponibilidade, implante VMs em Conjuntos de Disponibilidade",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "O Azure fornece várias opções de redundância de VM para atender a diferentes requisitos (Zonas de Disponibilidade, Conjuntos de Dimensionamento de Máquinas Virtuais, Conjuntos de Disponibilidade, Azure Site Recovery)",
            "guid": "6ba2c021-4991-414a-9d3c-e574dccbd979",
            "link": "https://learn.microsoft.com/azure/virtual-machines/availability",
            "service": "VM",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Evite executar uma carga de trabalho de produção em uma única VM",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "O Azure Site Recovery permite que você obtenha RTO (Objetivo de Tempo de Recuperação) baixo para suas VMs híbridas e do Azure, fornecendo recursos contínuos de replicação e failover.",
            "guid": "2a6bcca2-b5fe-4a1e-af3d-d95d48c7c891",
            "link": "https://learn.microsoft.com/azure/site-recovery/site-recovery-overview",
            "service": "VM",
            "severity": "Alto",
            "subcategory": "Máquinas Virtuais",
            "text": "Para VMs locais e do Azure (Hyper-V/Phyiscal/VMware) com requisitos de RTO baixos, use o Azure Site Recovery",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Usando as Reservas de Capacidade, você pode gerenciar com eficiência a capacidade de cargas de trabalho críticas, garantindo a disponibilidade de recursos em regiões especificadas.",
            "guid": "bd7bb012-f7b9-45e0-9e15-8e3ea3992c2d",
            "link": "https://learn.microsoft.com/azure/virtual-machines/capacity-reservation-overview",
            "service": "VM",
            "severity": "Baixo",
            "subcategory": "Máquinas Virtuais",
            "text": "Use Reservas de Capacidade para cargas de trabalho críticas que exigem capacidade garantida",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Ao garantir que as cotas necessárias sejam aumentadas em sua região de DR antes de testar o failover com ASR, você pode evitar possíveis restrições de recursos durante o processo de recuperação para VMs com failover.",
            "guid": "e6e2065b-3a76-4af4-a691-e8939ada4666",
            "link": "https://learn.microsoft.com/azure/quotas/per-vm-quota-requests",
            "service": "VM",
            "severity": "Média",
            "subcategory": "Máquinas Virtuais",
            "text": "Aumentar as cotas na região de DR antes de testar o failover com ASR",
            "waf": "Fiabilidade"
        },
        {
            "category": "Calcular",
            "description": "Eventos Agendados é um Serviço de Metadados do Azure que fornece informações sobre os próximos eventos de manutenção para VMs (máquinas virtuais). Ao aproveitar os eventos agendados, você pode preparar proativamente seus aplicativos para manutenção de VM, minimizando a interrupção e melhorando a disponibilidade de suas VMs.",
            "guid": "6d3b475a-5c7a-4cbe-99bb-e64dd8902e87",
            "link": "https://learn.microsoft.com/azure/virtual-machines/windows/scheduled-events",
            "service": "VM",
            "severity": "Baixo",
            "subcategory": "Máquinas Virtuais",
            "text": "Utilize eventos agendados para se preparar para a manutenção da VM",
            "waf": "Fiabilidade"
        },
        {
            "category": "Dados",
            "description": "Use o ZRS (Armazenamento com Redundância de Zona) na região primária para cenários que exigem alta disponibilidade e para restringir a replicação a um determinado país ou região. Para proteção contra desastres regionais, use o GZRS (Armazenamento com redundância de zona geográfica), que combina o ZRS na região primária com a replicação geográfica para uma região secundária?.",
            "guid": "48c7c891-dcb1-4f7d-9769-ae568ba38d4a",
            "link": "https://learn.microsoft.com/azure/storage/common/storage-redundancy",
            "service": "Storage",
            "severity": "Média",
            "subcategory": "Contas de armazenamento",
            "text": "Escolha a opção de redundância de dados mais apropriada para o Armazenamento do Azure com base em seus requisitos",
            "waf": "Fiabilidade"
        },
        {
            "category": "Dados",
            "description": "Atribuir um bloqueio de exclusão à sua conta de armazenamento ajuda a proteger a disponibilidade de seus dados, minimizando o risco de interrupções em suas operações comerciais.",
            "guid": "85e2213d-bd7b-4b01-8f7b-95e06e158e3e",
            "link": "https://learn.microsoft.com/azure/storage/common/lock-account-resource",
            "service": "Storage",
            "severity": "Baixo",
            "subcategory": "Contas de armazenamento",
            "text": "Aplicar um bloqueio de exclusão para evitar a exclusão acidental ou mal-intencionada de contas de armazenamento",
            "waf": "Fiabilidade"
        },
        {
            "category": "Dados",
            "description": "A exclusão reversível do contêiner protege seus dados de serem excluídos acidentalmente, mantendo os dados excluídos no sistema por um período de tempo especificado.",
            "guid": "a3992c2d-e6e2-4065-a3a7-6af4a691e893",
            "link": "https://learn.microsoft.com/azure/storage/blobs/soft-delete-container-enable",
            "service": "Storage",
            "severity": "Baixo",
            "subcategory": "Contas de armazenamento",
            "text": "Habilitar exclusão reversível para contêineres de conta de armazenamento",
            "waf": "Fiabilidade"
        },
        {
            "category": "Dados",
            "description": "A exclusão reversível de blob protege um blob individual e suas versões, instantâneos e metadados contra exclusões ou substituições acidentais, mantendo os dados excluídos no sistema por um período de tempo especificado.",
            "guid": "9ada4666-7e13-4c10-96b9-153d89f89dc7",
            "link": "https://learn.microsoft.com/azure/storage/blobs/soft-delete-blob-enable",
            "service": "Storage",
            "severity": "Baixo",
            "subcategory": "Contas de armazenamento",
            "text": "Habilitar exclusão reversível para blobs",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "A exclusão reversível aprimorada do Backup do Azure fornece proteção crítica contra ataques de ransomware, retendo backups excluídos, permitindo a recuperação de possíveis criptografias ou exclusão de ransomware.",
            "guid": "b44be3b1-a27f-48b9-b91b-e1038df03a82",
            "link": "https://learn.microsoft.com/azure/backup/backup-azure-enhanced-soft-delete-about",
            "service": "Backup",
            "severity": "Média",
            "subcategory": "Backup",
            "text": "Habilitar a exclusão temporária aprimorada do Backup do Azure para melhorar a proteção e a recuperação de dados",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "A autorização multiusuário do Backup do Azure permite um controle refinado sobre o acesso do usuário aos recursos de backup, permitindo que você restrinja privilégios e garanta a autenticação e a autorização adequadas para operações de backup.",
            "guid": "2cd463cb-bbc8-4ac2-a9eb-c92a43da1dae",
            "link": "https://learn.microsoft.com/azure/backup/multi-user-authorization-concept",
            "service": "Backup",
            "severity": "Baixo",
            "subcategory": "Backup",
            "text": "Implementar a autorização multiusuário para o Backup do Azure para garantir o acesso seguro e controlado aos recursos de backup",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "O Armazenamento Imutável do Azure fornece uma camada adicional de segurança, garantindo que os dados de backup armazenados no cofre não possam ser modificados ou excluídos por um período de retenção especificado. Isso ajuda a proteger seus backups contra ataques de ransomware que podem tentar comprometer ou manipular seus dados de backup.",
            "guid": "2cc88147-0607-4c1c-aa0e-614658dd458e",
            "link": "https://learn.microsoft.com/azure/backup/backup-azure-immutable-vault-concept?source=recommendations&tabs=recovery-services-vault",
            "service": "Backup",
            "severity": "Baixo",
            "subcategory": "Backup",
            "text": "Implemente o armazenamento imutável para seus cofres para proteger contra ransomware e evitar modificações não autorizadas nos backups",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "Defina claramente os requisitos de continuidade dos negócios e recuperação de desastre da sua organização para seu ambiente do Azure. Isso inclui identificar os aplicativos, dados e serviços críticos que precisam ser protegidos, bem como especificar os objetivos e estratégias de recuperação desejados.",
            "guid": "72e52e36-11dd-458c-9a4b-1521e43a58a9",
            "link": "https://learn.microsoft.com/azure/cloud-adoption-framework/ready/landing-zone/design-area/management-business-continuity-disaster-recovery",
            "severity": "Alto",
            "subcategory": "Projetar",
            "text": "Definir requisitos de continuidade de negócios e recuperação de desastres",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "Verifique se as arquiteturas do Azure foram projetadas com foco na confiabilidade. Considere a implementação de mecanismos tolerantes a falhas, redundância e padrões de resiliência para minimizar o impacto de falhas e maximizar a disponibilidade de seus aplicativos e serviços.",
            "guid": "c2399c4d-7b67-4d0c-9555-62f2b3e4563a",
            "link": "https://learn.microsoft.com/azure/architecture/reliability/architect",
            "severity": "Alto",
            "subcategory": "Projetar",
            "text": "Implementar práticas recomendadas de confiabilidade em arquiteturas do Azure",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "As configurações de IaC podem desempenhar um papel em seu plano de recuperação de desastres, especialmente em situações em que o tempo de recuperação não é sensível ao tempo. No caso de recreação de infraestrutura em uma segunda região, a IaC pode ser usada para reproduzir a infraestrutura necessária.",
            "guid": "fe237de2-43b1-46c3-8d7a-a9b7570449aa",
            "link": "https://learn.microsoft.com/azure/well-architected/devops/automation-infrastructure",
            "severity": "Média",
            "subcategory": "DevOps",
            "text": "Implemente a infraestrutura como código (IaC) para recuperação rápida da infraestrutura",
            "waf": "Fiabilidade"
        },
        {
            "category": "Geral",
            "description": "O Azure oferece pares de regiões separados geograficamente e podem ser usados para replicação entre regiões e recuperação de desastre. Esses pares de regiões fornecem redundância e proteção contra desastres regionais ou de grande escala.",
            "guid": "dcb1f7d5-769a-4e56-aba3-8d4a85e2213d",
            "link": "https://learn.microsoft.com/azure/reliability/cross-region-replication-azure",
            "severity": "Média",
            "subcategory": "Multirregião",
            "text": "Planeje a recuperação entre regiões aproveitando os pares de regiões",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao implantar um Gateway de Aplicativo com uma contagem mínima de instâncias de dois, você terá pelo menos duas instâncias disponíveis em circunstâncias normais. Caso uma das instâncias encontre um problema, a outra instância manipulará o tráfego enquanto uma nova instância estiver sendo criada. Essa abordagem reduz significativamente o risco de interrupção do serviço e garante uma experiência perfeita para seus usuários.",
            "guid": "93c76286-37a5-451c-9b04-e4f1854387e5",
            "link": "https://learn.microsoft.com/azure/application-gateway/application-gateway-autoscaling-zone-redundant#autoscaling-and-high-availability",
            "severity": "Média",
            "subcategory": "Gateways de aplicativo",
            "text": "Implante Gateways de Aplicativo com uma contagem mínima de instâncias de 2 para evitar o tempo de inatividade do provisionamento de instâncias",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "O SKU v2 oferece várias vantagens e novos recursos críticos que aprimoram a disponibilidade e a resiliência de sua infraestrutura de aplicativos. Um recurso notável compatível com o SKU v2 é a redundância de zona, que permite que uma implantação do Gateway de Aplicativo abranja várias Zonas de Disponibilidade.",
            "guid": "ced126cd-032a-4f5b-8fc6-998a535e3378",
            "link": "https://learn.microsoft.com/azure/application-gateway/overview-v2",
            "severity": "Alto",
            "subcategory": "Gateways de aplicativo",
            "text": "Implantar o Gateway de Aplicativo do Azure v2 para suporte à redundância de zona",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "O Azure Front Door fornece recursos de failover automático, garantindo a continuidade no caso de uma região primária ficar indisponível. No entanto, durante o processo de failover, pode haver um breve período (normalmente de 20 a 60 segundos) em que os clientes não podem acessar o aplicativo. É essencial examinar o SLA (contrato de nível de serviço) do Azure Front Door para determinar se confiar exclusivamente no Front Door atende aos seus requisitos de negócios para alta disponibilidade. ",
            "guid": "97e31c67-d68c-4f6a-92a1-194956d697dc",
            "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/app-service-web-app/multi-region#azure-front-door",
            "severity": "Baixo",
            "subcategory": "Porta da Frente Azure",
            "text": "Considere uma solução de gerenciamento de tráfego redundante em conjunto com o Azure Front Door",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao implementar o Gerenciador de Tráfego, você pode configurá-lo para monitorar continuamente a integridade dos pontos de extremidade do aplicativo e redirecionar automaticamente o tráfego para um ponto de extremidade alternativo quando necessário. Essa automação minimiza o tempo de inatividade e fornece uma experiência mais perfeita para seus usuários durante cenários de recuperação de desastres.",
            "guid": "8df03a82-2cd4-463c-abbc-8ac299ebc92a",
            "link": "https://learn.microsoft.com/azure/networking/disaster-recovery-dns-traffic-manager",
            "severity": "Baixo",
            "subcategory": "DNS",
            "text": "Planejar o failover automatizado usando o Gerenciador de Tráfego para Tráfego DNS",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Para eliminar um único ponto de falha em seus serviços DNS locais e garantir uma resolução DNS confiável durante cenários de continuidade dos negócios e recuperação de desastre, é recomendável utilizar os Resolvedores Privados do DNS do Azure em várias regiões. Ao implantar dois ou mais resolvedores privados de DNS do Azure em diferentes regiões, você pode habilitar o failover de DNS e obter resiliência em sua infraestrutura DNS.",
            "guid": "43da1dae-2cc8-4814-9060-7c1cca0e6146",
            "link": "https://learn.microsoft.com/azure/dns/tutorial-dns-private-resolver-failover",
            "service": "DNS",
            "severity": "Baixo",
            "subcategory": "DNS",
            "text": "Implementar o failover de DNS usando os Resolvedores Privados de DNS do Azure",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Use um cluster de gateway de dados local para evitar pontos únicos de falha e balancear a carga do tráfego entre gateways.",
            "guid": "89f89dc7-b44b-4e3b-8a27-f8b9e91be103",
            "link": "https://learn.microsoft.com/data-integration/gateway/service-gateway-high-availability-clusters",
            "service": "Data Gateways",
            "severity": "Média",
            "subcategory": "Gateways de dados",
            "text": "Use clusters de gateway de dados locais para garantir alta disponibilidade para dados comercialmente críticos",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao usar o ExpressRoute, é importante projetar para alta disponibilidade incorporando redundância nas redes de parceiros e clientes. Isso pode incluir vários circuitos do ExpressRoute, conexões redundantes de sua rede com a Microsoft e garantir que seu equipamento de rede local tenha conexões redundantes.",
            "guid": "c0e7c28d-c936-4657-802b-ff4564b0d934",
            "link": "https://learn.microsoft.com/azure/expressroute/designing-for-high-availability-with-expressroute",
            "severity": "Média",
            "subcategory": "ExpressRoute",
            "text": "Garanta a redundância na rede do parceiro e na rede do cliente ao utilizar o ExpressRoute para alta disponibilidade",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "O circuito primário deve lidar com o tráfego regular enquanto o circuito de backup permanece pronto para assumir o controle se o circuito primário falhar. Utilize atributos BGP para influenciar o roteamento e designar seus circuitos primários e de backup de forma eficaz.",
            "guid": "a359c373-e7dd-4616-83a3-64a907ebae48",
            "link": "https://learn.microsoft.com/azure/expressroute/designing-for-disaster-recovery-with-expressroute-privatepeering",
            "severity": "Média",
            "subcategory": "ExpressRoute",
            "text": "Ao usar vários circuitos do ExpressRoute, verifique se o roteamento permite um primário e um backup",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "A conexão VPN S2S pode fornecer uma solução de backup resiliente e econômica no caso de uma falha no circuito do ExpressRoute. Usando a VPN S2S como um failover, você pode manter a conectividade com seus recursos do Azure sem depender apenas do ExpressRoute.",
            "guid": "ead53cc7-de2e-48aa-ab35-71549ab9153d",
            "link": "https://learn.microsoft.com/azure/expressroute/use-s2s-vpn-as-backup-for-expressroute-privatepeering",
            "severity": "Baixo",
            "subcategory": "ExpressRoute",
            "text": "Considere implantar a VPN site a site como um backup para o emparelhamento privado do ExpressRoute",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "O SKU do Standard Load Balancer oferece um SLA de 99,99% e um nível mais alto de disponibilidade de serviço em comparação com o SKU do Basic Load Balancer.",
            "guid": "778468d5-5a78-45d6-be96-c96ad8844cf3",
            "link": "https://learn.microsoft.com/azure/load-balancer/skus",
            "severity": "Média",
            "subcategory": "Balanceadores de carga",
            "text": "Aproveite o SKU Standard para Load Balancers que lidam com o tráfego para aplicativos de produção",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao configurar o balanceador de carga com um front-end com redundância de zona, ele pode atender a recursos zonais em qualquer zona com um único endereço IP. Desde que pelo menos uma zona permaneça íntegra dentro da região, o endereço IP associado ao front-end pode sobreviver a uma ou mais falhas de zona. É recomendável ter vários recursos zonais, como máquinas virtuais de zonas diferentes, no pool de back-end do balanceador de carga. ",
            "guid": "b2b38c88-6ba2-4c02-8499-114a5d3ce574",
            "link": "https://learn.microsoft.com/azure/load-balancer/load-balancer-standard-availability-zones",
            "severity": "Baixo",
            "subcategory": "Balanceadores de carga",
            "text": "Para balanceadores de carga, considere usar um front-end com redundância de zona com vários recursos zonais no back-end",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao projetar investigações de integridade para o Azure Load Balancer, é importante seguir as práticas recomendadas para garantir o monitoramento confiável e preciso de suas instâncias de back-end.",
            "guid": "dccbd979-2a6b-4cca-8b5f-ea1ebf3dd95d",
            "link": "https://learn.microsoft.com/azure/load-balancer/load-balancer-custom-probe-overview#design-guidance",
            "severity": "Baixo",
            "subcategory": "Balanceadores de carga",
            "text": "Selecione o protocolo correto, intervalos e tempos limite apropriados, caminhos representativos e respostas de investigação ao definir as investigações de integridade do balanceador de carga",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao escolher a melhor opção para implantar NVAs no Azure, é crucial considerar as recomendações do fornecedor e validar se o design específico foi examinado e validado pelo fornecedor de NVA. O fornecedor também deve fornecer a configuração de NVA necessária para integração perfeita no Azure.",
            "guid": "8b1188b3-c6a4-46ce-a544-451e192d3442",
            "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/dmz/nva-ha",
            "service": "NVA",
            "severity": "Alto",
            "subcategory": "NVAs",
            "text": "Implantar NVAs (Soluções de Virtualização de Rede) em uma configuração com suporte do fornecedor para alta disponibilidade",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Ao implantar gateways de VPN em um modo ativo-ativo, você pode distribuir o tráfego VPN em vários gateways, melhorando a confiabilidade e garantindo conectividade contínua em caso de falhas ou manutenção.",
            "guid": "927139b8-2110-42db-b6ea-f11e6f843e53",
            "link": "https://learn.microsoft.com/azure/vpn-gateway/vpn-gateway-highlyavailable",
            "severity": "Média",
            "subcategory": "VPN Gateways",
            "text": "Implante os Gateways de VPN do Azure em um modo ativo-ativo para garantir alta disponibilidade e redundância para suas conexões VPN.",
            "waf": "Fiabilidade"
        },
        {
            "category": "Rede",
            "description": "Os SKUs com redundância de zona garantem que seus gateways de VPN sejam separados física e logicamente em uma região, fornecendo resiliência e escalabilidade. Essa configuração de implantação protege sua conectividade de rede local com o Azure contra falhas no nível da zona.",
            "guid": "f4722d92-8c1b-41cd-921f-54b29b9de39a",
            "link": "https://learn.microsoft.com/azure/vpn-gateway/about-zone-redundant-vnet-gateways",
            "severity": "Média",
            "subcategory": "VPN Gateways",
            "text": "Use SKUs com redundância de zona ao implantar Gateways de VPN para aprimorar a resiliência e proteger contra falhas no nível da zona",
            "waf": "Fiabilidade"
        }
    ],
    "metadata": {
        "name": "Resiliency Review",
        "state": "Preview",
        "timestamp": "October 23, 2024",
        "waf": "Reliability"
    },
    "severities": [
        {
            "name": "Alto"
        },
        {
            "name": "Média"
        },
        {
            "name": "Baixo"
        }
    ],
    "status": [
        {
            "description": "Esta verificação ainda não foi analisada",
            "name": "Não verificado"
        },
        {
            "description": "Há um item de ação associado a essa verificação",
            "name": "Abrir"
        },
        {
            "description": "Essa verificação foi verificada e não há mais itens de ação associados a ela",
            "name": "Cumprido"
        },
        {
            "description": "Recomendação compreendida, mas não necessária pelos requisitos atuais",
            "name": "Não é necessário"
        },
        {
            "description": "Não aplicável para o projeto atual",
            "name": "N/A"
        }
    ],
    "waf": [
        {
            "name": "Fiabilidade"
        },
        {
            "name": "Segurança"
        },
        {
            "name": "Custar"
        },
        {
            "name": "Operações"
        },
        {
            "name": "Desempenho"
        }
    ],
    "yesno": [
        {
            "name": "Sim"
        },
        {
            "name": "Não"
        }
    ]
}