{
    "categories": [
        {
            "name": "General"
        },
        {
            "name": "Datos"
        },
        {
            "name": "Calcular"
        },
        {
            "name": "Red"
        }
    ],
    "items": [
        {
            "category": "Calcular",
            "description": "Las reparaciones automáticas de instancias garantizan que las instancias en mal estado se identifiquen y reemplacen rápidamente, manteniendo un conjunto de instancias en buen estado dentro de su conjunto de escalado.",
            "guid": "7e13c105-675c-41e9-95b4-59837ff7ae7c",
            "link": "https://learn.microsoft.com/azure/virtual-machine-scale-sets/virtual-machine-scale-sets-automatic-instance-repairs",
            "severity": "Bajo",
            "subcategory": "Conjuntos de escalado de VM",
            "text": "Habilitar reparaciones automáticas de instancias para mejorar la resistencia de VM Scale Sets",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Asegúrese de que Copia de seguridad de Azure se utiliza correctamente para cumplir los requisitos de resistencia de su organización para máquinas virtuales (VM) de Azure.",
            "guid": "4d874a74-8b66-42d6-b150-512a66498f6d",
            "link": "https://learn.microsoft.com/azure/backup/backup-azure-vms-introduction",
            "severity": "Alto",
            "subcategory": "Máquinas virtuales",
            "text": "Considere la posibilidad de Copia de seguridad de Azure para cumplir sus requisitos de resistencia para máquinas virtuales de Azure",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Se garantiza que las máquinas virtuales de instancia única que usan SSD Premium o Ultra Disk para todos los discos del sistema operativo y discos de datos tienen una conectividad de máquina virtual de al menos el 99,9 %",
            "guid": "8052d88e-79d1-47b7-9b22-a5a67e7a8ed4",
            "link": "https://learn.microsoft.com/azure/virtual-machines/disks-types",
            "severity": "Alto",
            "subcategory": "Máquinas virtuales",
            "text": "Usar discos Premium o Ultra para máquinas virtuales de producción",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Azure replica automáticamente los discos administrados dentro de una región para garantizar la durabilidad de los datos y protegerlos contra errores de punto único.",
            "guid": "b31e38c3-f298-412b-8363-cffe179b599d",
            "link": "https://learn.microsoft.com/azure/virtual-machines/managed-disks-overview",
            "severity": "Alto",
            "subcategory": "Máquinas virtuales",
            "text": "Asegúrese de que los discos administrados se usan para todas las máquinas virtuales",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Los discos temporales están diseñados para el almacenamiento a corto plazo de datos no persistentes, como archivos de paginación, archivos de intercambio o tempdb de SQL Server. El almacenamiento de datos persistentes en discos temporales puede provocar la pérdida de datos durante eventos de mantenimiento o reimplementación de máquinas virtuales.",
            "guid": "e0d5973c-d4ce-432c-8881-37f6f7c4c0d4",
            "link": "https://learn.microsoft.com/azure/virtual-machines/managed-disks-overview#temporary-disk",
            "severity": "Medio",
            "subcategory": "Máquinas virtuales",
            "text": "No utilice el disco temporal para nada que no sea aceptable perderse",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Coubique sus recursos informáticos, de almacenamiento, de red y de datos en una zona de disponibilidad, y replique esta disposición en otras zonas de disponibilidad.",
            "guid": "e514548d-2447-4ec6-9138-b8200f1ce16e",
            "link": "https://learn.microsoft.com/azure/reliability/availability-zones-overview",
            "severity": "Medio",
            "subcategory": "Máquinas virtuales",
            "text": "Aproveche las zonas de disponibilidad para sus máquinas virtuales en las regiones donde son compatibles",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Use al menos dos máquinas virtuales en conjuntos de disponibilidad para aislar máquinas virtuales en diferentes dominios de error y actualización.",
            "guid": "5a785d6f-e96c-496a-b884-4cf3b2b38c88",
            "link": "https://learn.microsoft.com/azure/virtual-machines/availability-set-overview",
            "severity": "Medio",
            "subcategory": "Máquinas virtuales",
            "text": "Para las regiones que no admiten zonas de disponibilidad, implemente máquinas virtuales en conjuntos de disponibilidad",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Azure proporciona varias opciones para que la redundancia de máquinas virtuales cumpla diferentes requisitos (zonas de disponibilidad, conjuntos de escalado de máquinas virtuales, conjuntos de disponibilidad, recuperación de sitios de Azure)",
            "guid": "6ba2c021-4991-414a-9d3c-e574dccbd979",
            "link": "https://learn.microsoft.com/azure/virtual-machines/availability",
            "severity": "Alto",
            "subcategory": "Máquinas virtuales",
            "text": "Evite ejecutar una carga de trabajo de producción en una sola máquina virtual",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Azure Site Recovery le permite lograr un RTO (objetivo de tiempo de recuperación) bajo para sus máquinas virtuales híbridas y de Azure al proporcionar funcionalidades de replicación y conmutación por error continuas.",
            "guid": "2a6bcca2-b5fe-4a1e-af3d-d95d48c7c891",
            "link": "https://learn.microsoft.com/azure/site-recovery/site-recovery-overview",
            "severity": "Alto",
            "subcategory": "Máquinas virtuales",
            "text": "Para máquinas virtuales locales y de Azure (Hyper-V/Phyiscal/VMware) con bajos requisitos de RTO, use Azure Site Recovery",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Mediante el uso de reservas de capacidad, puede administrar eficazmente la capacidad de las cargas de trabajo críticas, lo que garantiza la disponibilidad de recursos en regiones específicas.",
            "guid": "bd7bb012-f7b9-45e0-9e15-8e3ea3992c2d",
            "link": "https://learn.microsoft.com/azure/virtual-machines/capacity-reservation-overview",
            "severity": "Bajo",
            "subcategory": "Máquinas virtuales",
            "text": "Usar reservas de capacidad para cargas de trabajo críticas que requieren capacidad garantizada",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Al asegurarse de que se aumentan las cuotas necesarias en la región de recuperación ante desastres antes de probar la conmutación por error con ASR, puede evitar posibles restricciones de recursos durante el proceso de recuperación de máquinas virtuales por error.",
            "guid": "e6e2065b-3a76-4af4-a691-e8939ada4666",
            "link": "https://learn.microsoft.com/azure/quotas/per-vm-quota-requests",
            "severity": "Medio",
            "subcategory": "Máquinas virtuales",
            "text": "Aumentar las cuotas en la región DR antes de probar la conmutación por error con ASR",
            "waf": "Fiabilidad"
        },
        {
            "category": "Calcular",
            "description": "Eventos programados es un servicio de metadatos de Azure que proporciona información sobre los próximos eventos de mantenimiento para máquinas virtuales (VM). Al aprovechar los eventos programados, puede preparar de forma proactiva sus aplicaciones para el mantenimiento de máquinas virtuales, minimizando las interrupciones y mejorando la disponibilidad de sus máquinas virtuales.",
            "guid": "6d3b475a-5c7a-4cbe-99bb-e64dd8902e87",
            "link": "https://learn.microsoft.com/azure/virtual-machines/windows/scheduled-events",
            "severity": "Bajo",
            "subcategory": "Máquinas virtuales",
            "text": "Utilice eventos programados para prepararse para el mantenimiento de VM",
            "waf": "Fiabilidad"
        },
        {
            "category": "Datos",
            "description": "Use el almacenamiento con redundancia de zona (ZRS) en la región principal para escenarios que requieren alta disponibilidad y para restringir la replicación a un país o región determinados. Para la protección contra desastres regionales, utilice Geo-zone-redundant Storage (GZRS), que combina ZRS en la región primaria con la replicación geográfica en una región secundaria?.",
            "guid": "48c7c891-dcb1-4f7d-9769-ae568ba38d4a",
            "link": "https://learn.microsoft.com/azure/storage/common/storage-redundancy",
            "severity": "Medio",
            "subcategory": "Cuentas de almacenamiento",
            "text": "Elija la opción de redundancia de datos más adecuada para Azure Storage en función de sus requisitos",
            "waf": "Fiabilidad"
        },
        {
            "category": "Datos",
            "description": "Asignar un bloqueo de eliminación a su cuenta de almacenamiento ayuda a proteger la disponibilidad de sus datos, minimizando el riesgo de interrupciones en sus operaciones comerciales.",
            "guid": "85e2213d-bd7b-4b01-8f7b-95e06e158e3e",
            "link": "https://learn.microsoft.com/azure/storage/common/lock-account-resource",
            "severity": "Bajo",
            "subcategory": "Cuentas de almacenamiento",
            "text": "Aplicar un bloqueo de eliminación para evitar la eliminación accidental o maliciosa de cuentas de almacenamiento",
            "waf": "Fiabilidad"
        },
        {
            "category": "Datos",
            "description": "La eliminación temporal del contenedor protege sus datos de ser eliminados accidentalmente al mantener los datos eliminados en el sistema durante un período de tiempo específico.",
            "guid": "a3992c2d-e6e2-4065-a3a7-6af4a691e893",
            "link": "https://learn.microsoft.com/azure/storage/blobs/soft-delete-container-enable",
            "severity": "Bajo",
            "subcategory": "Cuentas de almacenamiento",
            "text": "Habilitar la eliminación temporal para contenedores de cuentas de almacenamiento",
            "waf": "Fiabilidad"
        },
        {
            "category": "Datos",
            "description": "La eliminación temporal de blobs protege un blob individual y sus versiones, instantáneas y metadatos de eliminaciones o sobrescrituras accidentales al mantener los datos eliminados en el sistema durante un período de tiempo especificado.",
            "guid": "9ada4666-7e13-4c10-96b9-153d89f89dc7",
            "link": "https://learn.microsoft.com/azure/storage/blobs/soft-delete-blob-enable",
            "severity": "Bajo",
            "subcategory": "Cuentas de almacenamiento",
            "text": "Habilitar la eliminación temporal de blobs",
            "waf": "Fiabilidad"
        },
        {
            "category": "General",
            "description": "La eliminación temporal mejorada de Azure Backup proporciona protección crítica contra ataques de ransomware al conservar las copias de seguridad eliminadas, lo que permite la recuperación de un posible cifrado o eliminación de ransomware.",
            "guid": "b44be3b1-a27f-48b9-b91b-e1038df03a82",
            "link": "https://learn.microsoft.com/azure/backup/backup-azure-enhanced-soft-delete-about",
            "severity": "Medio",
            "subcategory": "Copia de seguridad",
            "text": "Habilitar la eliminación de software mejorada de Azure Backup para mejorar la protección y recuperación de datos",
            "waf": "Fiabilidad"
        },
        {
            "category": "General",
            "description": "La autorización multiusuario de Azure Backup permite un control detallado sobre el acceso de los usuarios a los recursos de copia de seguridad, lo que le permite restringir los privilegios y garantizar la autenticación y autorización adecuadas para las operaciones de copia de seguridad.",
            "guid": "2cd463cb-bbc8-4ac2-a9eb-c92a43da1dae",
            "link": "https://learn.microsoft.com/azure/backup/multi-user-authorization-concept",
            "severity": "Bajo",
            "subcategory": "Copia de seguridad",
            "text": "Implementar la autorización multiusuario para Copia de seguridad de Azure para garantizar el acceso seguro y controlado a los recursos de copia de seguridad",
            "waf": "Fiabilidad"
        },
        {
            "category": "General",
            "description": "Azure Immutable Storage proporciona una capa adicional de seguridad al garantizar que los datos de copia de seguridad almacenados en el almacén no se puedan modificar ni eliminar durante un período de retención especificado. Esto ayuda a proteger sus copias de seguridad de ataques de ransomware que pueden intentar comprometer o manipular sus datos de copia de seguridad.",
            "guid": "2cc88147-0607-4c1c-aa0e-614658dd458e",
            "link": "https://learn.microsoft.com/azure/backup/backup-azure-immutable-vault-concept?source=recommendations&tabs=recovery-services-vault",
            "severity": "Bajo",
            "subcategory": "Copia de seguridad",
            "text": "Implemente almacenamiento inmutable para sus bóvedas para protegerse contra ransomware y evitar modificaciones no autorizadas en las copias de seguridad",
            "waf": "Fiabilidad"
        },
        {
            "category": "General",
            "description": "Defina claramente los requisitos de continuidad empresarial y recuperación ante desastres de su organización para su entorno de Azure. Esto incluye identificar las aplicaciones, los datos y los servicios críticos que deben protegerse, así como especificar los objetivos y estrategias de recuperación deseados.",
            "guid": "72e52e36-11dd-458c-9a4b-1521e43a58a9",
            "link": "https://learn.microsoft.com/azure/cloud-adoption-framework/ready/landing-zone/design-area/management-business-continuity-disaster-recovery",
            "severity": "Alto",
            "subcategory": "Diseño",
            "text": "Definir los requisitos de continuidad del negocio y recuperación ante desastres",
            "waf": "Fiabilidad"
        },
        {
            "category": "General",
            "description": "Asegúrese de que las arquitecturas de Azure están diseñadas centrándose en la confiabilidad. Considere la posibilidad de implementar mecanismos tolerantes a errores, redundancia y patrones de resistencia para minimizar el impacto de los errores y maximizar la disponibilidad de sus aplicaciones y servicios.",
            "guid": "c2399c4d-7b67-4d0c-9555-62f2b3e4563a",
            "link": "https://learn.microsoft.com/azure/architecture/reliability/architect",
            "severity": "Alto",
            "subcategory": "Diseño",
            "text": "Implementación de procedimientos recomendados de confiabilidad en arquitecturas de Azure",
            "waf": "Fiabilidad"
        },
        {
            "category": "General",
            "description": "Las configuraciones de IaC pueden desempeñar un papel en su plan de recuperación ante desastres, especialmente en situaciones en las que el tiempo de recuperación no es sensible al tiempo. En el caso de recreación de infraestructura en una segunda región, IaC se puede utilizar para reproducir la infraestructura necesaria.",
            "guid": "fe237de2-43b1-46c3-8d7a-a9b7570449aa",
            "link": "https://learn.microsoft.com/azure/well-architected/devops/automation-infrastructure",
            "severity": "Medio",
            "subcategory": "DevOps",
            "text": "Implementar infraestructura como código (IaC) para una rápida recuperación de la infraestructura",
            "waf": "Fiabilidad"
        },
        {
            "category": "General",
            "description": "Azure ofrece pares de regiones que están separados geográficamente y se pueden usar para la replicación entre regiones y la recuperación ante desastres. Estos pares de regiones proporcionan redundancia y protección contra desastres regionales o a gran escala.",
            "guid": "dcb1f7d5-769a-4e56-aba3-8d4a85e2213d",
            "link": "https://learn.microsoft.com/azure/reliability/cross-region-replication-azure",
            "severity": "Medio",
            "subcategory": "Multirregión",
            "text": "Planificar la recuperación entre regiones aprovechando los pares de regiones",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Al implementar Application Gateway con un número mínimo de instancias de dos, tendrá al menos dos instancias disponibles en circunstancias normales. En el caso de que una de las instancias encuentre un problema, la otra instancia manejará el tráfico mientras se crea una nueva instancia. Este enfoque reduce significativamente el riesgo de interrupción del servicio y garantiza una experiencia perfecta para sus usuarios.",
            "guid": "93c76286-37a5-451c-9b04-e4f1854387e5",
            "link": "https://learn.microsoft.com/azure/application-gateway/application-gateway-autoscaling-zone-redundant#autoscaling-and-high-availability",
            "severity": "Medio",
            "subcategory": "Gateways de aplicaciones",
            "text": "Implemente Application Gateways con un número mínimo de instancias de 2 para evitar el tiempo de inactividad del aprovisionamiento de instancias",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "La SKU v2 ofrece varias ventajas y nuevas características críticas que mejoran la disponibilidad y la resistencia de la infraestructura de aplicaciones. Una característica notable admitida por la SKU v2 es la redundancia de zonas, que permite que una implementación de Application Gateway abarque varias zonas de disponibilidad.",
            "guid": "ced126cd-032a-4f5b-8fc6-998a535e3378",
            "link": "https://learn.microsoft.com/azure/application-gateway/overview-v2",
            "severity": "Alto",
            "subcategory": "Gateways de aplicaciones",
            "text": "Implementación de Azure Application Gateway v2 para la compatibilidad con la redundancia de zona",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Azure Front Door proporciona funcionalidades de conmutación por error automática, lo que garantiza la continuidad en caso de que una región principal deje de estar disponible. Sin embargo, durante el proceso de conmutación por error, puede haber un breve período (normalmente de 20 a 60 segundos) en el que los clientes no pueden llegar a la aplicación. Es esencial revisar el contrato de nivel de servicio (SLA) de Azure Front Door para determinar si confiar únicamente en Front Door cumple los requisitos empresariales de alta disponibilidad. ",
            "guid": "97e31c67-d68c-4f6a-92a1-194956d697dc",
            "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/app-service-web-app/multi-region#azure-front-door",
            "severity": "Bajo",
            "subcategory": "Puerta de entrada de Azure",
            "text": "Considere una solución de administración de tráfico redundante junto con Azure Front Door",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Al implementar el Administrador de tráfico, puede configurarlo para supervisar continuamente el estado de los extremos de la aplicación y redirigir automáticamente el tráfico a un extremo alternativo cuando sea necesario. Esta automatización minimiza el tiempo de inactividad y proporciona una experiencia más fluida para los usuarios durante los escenarios de recuperación ante desastres.",
            "guid": "8df03a82-2cd4-463c-abbc-8ac299ebc92a",
            "link": "https://learn.microsoft.com/azure/networking/disaster-recovery-dns-traffic-manager",
            "severity": "Bajo",
            "subcategory": "DNS",
            "text": "Planeación de la conmutación por error automatizada mediante el Administrador de tráfico para el tráfico DNS",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Para eliminar un único punto de error en los servicios DNS locales y garantizar una resolución DNS confiable durante los escenarios de continuidad empresarial y recuperación ante desastres, se recomienda usar Azure DNS Private Resolvers en varias regiones. Al implementar dos o más solucionadores privados de DNS de Azure en diferentes regiones, puede habilitar la conmutación por error de DNS y lograr resistencia en la infraestructura de DNS.",
            "guid": "43da1dae-2cc8-4814-9060-7c1cca0e6146",
            "link": "https://learn.microsoft.com/azure/dns/tutorial-dns-private-resolver-failover",
            "severity": "Bajo",
            "subcategory": "DNS",
            "text": "Implementación de la conmutación por error de DNS mediante solucionadores privados de DNS de Azure",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Use un clúster de puerta de enlace de datos local para evitar puntos únicos de error y equilibrar la carga del tráfico entre puertas de enlace.",
            "guid": "89f89dc7-b44b-4e3b-8a27-f8b9e91be103",
            "link": "https://learn.microsoft.com/data-integration/gateway/service-gateway-high-availability-clusters",
            "severity": "Medio",
            "subcategory": "Pasarelas de datos",
            "text": "Usar clústeres de puerta de enlace de datos locales para garantizar una alta disponibilidad de los datos críticos para el negocio",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Al usar ExpressRoute, es importante diseñar para una alta disponibilidad mediante la incorporación de redundancia en las redes de socios y clientes. Esto puede incluir varios circuitos ExpressRoute, conexiones redundantes de la red a Microsoft y garantizar que el equipo de red local tenga conexiones redundantes.",
            "guid": "c0e7c28d-c936-4657-802b-ff4564b0d934",
            "link": "https://learn.microsoft.com/azure/expressroute/designing-for-high-availability-with-expressroute",
            "severity": "Medio",
            "subcategory": "ExpressRoute",
            "text": "Garantice la redundancia tanto dentro de la red de socios como de la red de clientes al usar ExpressRoute para alta disponibilidad",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "El circuito primario debe manejar el tráfico regular mientras que el circuito de respaldo permanece listo para hacerse cargo si el circuito primario falla. Utilice atributos BGP para influir en el enrutamiento y designar sus circuitos primarios y de respaldo de manera efectiva.",
            "guid": "a359c373-e7dd-4616-83a3-64a907ebae48",
            "link": "https://learn.microsoft.com/azure/expressroute/designing-for-disaster-recovery-with-expressroute-privatepeering",
            "severity": "Medio",
            "subcategory": "ExpressRoute",
            "text": "Cuando se utilizan varios circuitos ExpressRoute, asegúrese de que el enrutamiento permite un primario y una copia de seguridad",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "La conexión VPN S2S puede proporcionar una solución de copia de seguridad rentable y resistente en caso de que se produzca un error en el circuito ExpressRoute. Al usar S2S VPN como conmutación por error, puede mantener la conectividad con los recursos de Azure sin depender únicamente de ExpressRoute.",
            "guid": "ead53cc7-de2e-48aa-ab35-71549ab9153d",
            "link": "https://learn.microsoft.com/azure/expressroute/use-s2s-vpn-as-backup-for-expressroute-privatepeering",
            "severity": "Bajo",
            "subcategory": "ExpressRoute",
            "text": "Considere la posibilidad de implementar VPN de sitio a sitio como copia de seguridad para el emparejamiento privado de ExpressRoute",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "La SKU del equilibrador de carga estándar ofrece un SLA del 99,99 % y un mayor nivel de disponibilidad del servicio en comparación con la SKU del equilibrador de carga básico.",
            "guid": "778468d5-5a78-45d6-be96-c96ad8844cf3",
            "link": "https://learn.microsoft.com/azure/load-balancer/skus",
            "severity": "Medio",
            "subcategory": "Balanceadores de carga",
            "text": "Aproveche la SKU estándar para equilibradores de carga que gestionan el tráfico a las aplicaciones de producción",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Al configurar el equilibrador de carga con un frontend con redundancia de zona, puede servir recursos zonales en cualquier zona con una sola dirección IP. Mientras al menos una zona permanezca en buen estado dentro de la región, la dirección IP asociada con el frontend puede sobrevivir a uno o más errores de zona. Se recomienda tener varios recursos zonales, como máquinas virtuales de diferentes zonas, en el grupo back-end del equilibrador de carga. ",
            "guid": "b2b38c88-6ba2-4c02-8499-114a5d3ce574",
            "link": "https://learn.microsoft.com/azure/load-balancer/load-balancer-standard-availability-zones",
            "severity": "Bajo",
            "subcategory": "Balanceadores de carga",
            "text": "Para los equilibradores de carga, considere la posibilidad de usar un front-end con redundancia de zona con varios recursos zonales en el back-end",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Al diseñar sondeos de estado para el equilibrador de carga de Azure, es importante seguir los procedimientos recomendados para garantizar una supervisión confiable y precisa de las instancias back-end.",
            "guid": "dccbd979-2a6b-4cca-8b5f-ea1ebf3dd95d",
            "link": "https://learn.microsoft.com/azure/load-balancer/load-balancer-custom-probe-overview#design-guidance",
            "severity": "Bajo",
            "subcategory": "Balanceadores de carga",
            "text": "Seleccione el protocolo correcto, los intervalos y tiempos de espera adecuados, las rutas representativas y las respuestas del sondeo al definir los sondeos de estado del equilibrador de carga",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Al elegir la mejor opción para implementar NVA en Azure, es crucial tener en cuenta las recomendaciones del proveedor y validar que el diseño específico ha sido examinado y validado por el proveedor de NVA. El proveedor también debe proporcionar la configuración de NVA necesaria para una integración perfecta en Azure.",
            "guid": "8b1188b3-c6a4-46ce-a544-451e192d3442",
            "link": "https://learn.microsoft.com/azure/architecture/reference-architectures/dmz/nva-ha",
            "severity": "Alto",
            "subcategory": "NVA",
            "text": "Implementar dispositivos virtuales de red (NVA) en una configuración compatible con el proveedor para alta disponibilidad",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Al implementar puertas de enlace VPN en modo activo-activo, puede distribuir el tráfico VPN entre varias puertas de enlace, mejorando la confiabilidad y asegurando una conectividad continua en caso de fallas o mantenimiento.",
            "guid": "927139b8-2110-42db-b6ea-f11e6f843e53",
            "link": "https://learn.microsoft.com/azure/vpn-gateway/vpn-gateway-highlyavailable",
            "severity": "Medio",
            "subcategory": "Puertas de enlace VPN",
            "text": "Implemente Azure VPN Gateways en un modo activo-activo para garantizar una alta disponibilidad y redundancia para las conexiones VPN.",
            "waf": "Fiabilidad"
        },
        {
            "category": "Red",
            "description": "Las SKU con redundancia de zona garantizan que las puertas de enlace VPN estén separadas física y lógicamente dentro de una región, lo que proporciona resistencia y escalabilidad. Esta configuración de implementación protege la conectividad de red local con Azure de errores de nivel de zona.",
            "guid": "f4722d92-8c1b-41cd-921f-54b29b9de39a",
            "link": "https://learn.microsoft.com/azure/vpn-gateway/about-zone-redundant-vnet-gateways",
            "severity": "Medio",
            "subcategory": "Puertas de enlace VPN",
            "text": "Use SKU con redundancia de zona al implementar puertas de enlace VPN para mejorar la resistencia y protegerse contra errores a nivel de zona",
            "waf": "Fiabilidad"
        }
    ],
    "metadata": {
        "name": "Resiliency Review",
        "state": "Preview",
        "timestamp": "May 12, 2023"
    },
    "severities": [
        {
            "name": "Alto"
        },
        {
            "name": "Medio"
        },
        {
            "name": "Bajo"
        }
    ],
    "status": [
        {
            "description": "Esta comprobación aún no se ha examinado",
            "name": "No verificado"
        },
        {
            "description": "Hay un elemento de acción asociado a esta comprobación",
            "name": "Abrir"
        },
        {
            "description": "Esta comprobación se ha comprobado y no hay más elementos de acción asociados a ella",
            "name": "Cumplido"
        },
        {
            "description": "Recomendación entendida, pero no necesaria por los requisitos actuales",
            "name": "No es necesario"
        },
        {
            "description": "No aplicable para el diseño actual",
            "name": "N/A"
        }
    ],
    "waf": [
        {
            "name": "Fiabilidad"
        },
        {
            "name": "Seguridad"
        },
        {
            "name": "Costar"
        },
        {
            "name": "Operaciones"
        },
        {
            "name": "Rendimiento"
        }
    ]
}