{
    "categories": [
        {
            "name": "SQL Server en máquinas virtuales de Azure"
        },
        {
            "name": "SQL Managed Instance"
        }
    ],
    "items": [
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Al crear una máquina virtual de SQL Server en Azure, considere detenidamente el tipo de carga de trabajo necesaria. Si va a migrar un entorno existente, recopile una línea base de rendimiento para determinar los requisitos de máquina virtual de SQL Server en Azure. Si se trata de una nueva máquina virtual, cree la nueva máquina virtual de SQL Server en función de los requisitos del proveedor.",
            "guid": "1fc3fc14-eea6-4e69-b8d9-a3eec218e687",
            "id": "A01.01",
            "link": "https://learn.microsoft.com/sql/dma/dma-sku-recommend-sql-db?view=sql-server-ver16",
            "severity": "Alto",
            "subcategory": "Tamaño de la máquina virtual",
            "text": "Recopile las características de rendimiento de la carga de trabajo de destino y utilícelas para determinar el tamaño de máquina virtual adecuado para su empresa.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Los tamaños de máquina virtual optimizados para memoria son un destino principal para las máquinas virtuales de SQL Server y la opción recomendada por Microsoft. Las máquinas virtuales optimizadas para memoria ofrecen proporciones de memoria a CPU más sólidas y opciones de caché de mediana a grande. Considere primero la serie Ebdsv5 para la mayoría de las cargas de trabajo de SQL Server.",
            "guid": "e04abe1f-8d39-4fda-9776-8424c116775c",
            "id": "A01.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-vm-size?view=azuresql#memory-optimized",
            "severity": "Medio",
            "subcategory": "Tamaño de la máquina virtual",
            "text": "Use tamaños de máquina virtual optimizados para memoria para obtener el mejor rendimiento de las cargas de trabajo de SQL Server.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Para encontrar la configuración más eficaz para las cargas de trabajo de SQL Server en una máquina virtual de Azure, empiece por medir el rendimiento del almacenamiento de la aplicación empresarial. Una vez conocidos los requisitos de almacenamiento, seleccione una máquina virtual que admita las IOPS y el rendimiento necesarios con la relación de memoria a núcleo virtual adecuada.",
            "guid": "2ea55b56-ad48-4408-be72-734b476ba18f",
            "id": "A02.01",
            "link": "https://learn.microsoft.com/azure/virtual-machines/premium-storage-performance#counters-to-measure-application-performance-requirements",
            "severity": "Medio",
            "subcategory": "Almacenamiento",
            "text": "Determine los requisitos de ancho de banda y latencia de almacenamiento para los archivos de datos, registro y tempdb de SQL Server antes de elegir el tipo de disco.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Esto proporciona más IOPS de disco dedicado y rendimiento en el nivel de disco y también le permite configurar la configuración de almacenamiento en caché del host de disco de Azure para cada disco en la configuración óptima para ese tipo de datos.",
            "guid": "dbf590ce-65de-48e0-9f9c-cbd468266abc",
            "id": "A02.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql#storage",
            "severity": "Alto",
            "subcategory": "Almacenamiento",
            "text": "Coloque los archivos de datos, registro y tempdb en unidades independientes",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Siempre se recomienda un SSD prémium como mínimo para SQL Server con el fin de obtener un mejor rendimiento y una menor latencia. Se recomiendan P30 y P40 porque el almacenamiento en caché de disco no es compatible con discos de 4 TiB y más grandes (P50 y superior) y proporcionan la relación precio-rendimiento óptima",
            "guid": "e6a84de5-df43-4d19-a248-1718d5d1e5f6",
            "id": "A02.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql#storage",
            "severity": "Alto",
            "subcategory": "Almacenamiento",
            "text": "Para la unidad de datos, utilice discos premium P30 y P40 o más pequeños para garantizar la disponibilidad de la compatibilidad con caché",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Los archivos de registro tienen principalmente operaciones de escritura intensiva. Por lo tanto, no se benefician de la caché de solo lectura. Por lo tanto, evalúe su precio, rendimiento y capacidad y elija el disco de almacenamiento adecuado.",
            "guid": "25659d35-58fd-4772-99c9-31112d027fe4",
            "id": "A02.04",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql#storage",
            "severity": "Alto",
            "subcategory": "Almacenamiento",
            "text": "Para el plan de la unidad de registro para la capacidad y el rendimiento de las pruebas frente al costo mientras se evalúan los discos P30 - P80 premium",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Colocar TempDB en la unidad D puede mejorar el rendimiento. Tenga en cuenta el tamaño requerido y pruebe siempre el rendimiento.",
            "guid": "12f70983-f630-4472-8ee6-9d6b5c2622f5",
            "id": "A02.05",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql#storage",
            "severity": "Medio",
            "subcategory": "Almacenamiento",
            "text": "Coloque tempdb en la unidad SSD efímera local (D:\\ predeterminada) para la mayoría de las cargas de trabajo de SQL Server que no forman parte de la instancia de clúster de conmutación por error (FCI) después de elegir el tamaño óptimo de máquina virtual.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "La división de datos y disco de registro puede aumentar el ancho de banda. Asegúrese de que el tamaño de la máquina virtual también coincida con el resultado esperado",
            "guid": "4b69bad3-4aad-45e8-a78e-1d76667313c4",
            "id": "A02.06",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql#storage",
            "severity": "Alto",
            "subcategory": "Almacenamiento",
            "text": "Seccione varios discos de datos de Azure mediante Espacios de almacenamiento para aumentar el ancho de banda de E/S",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "La directiva de almacenamiento en caché varía en función del tipo de archivos de datos de SQL Server que se hospedan en la unidad. Habilite el almacenamiento en caché de solo lectura para los discos que hospedan archivos de datos de SQL Server. Las lecturas de la memoria caché serán más rápidas que las lecturas no almacenadas en caché del disco de datos. Establezca la directiva de almacenamiento en caché en Ninguno para los discos que hospedan el registro de transacciones. No hay ninguna ventaja de rendimiento al habilitar el almacenamiento en caché para el disco de registro de transacciones.",
            "guid": "05674b5e-985b-4859-a773-e7e261623b77",
            "id": "A02.07",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql#storage",
            "severity": "Alto",
            "subcategory": "Almacenamiento",
            "text": "Establezca el almacenamiento en caché del host en solo lectura para los discos de archivos de datos y ninguno para los discos de archivos de registro.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Compruebe que el almacenamiento se encuentra en la misma región que la máquina virtual. Por ejemplo, si la máquina virtual está en el ESTE DE EE. UU. 2, asegúrese de que el almacenamiento esté en el Este de EE. UU. 2.",
            "guid": "5a917e1f-348e-4f35-9c27-d42e8bbac868",
            "id": "A02.08",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql#storage",
            "severity": "Alto",
            "subcategory": "Almacenamiento",
            "text": "Aprovisionamiento de la cuenta de almacenamiento en la misma región que la máquina virtual de SQL Server",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "SQL Server usa extensiones para almacenar datos. Estos tienen un tamaño de 64 KB. Por lo tanto, en un equipo con SQL Server, el tamaño de la unidad de asignación NTFS para hospedar archivos de base de datos SQL debe ser de 64 KB.",
            "guid": "155abb91-63e9-4908-ae28-c84c33b6b780",
            "id": "A02.09",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql#storage",
            "severity": "Alto",
            "subcategory": "Almacenamiento",
            "text": "Formatee el disco de datos para usar un tamaño de bloque de 64 KB (tamaño de unidad de asignación) para todos los archivos de datos colocados en una unidad que no sea la unidad temporal D:\\",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Se recomienda que determine las necesidades y los requisitos de BCDR para asegurarse de que puede cumplir con los SLA del entorno.",
            "guid": "8b9fe5c4-2049-4d41-9a92-3c3474d11028",
            "id": "A03.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/business-continuity-high-availability-disaster-recovery-hadr-overview?view=azuresql#azure-only-disaster-recovery-solutions",
            "severity": "Medio",
            "subcategory": "HADR",
            "text": "Determine los requisitos de alta disponibilidad y recuperación ante desastres para cada máquina virtual que se va a migrar.",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Al desactivar la alta disponibilidad, debe usar conjuntos de disponibilidad o zonas de disponibilidad para evitar interrupciones inesperadas.",
            "guid": "ac6aae01-e6a8-44de-9df4-3d1992481718",
            "id": "A03.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/business-continuity-high-availability-disaster-recovery-hadr-overview?view=azuresql#high-availability-nodes-in-an-availability-set",
            "severity": "Alto",
            "subcategory": "HADR",
            "text": "Coloque las máquinas virtuales en un conjunto de disponibilidad o en diferentes zonas de disponibilidad.",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Opción preferida al implementar un grupo de disponibilidad. La solución recomendada es usar varias subredes al implementar grupos de disponibilidad AlwaysOn.",
            "guid": "d5d1e5f6-2565-49d3-958f-d77249c93111",
            "id": "A03.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/availability-group-azure-portal-configure?view=azuresql&tabs=azure-cli",
            "severity": "Medio",
            "subcategory": "HADR",
            "text": "Implemente las máquinas virtuales de SQL Server en varias subredes siempre que sea posible para evitar la dependencia de Azure Load Balancer o de un nombre de red distribuida (DNN) para enrutar el tráfico a la solución HADR. ( Si se está implementando FCI o AG)",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Las características de alta disponibilidad y recuperación ante desastres (HADR), como el grupo de disponibilidad AlwaysOn y la instancia de clúster de conmutación por error, se basan en la tecnología subyacente de clúster de conmutación por error de Windows Server. Revise las prácticas recomendadas para modificar la configuración de HADR para que sea más compatible con el entorno de nube.",
            "guid": "2d027fe4-12f7-4098-9f63-04722ee69d6b",
            "id": "A03.04",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql-vm#hadr-configuration",
            "severity": "Alto",
            "subcategory": "HADR",
            "text": "Cambie el clúster a parámetros menos agresivos para evitar interrupciones inesperadas debido a errores transitorios de red o mantenimiento de la plataforma Azure. ( Si se está implementando FCI o AG)",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Asegúrese de que el quórum esté establecido correctamente para el número de instancias implementadas.",
            "guid": "5c2622f5-4b69-4bad-94aa-d5e8c78e1d76",
            "id": "A03.05",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/hadr-cluster-best-practices?view=azuresql-vm&tabs=windows2012#quorum-voting",
            "severity": "Alto",
            "subcategory": "HADR",
            "text": "Configure la votación de quórum de clúster para usar 3 o más números impares de votos. No asigne votos a regiones de recuperación ante desastres. ( Si se está implementando FCI o AG)",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "En las máquinas virtuales de Azure, los clústeres usan un equilibrador de carga para contener una dirección IP que debe estar en un nodo de clúster a la vez. En esta solución, el equilibrador de carga contiene la dirección IP del agente de escucha del nombre de red virtual (VNN) para el grupo de disponibilidad AlwaysOn cuando las máquinas virtuales de SQL Server están en una sola subred.",
            "guid": "667313c4-0567-44b5-b985-b859c773e7e2",
            "id": "A03.06",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/availability-group-vnn-azure-load-balancer-configure?view=azuresql-vm&tabs=ilb",
            "severity": "Alto",
            "subcategory": "HADR",
            "text": "Al usar el nombre de red virtual (VNN) y Azure Load Balancer para conectarse a la solución HADR, especifique MultiSubnetFailover = true en la cadena de conexión, incluso si el clúster solo abarca una subred. ( Si se está implementando FCI o AG)",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "SQL Server, Azure SQL Database y Azure SQL Managed Instance admiten la compresión de filas y páginas para tablas e índices de almacén de filas, y admiten la compresión de archivado de almacén de columnas y almacén de columnas para tablas e índices de almacén de columnas.",
            "guid": "61623b77-5a91-47e1-b348-ef354c27d42e",
            "id": "A04.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/data-compression/data-compression?view=sql-server-ver16",
            "severity": "Bajo",
            "subcategory": "Servidor SQL",
            "text": "Habilite la compresión de páginas de la base de datos cuando corresponda.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "De forma predeterminada, los archivos de datos y de registro se inicializan para sobrescribir los datos existentes que quedan en el disco de los archivos eliminados anteriormente. Los archivos de datos y de registro se inicializan primero poniendo a cero los archivos (rellenándolos con ceros). En SQL Server, solo para archivos de datos, la inicialización instantánea de archivos (IFI) permite una ejecución más rápida de las operaciones de archivo mencionadas anteriormente, ya que recupera el espacio en disco usado sin llenar ese espacio con ceros. En su lugar, el contenido del disco se sobrescribe a medida que se escriben nuevos datos en los archivos.",
            "guid": "8bbac868-155a-4bb9-863e-9908ae28c84c",
            "id": "A04.02",
            "link": "https://learn.microsoft.com/sql/relational-databases/databases/database-instant-file-initialization?view=sql-server-ver16",
            "severity": "Alto",
            "subcategory": "Servidor SQL",
            "text": "Habilite la inicialización instantánea de archivos para archivos de datos.",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Recomendado para obtener el mejor rendimiento y disponibilidad: migrar todas las bases de datos a discos de datos y de registro",
            "guid": "33b6b780-8b9f-4e5c-9204-9d413a923c34",
            "id": "A04.03",
            "link": "https://learn.microsoft.com/sql/relational-databases/databases/move-database-files?view=sql-server-ver16",
            "severity": "Medio",
            "subcategory": "Servidor SQL",
            "text": "Mueva todas las bases de datos a discos de datos, incluidas las bases de datos del sistema.",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Parte de la lista de comprobación de características de SQL Server en el vínculo que se recomienda cuando SQL Server Instance está en una máquina virtual de Azure.",
            "guid": "b824546c-e1ae-4e34-93ae-c8239248725d",
            "id": "A04.04",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/performance-guidelines-best-practices-checklist?view=azuresql-vm#sql-server-features",
            "severity": "Bajo",
            "subcategory": "Servidor SQL",
            "text": "Mueva el registro de errores de SQL Server y los directorios de archivos de seguimiento a discos de datos.",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Parte de la lista de comprobación de características de SQL Server en el vínculo que se recomienda cuando SQL Server Instance está en una máquina virtual de Azure.",
            "guid": "d68c5b5c-2925-4394-a69a-9d2799c42bb6",
            "id": "A04.05",
            "link": "https://learn.microsoft.com/sql/database-engine/configure-windows/server-memory-server-configuration-options#use-",
            "severity": "Alto",
            "subcategory": "Servidor SQL",
            "text": "Establezca el límite máximo de memoria de SQL Server para dejar suficiente memoria para el sistema operativo.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Parte de la lista de comprobación de características de SQL Server en el vínculo que se recomienda cuando SQL Server Instance está en una máquina virtual de Azure.",
            "guid": "8d1d7555-6246-4b43-a563-b4dc74a748b6",
            "id": "A04.06",
            "link": "https://learn.microsoft.com/sql/database-engine/configure-windows/enable-the-lock-pages-in-memory-option-windows",
            "severity": "Alto",
            "subcategory": "Servidor SQL",
            "text": "Habilite las páginas de bloqueo en la memoria.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Parte de la lista de comprobación de características de SQL Server en el vínculo que se recomienda cuando SQL Server Instance está en una máquina virtual de Azure.",
            "guid": "633ad2a0-916a-4664-a8fa-d0e278ee293c",
            "id": "A04.07",
            "link": "https://learn.microsoft.com/sql/relational-databases/performance/monitoring-performance-by-using-the-query-store",
            "severity": "Bajo",
            "subcategory": "Servidor SQL",
            "text": "Habilite el Almacén de consultas en todas las bases de datos de SQL Server de producción siguiendo los procedimientos recomendados.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Parte de la lista de comprobación de características de SQL Server en el vínculo que se recomienda cuando SQL Server Instance está en una máquina virtual de Azure.",
            "guid": "1bc352ba-aab7-4571-a49a-b8093dc9ec9d",
            "id": "A04.08",
            "link": "https://learn.microsoft.com/sql/relational-databases/databases/tempdb-database#optimizing-tempdb-performance-in-sql-server",
            "severity": "Alto",
            "subcategory": "Servidor SQL",
            "text": "Asegúrese de que se siguen todas las prácticas recomendadas de tempdb.",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Parte de la lista de comprobación de características de SQL Server en el vínculo que se recomienda cuando SQL Server Instance está en una máquina virtual de Azure.",
            "guid": "1bb73b36-a5a6-47fb-a9ed-5b35478c3479",
            "id": "A04.09",
            "link": "https://docs.microsoft.com/azure/governance/management-groups/how-to/protect-resource-hierarchy#setting---require-authorization",
            "severity": "Alto",
            "subcategory": "Servidor SQL",
            "text": "Programe trabajos del Agente SQL Server para ejecutar trabajos de DBCC CHECKDB, reorganización de índices, regeneración de índices y actualización de estadísticas.",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Parte de la lista de comprobación de características de SQL Server en el vínculo que se recomienda cuando SQL Server Instance está en una máquina virtual de Azure.",
            "guid": "816b2863-cffe-41ca-a599-ef0d5a73dd4c",
            "id": "A04.10",
            "link": "https://docs.microsoft.com/azure/governance/management-groups/how-to/protect-resource-hierarchy#setting---require-authorization",
            "severity": "Medio",
            "subcategory": "Servidor SQL",
            "text": "Limitar el crecimiento automático de la base de datos y deshabilitar la reducción automática",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Las máquinas virtuales (VM) de vCPU restringidas son un tipo de máquina virtual en la que el recuento de vCPU se puede restringir a la mitad o a un cuarto del tamaño original de la máquina virtual. Esto permite a los clientes reducir el costo de las licencias de software mientras mantienen la misma memoria, almacenamiento y ancho de banda de E/S",
            "guid": "e36c1c81-770a-4fbc-9c0d-43918648d285",
            "id": "A05.01",
            "link": "https://learn.microsoft.com/azure/virtual-machines/constrained-vcpu",
            "severity": "Bajo",
            "subcategory": "Optimización de costos",
            "text": "Optimice el costo de la licencia de SQL Server con máquinas virtuales de vCPU restringidas",
            "training": "https://learn.microsoft.com/azure/active-directory/managed-identities-azure-resources/overview",
            "waf": "Costar"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "La Ventaja híbrida de Azure le permite intercambiar las licencias existentes por tarifas con descuento en Azure SQL Database y Azure SQL Managed Instance. Y",
            "guid": "7ed67178-b824-4546-ae1a-ee3453aec823",
            "id": "A05.02",
            "link": "https://azure.microsoft.com/en-ca/pricing/hybrid-benefit/",
            "severity": "Bajo",
            "subcategory": "Optimización de costos",
            "text": "Aproveche la ventaja híbrida de Azure para maximizar el valor de sus licencias locales en la nube",
            "waf": "Costar"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "La extensión del Agente de IaaS de SQL Server (SqlIaasExtension) se ejecuta en SQL Server en máquinas virtuales (VM) Windows de Azure para automatizar las tareas de administración y administración.",
            "guid": "9248725d-d68c-45b5-a292-5394a69a9d27",
            "id": "A06.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/virtual-machines/windows/sql-agent-extension-automatic-registration-all-vms?view=azuresql-vm&tabs=azure-cli",
            "severity": "Medio",
            "subcategory": "Celeste",
            "text": "Regístrese con la extensión del agente de IaaS de SQL para desbloquear una serie de ventajas de características.",
            "training": "https://learn.microsoft.com/learn/modules/azure-ad-privileged-identity-management/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Las redes aceleradas proporcionan una latencia de red ultrabaja constante a través del hardware y las tecnologías programables internos de Azure",
            "guid": "99c42bb6-8d1d-4755-9624-6b438563b4dc",
            "id": "A06.02",
            "link": "https://learn.microsoft.com/azure/virtual-network/accelerated-networking-overview?tabs=redhat",
            "severity": "Alto",
            "subcategory": "Celeste",
            "text": "Asegúrese de que las redes aceleradas estén habilitadas en la máquina virtual.",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Server en máquinas virtuales de Azure",
            "description": "Microsoft Defender detecta actividades anómalas que indican intentos inusuales y potencialmente dañinos de acceder a bases de datos o explotar bases de datos en SQL Server.",
            "guid": "74a748b6-633a-4d2a-8916-a66498fad0e2",
            "id": "A06.03",
            "link": "https://learn.microsoft.com/azure/defender-for-cloud/secure-score-security-controls",
            "severity": "Alto",
            "subcategory": "Celeste",
            "text": "Aproveche Microsoft Defender for Cloud para mejorar la posición de seguridad general de la implementación de máquinas virtuales.",
            "training": "https://learn.microsoft.com/learn/paths/implement-resource-mgmt-security/",
            "waf": "Seguridad"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Hay algunas limitaciones de PaaS que se introducen en SQL Managed Instance y algunos cambios de comportamiento en comparación con SQL Server. Es importante revisar y comprender estas diferencias.",
            "guid": "78ee293c-1bc3-452b-aaab-7571849ab809",
            "id": "B01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/transact-sql-tsql-differences-sql-server?view=azuresql",
            "severity": "Alto",
            "subcategory": "Pre Migración",
            "text": "Revisión de las principales diferencias entre SQL Server e Instancia administrada",
            "training": "https://learn.microsoft.com/learn/modules/plan-implement-administer-conditional-access/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "SQL Managed Instance tiene características y límites de recursos que dependen de la infraestructura y la arquitectura subyacentes. Es importante revisar estos límites.",
            "guid": "3dc9ec9d-1bb7-43b3-9a5a-67fba9ed5b35",
            "id": "B01.02",
            "link": "https://docs.microsoft.com/azure/azure-sql/managed-instance/resource-limits",
            "severity": "Alto",
            "subcategory": "Pre Migración",
            "text": "Revisión de los límites de capacidad de SQL MI",
            "training": "https://learn.microsoft.com/learn/modules/secure-aad-users-with-mfa/",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Managed Instance",
            "description": "La configuración de instancia entre la instancia administrada y el SQL Server de origen puede ser diferente. Es importante revisar las diferencias que pueden afectar al rendimiento.",
            "guid": "8bc178bd-c5a0-46ca-9144-351e19dd3442",
            "id": "B01.03",
            "link": "https://medium.com/azure-sqldb-managed-instance/compare-environment-settings-on-sql-server-and-azure-sql-that-may-impact-performance-e90c21fa9b08",
            "severity": "Alto",
            "subcategory": "Pre Migración",
            "text": "Compare la configuración de instancia en SQL Server y Azure SQL MI que puede afectar al rendimiento",
            "training": "https://learn.microsoft.com/learn/paths/azure-administrator-manage-identities-governance/",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Evalúe las instancias de SQL Server locales que migran a Azure SQL Managed Instance. El flujo de trabajo de evaluación le ayuda a detectar problemas que bloquean la migración en sí y también características parcialmente admitidas y no admitidas",
            "guid": "9eb72281-37a1-451c-9bb4-e4f1814287d5",
            "id": "B01.04",
            "link": "https://docs.microsoft.com/azure/dms/ads-sku-recommend",
            "severity": "Alto",
            "subcategory": "Pre Migración",
            "text": "Ejecute el Asistente para migración de datos o la extensión de migración de Azure Data Studio para detectar problemas de compatibilidad que pueden afectar a la funcionalidad de la base de datos en Instancia administrada",
            "training": "https://learn.microsoft.com/learn/modules/azure-ad-privileged-identity-management/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "La característica de recomendación de SKU puede evaluar el rendimiento y las características de uso de SQL Server de origen para recomendar una instancia de Azure SQL Managed Instance del tamaño adecuado para ayudar con el recorrido de migración.",
            "guid": "ca8c26c9-b32a-4b5b-afc6-898a135e3378",
            "id": "B01.05",
            "link": "https://learn.microsoft.com/azure/dms/ads-sku-recommend",
            "severity": "Alto",
            "subcategory": "Pre Migración",
            "text": "Seleccione los recursos informáticos adecuados para su carga de trabajo aprovechando las herramientas de recomendación de SKU.",
            "training": "https://learn.microsoft.com/learn/modules/explore-basic-services-identity-types/",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Revise las características no admitidas, los bloqueadores de migración y los cambios importantes para cada base de datos de la evaluación",
            "guid": "97e31c67-d68c-4b69-82ac-19f906d697c8",
            "id": "B01.06",
            "link": "https://learn.microsoft.com/azure/dms/ads-sku-recommend",
            "severity": "Alto",
            "subcategory": "Pre Migración",
            "text": "Revisión y solución de los problemas resaltados en DMA/Azure Data Studio",
            "training": "https://learn.microsoft.com/learn/paths/manage-identity-and-access/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "La zona DNS predeterminada de SQL Managed Instance .database.windows.net se puede cambiar por la suya propia. Sin embargo, la parte del nombre de host de la instancia administrada de su FQDN debe seguir siendo la misma.",
            "guid": "eaded26b-dd18-46f0-ac25-1b999a68af87",
            "id": "B01.07",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/frequently-asked-questions-faq?view=azuresql-mi#can-a-managed-instance-have-the-same-name-as-a-sql-server-on-premises-instance",
            "severity": "Alto",
            "subcategory": "Pre Migración",
            "text": "Planear los cambios en la cadena de conexión, ya que no se admite el cambio de un nombre de instancia administrada",
            "training": "https://learn.microsoft.com/learn/modules/create-custom-azure-roles-with-rbac/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Existen requisitos adicionales en la configuración de una red virtual y una subred que hospeda la instancia administrada.",
            "guid": "c9a7f821-b8eb-48c0-aa77-e25e4d5aeaa8",
            "id": "B01.08",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/vnet-existing-add-subnet?view=azuresql-mi",
            "severity": "Medio",
            "subcategory": "Pre Migración",
            "text": "Revisión de los requisitos de red virtual de la instancia administrada",
            "training": "https://learn.microsoft.com/learn/paths/secure-your-cloud-data/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Aunque es posible implementar instancias administradas en una subred con un número de direcciones IP menor que el resultado de la fórmula de subred, considere siempre la posibilidad de usar subredes más grandes en su lugar. El uso de una subred más grande puede ayudar a evitar problemas futuros derivados de la falta de direcciones IP, como la imposibilidad de crear instancias adicionales dentro de la subred o escalar las instancias existentes.",
            "guid": "dc4e2436-bb33-46d7-85f1-7960eee0b9b5",
            "id": "B02.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/vnet-subnet-determine-size?view=azuresql-mi",
            "severity": "Alto",
            "subcategory": "Despliegue",
            "text": "Asegúrese de que la subred de la instancia administrada tenga suficientes direcciones IP disponibles",
            "training": "https://learn.microsoft.com/learn/modules/azure-active-directory/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "SQL Managed Instance tiene características y límites de recursos que dependen de la infraestructura y la arquitectura subyacentes. SQL Managed Instance se puede implementar en varias configuraciones de hardware.",
            "guid": "c8defc4d-721d-431d-850f-b707ae9eab40",
            "id": "B03.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/resource-limits?view=azuresql-mi#service-tier-characteristics",
            "severity": "Alto",
            "subcategory": "Pre Migración",
            "text": "Planifique entre los niveles de MI de uso general y crítico para el negocio",
            "training": "https://learn.microsoft.com/learn/modules/implement-hybrid-identity-windows-server/",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Managed Instance",
            "description": "La característica de grupos de conmutación por error automática permite administrar la replicación y la conmutación por error de las bases de datos de usuario de una instancia administrada a una instancia administrada de otra región de Azure. Los grupos de conmutación por error automática están diseñados para simplificar la implementación y la administración de bases de datos con replicación geográfica a escala.",
            "guid": "ed329079-8bc1-478b-bc5a-06ca7144351e",
            "id": "B03.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/auto-failover-group-sql-mi?view=azuresql-mi&tabs=azure-powershell",
            "severity": "Alto",
            "subcategory": "Pre Migración",
            "text": "En función de su RPO/RTO, determine si es necesario implementar el grupo de conmutación por error automática. Si es así, planifique los atributos de implementación de la segunda instancia.",
            "training": "https://learn.microsoft.com/learn/paths/implement-windows-server-iaas-virtual-machine-identity/",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Hay varias formas de conectar la aplicación a la instancia administrada. Revise y comprenda los pros y los contras y decida cuál es el mejor enfoque para su aplicación.",
            "guid": "5d226886-d30b-466c-97be-595190f83845",
            "id": "B03.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/connect-application-instance?view=azuresql-mi",
            "severity": "Bajo",
            "subcategory": "Pre Migración",
            "text": "Revise el diseño de conectividad entre la base de datos y la aplicación, pruébelo y valídelo",
            "training": "https://learn.microsoft.com/learn/paths/implement-applications-external-access-azure-ad/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Compare las opciones de migración para elegir la ruta que mejor se adapte a las necesidades de su empresa.",
            "guid": "c586cb29-1ec1-46a1-b076-ef9f141acdce",
            "id": "B03.04",
            "link": "https://learn.microsoft.com/azure/azure-sql/migration-guides/managed-instance/sql-server-to-managed-instance-overview?view=azuresql-mi#migration-tools",
            "severity": "Medio",
            "subcategory": "Pre Migración",
            "text": "Planear el método de migración. En función del tamaño de la base de datos y de la ventana de tiempo de inactividad de la aplicación, seleccione el método de migración preferido.",
            "training": "https://learn.microsoft.com/learn/modules/design-identity-security-strategy/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Después de comprobar que los datos son los mismos tanto en el origen como en el destino, puede pasar del entorno de origen al de destino. Es importante planificar el proceso de transición con los equipos de negocios/aplicaciones para garantizar que la interrupción mínima durante la transición no afecte la continuidad del negocio.",
            "guid": "579377bc-db37-451a-a2ac-1fad66e15d4d",
            "id": "B03.05",
            "link": "https://learn.microsoft.com/azure/dms/tutorial-sql-server-managed-instance-online#performing-migration-cutover",
            "severity": "Medio",
            "subcategory": "Pre Migración",
            "text": "Planifique el proceso de transición con los equipos de negocios/aplicaciones para garantizar una interrupción mínima durante la transición y que no afecte la continuidad del negocio.",
            "training": "https://learn.microsoft.com/azure/architecture/example-scenario/identity/adds-extend-domain",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Managed Instance",
            "description": "La zona horaria de una instancia administrada solo se puede establecer durante la creación de la instancia. La zona horaria predeterminada es UTC",
            "guid": "4a2adb1c-3d23-426a-b225-ca44e1695fdd",
            "id": "B04.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/timezones-overview?view=azuresql#set-a-time-zone",
            "severity": "Alto",
            "subcategory": "Despliegue",
            "text": "Asegúrese de personalizar la configuración de la zona horaria en el momento de la creación de la instancia. No se puede cambiar después.",
            "training": "https://learn.microsoft.com/azure/role-based-access-control/overview",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "La intercalación de nivel de servidor en Azure SQL Managed Instance se puede especificar cuando se crea la instancia y no se puede cambiar más adelante. La intercalación predeterminada de nivel de servidor es SQL_Latin1_General_CP1_CI_AS.",
            "guid": "deace4cb-1deb-44c6-90c3-fc14eebb3693",
            "id": "B04.02",
            "link": "https://learn.microsoft.com/sql/relational-databases/collations/set-or-change-the-server-collation?view=sql-server-ver16",
            "severity": "Alto",
            "subcategory": "Despliegue",
            "text": "Asegúrese de seleccionar la configuración de intercalación correcta en el momento de la creación de la instancia. No se puede cambiar más tarde",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Al migrar una base de datos protegida por el cifrado de datos transparente (TDE) a Azure SQL Managed Instance mediante la opción de restauración nativa, es necesario migrar el certificado correspondiente de la instancia de SQL Server antes de la restauración de la base de datos.",
            "guid": "829e3eec-2183-4687-a007-7a2b5945bda4",
            "id": "B04.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/tde-certificate-migrate?view=azuresql-mi&tabs=azure-powershell",
            "severity": "Medio",
            "subcategory": "Despliegue",
            "text": "En el caso de la base de datos habilitada para TDE, es necesario migrar el certificado correspondiente de la máquina virtual local o de Azure SQL Server antes de la restauración de la base de datos",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Las bases de datos del sistema solo se pueden restaurar a partir de copias de seguridad creadas en la versión de SQL Server que la instancia de servidor está ejecutando actualmente. Este no es el caso cuando se migra a SQL Managed Instance.Las bibliotecas de PowerShell y PowerShell de Azure PowerShell y DBATools permiten crear scripts, automatizar y personalizar fácilmente todas las partes del proceso de migración.",
            "guid": "3334fdf9-1c23-4418-8b65-275269440b4b",
            "id": "B05.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/migration-guides/managed-instance/sql-server-to-managed-instance-guide?view=azuresql-mi#backup-and-restore",
            "severity": "Bajo",
            "subcategory": "Migración",
            "text": "No se admite la restauración de bases de datos del sistema. Para migrar objetos de nivel de instancia (almacenados en bases de datos master o msdb), se recomienda crear scripts de ellos y ejecutar scripts de T-SQL en la instancia de destino.",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Cuando se utilizan opciones de migración que replican o sincronizan continuamente los cambios de datos del origen al destino, los datos de origen y el esquema pueden cambiar y desviarse del destino. Durante la sincronización de datos, asegúrese de que todos los cambios en el origen se capturan y aplican al destino durante el proceso de migración.",
            "guid": "e3d3e084-3276-4d4b-bc01-5bcf219e4a1e",
            "id": "B05.02",
            "severity": "Alto",
            "subcategory": "Migración",
            "text": "Asegúrese de que todos los cambios en el origen se capturan y aplican al destino durante el proceso de migración.",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Asegúrese de que la aplicación pueda conectarse correctamente a la instancia administrada después de la migración de las bases de datos.",
            "guid": "b5887952-5d22-4688-9d30-b66c57be5951",
            "id": "B05.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/connect-application-instance?view=azuresql-mi",
            "severity": "Medio",
            "subcategory": "Migración",
            "text": "Probar la conectividad de la aplicación con MI y bases de datos",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "La alta disponibilidad es una parte fundamental de la plataforma de SQL Managed Instance que funciona de forma transparente para las aplicaciones de base de datos. Las conmutaciones por error de los nodos principales a los secundarios en caso de degradación de nodos o detección de errores, o durante las actualizaciones de software mensuales periódicas son una ocurrencia esperada para todas las aplicaciones que usan SQL Managed Instance en Azure.",
            "guid": "90f83845-c586-4cb2-a1ec-16a1d076ef9f",
            "id": "B06.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/user-initiated-failover?view=azuresql",
            "severity": "Alto",
            "subcategory": "Después de la migración",
            "text": "Considere la posibilidad de ejecutar una conmutación por error manual en SQL Managed Instance para probar la resistencia a errores y conmutación por error.",
            "training": "https://learn.microsoft.com/azure/azure-monitor/logs/design-logs-deployment",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Asegurarse de que las aplicaciones sean resistentes a la conmutación por error antes de implementarlas en producción ayudará a mitigar el riesgo de errores de las aplicaciones en producción y contribuirá a la disponibilidad de las aplicaciones para los clientes.",
            "guid": "141acdce-5793-477b-adb3-751ab2ac1fad",
            "id": "B06.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/auto-failover-group-configure-sql-mi?view=azuresql&tabs=azure-portal#test-failover",
            "severity": "Alto",
            "subcategory": "Después de la migración",
            "text": "Si se han implementado grupos de conmutación por error, pruebe la conmutación por error manual y la conmutación por recuperación y pruebe el comportamiento de conectividad de la aplicación durante la conmutación por error o la conmutación por recuperación",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Esto proporciona más IOPS de disco dedicado y rendimiento",
            "guid": "aa359272-8e6e-4205-8726-76ae46691e88",
            "id": "B06.03",
            "link": "https://techcommunity.microsoft.com/t5/azure-sql-blog/storage-performance-best-practices-and-considerations-for-azure/ba-p/305525",
            "severity": "Alto",
            "subcategory": "Después de la migración",
            "text": "Optimización del rendimiento del almacenamiento para instancias administradas de uso general",
            "training": "https://learn.microsoft.com/learn/paths/architect-infrastructure-operations/",
            "waf": "Rendimiento"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Muchas organizaciones tienen directivas que requieren que los certificados o las claves de cifrado se creen y administren internamente. Si su organización tiene una directiva similar, es posible que esta arquitectura se aplique a usted. Si sus clientes requieren la administración interna de estos elementos, es posible que la arquitectura también se aplique a usted.",
            "guid": "35ad9422-23e1-4381-8523-081a94174158",
            "id": "B06.04",
            "link": "https://learn.microsoft.com/azure/architecture/example-scenario/data/sql-managed-instance-cmk",
            "severity": "Bajo",
            "subcategory": "Después de la migración",
            "text": "Habilitación del TDE administrado por el cliente para realizar copias de seguridad completas solo de su propia copia",
            "training": "https://learn.microsoft.com/learn/paths/architect-infrastructure-operations/",
            "waf": "Seguridad"
        },
        {
            "category": "SQL Managed Instance",
            "description": "La característica de ventana de mantenimiento proporciona la capacidad de incorporar recursos de Azure SQL a bloques de tiempo programados previamente fuera del horario comercial.",
            "guid": "33ef7ad7-c6d3-4733-865c-7acbe44bbe60",
            "id": "B06.05",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/planned-maintenance?view=azuresql",
            "severity": "Medio",
            "subcategory": "Después de la migración",
            "text": "Planeación de eventos de mantenimiento de Azure",
            "training": "https://learn.microsoft.com/learn/paths/implement-resource-mgmt-security/",
            "waf": "Operaciones"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Mediante el uso de la característica de retención a largo plazo (LTR), puede almacenar copias de seguridad completas de SQL Database y SQL Managed Instance especificadas en Azure Blob Storage con redundancia configurada durante un máximo de 10 años.",
            "guid": "9d89f2e8-7778-4424-b516-785c6fa96b96",
            "id": "B06.06",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/long-term-retention-overview?view=azuresql-mi",
            "severity": "Bajo",
            "subcategory": "Después de la migración",
            "text": "Configure la retención de copias de seguridad a largo plazo, vea las copias de seguridad y restaure a partir de copias de seguridad",
            "training": "https://learn.microsoft.com/learn/paths/azure-administrator-manage-compute-resources/",
            "waf": "Fiabilidad"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Con la Ventaja híbrida de Azure, puede ahorrar costos, modernizar y mantener un entorno híbrido flexible a la vez que optimiza las aplicaciones empresariales.",
            "guid": "ad88408f-3727-434c-a76b-a28021459014",
            "id": "B06.07",
            "link": "https://azure.microsoft.com/en-gb/pricing/hybrid-benefit/#overview",
            "severity": "Bajo",
            "subcategory": "Después de la migración",
            "text": "Aproveche la Ventaja híbrida de Azure y las reservas de Azure cuando corresponda.",
            "training": "https://learn.microsoft.com/learn/modules/configure-network-watcher/",
            "waf": "Costar"
        },
        {
            "category": "SQL Managed Instance",
            "description": "Si no tiene protección contra amenazas, Advanced Threat Protection forma parte de la oferta de Microsoft Defender para SQL, que es un paquete unificado para funcionalidades avanzadas de seguridad de SQL.",
            "guid": "65d38e53-f9cc-4bd8-9926-6acca274faa1",
            "id": "B06.08",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/threat-detection-overview?view=azuresql",
            "severity": "Medio",
            "subcategory": "Después de la migración",
            "text": "Aproveche Microsoft Defender for Cloud para mejorar la posición de seguridad general",
            "training": "https://learn.microsoft.com/learn/paths/implement-resource-mgmt-security/",
            "waf": "Seguridad"
        }
    ],
    "metadata": {
        "name": "SQL Migration Review",
        "state": "Preview",
        "timestamp": "December 13, 2023"
    },
    "severities": [
        {
            "name": "Alto"
        },
        {
            "name": "Medio"
        },
        {
            "name": "Bajo"
        }
    ],
    "status": [
        {
            "description": "Esta comprobación aún no se ha examinado",
            "name": "No verificado"
        },
        {
            "description": "Hay un elemento de acción asociado a esta comprobación",
            "name": "Abrir"
        },
        {
            "description": "Esta comprobación se ha verificado y no hay más elementos de acción asociados a ella",
            "name": "Cumplido"
        },
        {
            "description": "Recomendación entendida, pero no necesaria por los requisitos actuales",
            "name": "No es necesario"
        },
        {
            "description": "No aplicable para el diseño actual",
            "name": "N/A"
        }
    ],
    "waf": [
        {
            "name": "Fiabilidad"
        },
        {
            "name": "Seguridad"
        },
        {
            "name": "Costar"
        },
        {
            "name": "Operaciones"
        },
        {
            "name": "Rendimiento"
        }
    ],
    "yesno": [
        {
            "name": "Sí"
        },
        {
            "name": "No"
        }
    ]
}