{
    "categories": [
        {
            "name": "BCDR"
        },
        {
            "name": "Defensor"
        },
        {
            "name": "Encriptação"
        },
        {
            "name": "Identidade"
        },
        {
            "name": "Acesso privilegiado"
        },
        {
            "name": "Livro-razão"
        },
        {
            "name": "Log"
        },
        {
            "name": "Rede"
        },
        {
            "name": "Descoberta e classificação de dados"
        },
        {
            "name": "Mascaramento de dados"
        },
        {
            "name": "Código"
        }
    ],
    "items": [
        {
            "category": "BCDR",
            "description": "Certifique-se de que seus backups estejam protegidos contra ataques. Isso deve incluir a criptografia dos backups para proteger contra a perda de confidencialidade. Para backup de serviço regular do Azure, os dados de backup são criptografados automaticamente usando chaves gerenciadas pela plataforma do Azure. Você também pode optar por criptografar o backup usando uma chave gerenciada pelo cliente. Nesse caso, verifique se essa chave gerenciada pelo cliente no cofre de chaves também está no escopo de backup.",
            "guid": "676f6951-0368-49e9-808d-c33a692c9a64",
            "id": "A01.01",
            "link": "https://learn.microsoft.com/security/benchmark/azure/baselines/sql-database-security-baseline#br-2-encrypt-backup-data",
            "severity": "Média",
            "subcategory": "Azure Key Vault",
            "text": "Proteja seus dados de backup com criptografia e armazene chaves com segurança no Azure Key Vault",
            "waf": "Segurança"
        },
        {
            "category": "BCDR",
            "description": "O Banco de Dados SQL do Azure usa a tecnologia SQL Server para criar backups completos todas as semanas, backup diferencial a cada 12 a 24 horas e backup de log de transações a cada 5 a 10 minutos. Por padrão, o Banco de Dados SQL armazena dados em blobs de armazenamento com redundância geográfica que são replicados para uma região emparelhada.",
            "guid": "e2518261-b3bc-4bd1-b331-637fb2df833f",
            "id": "A02.01",
            "link": "https://learn.microsoft.com/security/benchmark/azure/baselines/sql-database-security-baseline#br-1-ensure-regular-automated-backups",
            "severity": "Média",
            "subcategory": "Backup",
            "text": "Configurar backups automatizados do Banco de Dados SQL do Azure",
            "waf": "Segurança"
        },
        {
            "category": "BCDR",
            "description": "Por padrão, o Banco de Dados SQL armazena dados em blobs de armazenamento com redundância geográfica que são replicados para uma região emparelhada. Para o Banco de Dados SQL, a redundância de armazenamento de backup pode ser configurada no momento da criação do banco de dados ou pode ser atualizada para um banco de dados existente; As alterações feitas em um banco de dados existente se aplicam apenas a backups futuros.",
            "guid": "f8c7cda2-3ed7-43fb-a100-85dcd12a0ee4",
            "id": "A02.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/automated-backups-overview?tabs=single-database&view=azuresql#backup-storage-redundancy",
            "severity": "Baixo",
            "subcategory": "Backup",
            "text": "Habilite o armazenamento de backup com redundância geográfica para proteger contra falhas de região única e perda de dados",
            "waf": "Segurança"
        },
        {
            "category": "Código",
            "description": "O código mal-intencionado pode contornar os controles de segurança. Antes de implantar o código personalizado na produção, é essencial examinar o que está sendo implantado. Use uma ferramenta de banco de dados como o Azure Data Studio que dá suporte ao controle do código-fonte. Implemente ferramentas e lógica para análise de código, vulnerabilidade e verificação de credenciais.",
            "guid": "7ca9f006-d2a9-4652-951c-de8e4ac5e76e",
            "id": "B01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/transparent-data-encryption-byok-create-server",
            "severity": "Média",
            "subcategory": "Controle de código-fonte e revisão de código",
            "text": "Usar sistemas de controle do código-fonte para armazenar, manter e examinar o código do aplicativo implantado no banco de dados SQL do Azure",
            "waf": "Segurança"
        },
        {
            "category": "Descoberta e classificação de dados",
            "description": "No caso de requisitos de classificação, o Purview é a opção preferencial. Use a Descoberta e Classificação de Dados SQL somente caso o Purview não seja uma opção. Descubra colunas que potencialmente contêm dados confidenciais. O que é considerado dado sensível depende muito do cliente, da regulamentação de conformidade, etc., e precisa ser avaliado pelos usuários responsáveis por esses dados. Classifique as colunas para usar cenários avançados de auditoria e proteção baseados em confidencialidade. Revise os resultados da descoberta automatizada e finalize a classificação, se necessário.",
            "guid": "d401509b-2629-4484-9a7f-af0d29a7778f",
            "id": "C01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/data-discovery-and-classification-overview?view=azuresql#faq---advanced-classification-capabilities",
            "severity": "Baixo",
            "subcategory": "Descoberta e classificação de dados",
            "text": "Planejar e configurar a descoberta e classificação de dados para proteger os dados confidenciais",
            "waf": "Segurança"
        },
        {
            "category": "Mascaramento de dados",
            "description": "O uso desse recurso é recomendado somente se a criptografia de coluna não for uma opção e houver um requisito específico para preservar tipos e formatos de dados. O mascaramento de dados dinâmicos limita a exposição de dados confidenciais, mascarando-os para usuários sem privilégios. O mascaramento dinâmico de dados ajuda a impedir o acesso não autorizado a dados confidenciais, permitindo que os clientes designem a quantidade de dados confidenciais a serem revelados com impacto mínimo na camada de aplicativo.",
            "guid": "9391fd50-135e-453e-90a7-c1a23f88cc13",
            "id": "D01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/dynamic-data-masking-overview",
            "severity": "Baixo",
            "subcategory": "Mascaramento de dados",
            "text": "Use o Mascaramento de Dados para impedir o acesso a dados de usuários não administradores não autorizados se nenhuma criptografia for possível",
            "waf": "Segurança"
        },
        {
            "category": "Defensor",
            "description": "A ATP (Detecção Avançada de Ameaças) do SQL fornece uma camada de segurança que detecta possíveis vulnerabilidades e atividades anômalas em bancos de dados, como ataques de injeção de SQL e padrões de comportamento incomuns. Quando uma ameaça potencial é detectada, a Detecção de Ameaças envia um alerta acionável em tempo real por email e no Microsoft Defender para Nuvem, que inclui etapas claras de investigação e correção para a ameaça específica.",
            "guid": "4e52d73f-5d37-428f-b3a2-e6997e835979",
            "id": "E01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/threat-detection-configure",
            "severity": "Alto",
            "subcategory": "Proteção avançada contra ameaças",
            "text": "Revise e conclua a configuração da Proteção Avançada contra Ameaças (ATP)",
            "waf": "Segurança"
        },
        {
            "category": "Defensor",
            "description": "Habilite o Microsoft Defender para SQL do Azure no nível da assinatura para integrar e proteger automaticamente todos os servidores e bancos de dados existentes e futuros. Quando você habilita no nível da assinatura, todos os bancos de dados no Banco de Dados SQL do Azure e na Instância Gerenciada de SQL do Azure são protegidos. Você pode desativá-los individualmente, se desejar. Se você quiser gerenciar manualmente quais bancos de dados estão protegidos, desabilite no nível da assinatura e habilite cada banco de dados que você deseja proteger.",
            "guid": "dff87489-9edb-4cef-bdda-86e8212b2aa1",
            "id": "E02.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/azure-defender-for-sql?view=azuresql#enable-microsoft-defender-for-sql ",
            "severity": "Alto",
            "subcategory": "Defender para SQL do Azure",
            "text": "Habilitar o Microsoft Defender para SQL do Azure",
            "waf": "Segurança"
        },
        {
            "category": "Defensor",
            "description": "O Microsoft Defender para Azure SQL ATP detecta atividades anômalas que indicam tentativas incomuns e potencialmente prejudiciais de acessar ou explorar bancos de dados. Os alertas podem ser configurados e gerados e serão relatados no Defender para console.",
            "guid": "ca342fdf-d25a-4427-b105-fcd50ff8a0ea",
            "id": "E02.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/threat-detection-configure",
            "severity": "Alto",
            "subcategory": "Defender para SQL do Azure",
            "text": "Preparar um plano de resposta de segurança para reagir prontamente aos alertas de SQL do Microsoft Defender para Azure",
            "waf": "Segurança"
        },
        {
            "category": "Defensor",
            "description": "A avaliação de vulnerabilidade do SQL do Azure é um serviço que fornece visibilidade do seu estado de segurança. A avaliação de vulnerabilidades inclui etapas acionáveis para resolver problemas de segurança e aprimorar a segurança do banco de dados. Ele pode ajudá-lo a monitorar um ambiente de banco de dados dinâmico em que as alterações são difíceis de rastrear e melhorar sua postura de segurança SQL.",
            "guid": "a6101ae7-534c-45ab-86fd-b34c55ea21ca",
            "id": "E03.01",
            "link": "https://learn.microsoft.com/azure/defender-for-cloud/sql-azure-vulnerability-assessment-overview",
            "severity": "Alto",
            "subcategory": "Avaliação de vulnerabilidade",
            "text": "Configurar as descobertas da Avaliação de Vulnerabilidade (VA) e as recomendações de revisão",
            "waf": "Segurança"
        },
        {
            "category": "Defensor",
            "description": "O Microsoft Defender para Nuvem fornece avaliação de vulnerabilidade para seus Bancos de Dados SQL do Azure. A avaliação de vulnerabilidades verifica seus bancos de dados em busca de vulnerabilidades de software e fornece uma lista de descobertas. Você pode usar as descobertas para corrigir vulnerabilidades de software e desabilitar descobertas.",
            "guid": "c8c5f112-1e50-4f77-9264-8195b4cd61ac",
            "id": "E03.02",
            "link": "https://learn.microsoft.com/azure/defender-for-cloud/sql-azure-vulnerability-assessment-find?view=azuresql",
            "severity": "Alto",
            "subcategory": "Avaliação de vulnerabilidade",
            "text": "Revisar regularmente as descobertas e recomendações da Avaliação de Vulnerabilidade (VA) e preparar um plano para corrigir",
            "waf": "Segurança"
        },
        {
            "category": "Encriptação",
            "description": "O Always Encrypted com Secure Enclaves expande os recursos de computação confidencial do Always Encrypted, permitindo a criptografia in-loco e consultas confidenciais mais avançadas. O Always Encrypted with Secure Enclaves aborda essas limitações, permitindo alguns cálculos em dados de texto não criptografado dentro de um enclave seguro no lado do servidor. O uso desse recurso é recomendado para os casos em que você precisa limitar o acesso do administrador e precisa que suas consultas ofereçam suporte a mais do que a correspondência de igualdade de colunas criptografadas.",
            "guid": "65d7e54a-10a6-4094-b673-9ff3809c9277",
            "id": "F01.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/encryption/always-encrypted-enclaves",
            "severity": "Média",
            "subcategory": "Sempre criptografado",
            "text": "Se a proteção de dados confidenciais de PII de usuários administradores for um requisito importante, mas as limitações de criptografia de coluna não puderem ser toleradas, considere a adoção do Always Encrypted com Secure Enclaves",
            "waf": "Segurança"
        },
        {
            "category": "Encriptação",
            "description": "Com o Banco de Dados SQL do Azure, você pode aplicar criptografia simétrica a uma coluna de dados usando o Transact-SQL. Essa abordagem é chamada de criptografia de coluna, porque você pode usá-la para criptografar colunas específicas com chaves de criptografia diferentes. Isso oferece uma capacidade de criptografia mais granular do que a TDE, que criptografa dados em páginas. Usando o Always Encrypted para garantir que dados confidenciais não sejam expostos em texto não criptografado no Banco de Dados SQL do Azure ou na Instância Gerenciada de SQL, mesmo na memória/em uso. O Always Encrypted protege os dados de administradores de banco de dados (DBAs) e administradores de nuvem (ou agentes mal-intencionados que podem representar usuários altamente privilegiados, mas não autorizados) e oferece mais controle sobre quem pode acessar seus dados.",
            "guid": "c03ce136-e3d5-4e17-bf25-ed955ee480d3",
            "id": "F02.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/security-best-practice?view=azuresql#control-access-of-application-users-to-sensitive-data-through-encryption",
            "severity": "Baixo",
            "subcategory": "Criptografia de coluna",
            "text": "Para proteger dados confidenciais de PII de usuários não administradores em colunas de tabela específicas, considere usar a criptografia de coluna",
            "waf": "Segurança"
        },
        {
            "category": "Encriptação",
            "description": "Habilitada por padrão, a TDE (Transparent Data Encryption) ajuda a proteger os arquivos de banco de dados contra a divulgação de informações, executando criptografia e descriptografia em tempo real do banco de dados, backups associados e arquivos de log de transações 'em repouso', sem exigir alterações no aplicativo.",
            "guid": "c614ac47-bebf-4061-b0a1-43e0c6b5e00d",
            "id": "F03.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/transparent-data-encryption-byok-create-server",
            "severity": "Alto",
            "subcategory": "Criptografia de dados transparente",
            "text": "Certifique-se de que a TDE (Transparent Data Encryption) seja mantida ativada",
            "waf": "Segurança"
        },
        {
            "category": "Encriptação",
            "description": "Se a separação de tarefas no gerenciamento de chaves e dados dentro da organização for necessária, aproveite as CMKs (Chaves Gerenciadas pelo Cliente) para TDE (Transparent Data Encryption) para seu SQL do Azure Aproveite esse recurso quando você tiver requisitos de segurança rígidos que não podem ser atendidos pelas chaves de serviço gerenciadas.",
            "guid": "2edb4165-4f54-47cc-a891-5c82c2f21e25",
            "id": "F03.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/transparent-data-encryption-byok-overview",
            "severity": "Média",
            "subcategory": "Criptografia de dados transparente",
            "text": "Use CMK (chaves gerenciadas pelo cliente) no AKV (Azure Key Vault) se precisar de maior transparência e controle granular sobre a proteção de TDE",
            "waf": "Segurança"
        },
        {
            "category": "Encriptação",
            "description": "A configuração mínima de versão do TLS (Transport Layer Security) permite que os clientes escolham qual versão do TLS seu banco de dados SQL usa. É possível alterar a versão mínima do TLS usando o portal do Azure, o Azure PowerShell e a CLI do Azure.",
            "guid": "7754b605-57fd-4bcb-8213-52c39d8e8225",
            "id": "F04.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/connectivity-settings?source=recommendations&view=azuresql&tabs=azure-portal#minimal-tls-version",
            "severity": "Alto",
            "subcategory": "Segurança da camada de transporte",
            "text": "Impor a versão mínima do TLS para a mais recente disponível",
            "waf": "Segurança"
        },
        {
            "category": "Identidade",
            "description": "Use a autenticação do Azure Active Directory (Azure AD) para gerenciamento centralizado de identidades. Use a autenticação SQL somente se realmente necessário e documente como exceções.",
            "guid": "c9b8b6bf-2c6b-453d-b400-de9a43a549d7",
            "id": "G01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/authentication-aad-overview",
            "severity": "Média",
            "subcategory": "Azure Active Directory",
            "text": "Aproveite a autenticação do Azure AD para conexões com bancos de dados SQL do Azure",
            "waf": "Segurança"
        },
        {
            "category": "Identidade",
            "description": "O uso de grupos do Azure AD simplifica o gerenciamento de permissões e o proprietário do grupo e o proprietário do recurso podem adicionar/remover membros de/para o grupo. Crie um grupo separado para administradores do Azure AD para cada servidor lógico. Monitore as alterações de associação de grupo do Azure AD usando relatórios de atividades de auditoria do Azure AD.",
            "guid": "29820254-1d14-4778-ae90-ff4aeba504a3",
            "id": "G01.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/security-best-practice?view=azuresql#central-management-for-identities",
            "severity": "Média",
            "subcategory": "Azure Active Directory",
            "text": "Criar um grupo separado do Azure AD com duas contas de administrador para cada servidor lógico do Banco de Dados SQL do Azure",
            "waf": "Segurança"
        },
        {
            "category": "Identidade",
            "description": "Verifique se as identidades gerenciadas atribuídas pelo sistema e pelo usuário distintas, dedicadas à função, com menos permissões atribuídas, são usadas para comunicação dos serviços e aplicativos do Azure com os bancos de dados SQLDB do Azure.",
            "guid": "df3a09ee-03bb-4198-8637-d141acf5f289",
            "id": "G01.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/security-best-practice?view=azuresql#minimize-the-use-of-password-based-authentication-for-applications",
            "severity": "Média",
            "subcategory": "Azure Active Directory",
            "text": "Minimize o uso de autenticação baseada em senha para aplicativos",
            "waf": "Segurança"
        },
        {
            "category": "Identidade",
            "description": "As identidades gerenciadas atribuídas pelo sistema ou pelo usuário permitem que o SQL do Azure se autentique em outros serviços de nuvem (por exemplo, Azure Key Vault) sem armazenar credenciais no código. Depois de habilitadas, todas as permissões necessárias podem ser concedidas por meio do controle de acesso baseado em função do Azure para a instância específica do SQL do Azure. Não compartilhe identidades gerenciadas atribuídas pelo usuário em vários serviços se não for estritamente necessário.",
            "guid": "69891194-5074-4e30-8f69-4efc3c580900",
            "id": "G02.01",
            "link": "https://learn.microsoft.com/azure/active-directory/managed-identities-azure-resources/overview",
            "severity": "Baixo",
            "subcategory": "Identidades gerenciadas",
            "text": "Atribuir ao Banco de Dados SQL do Azure uma identidade gerenciada para acesso a recursos de saída",
            "waf": "Segurança"
        },
        {
            "category": "Identidade",
            "description": "Use uma autenticação integrada do Azure AD que elimina o uso de senhas. Os métodos de autenticação baseados em senha são uma forma mais fraca de autenticação. As credenciais podem ser comprometidas ou fornecidas por engano. Use a autenticação de logon único usando credenciais do Windows. Federe o domínio do AD local com o Azure AD e use a autenticação integrada do Windows (para computadores ingressados no domínio com o Azure AD).",
            "guid": "88287d4a-8bb8-4640-ad78-03f51354d003",
            "id": "G03.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/authentication-aad-configure?view=azuresql&tabs=azure-powershell#active-directory-integrated-authentication",
            "severity": "Média",
            "subcategory": "Senhas",
            "text": "Minimize o uso de autenticação baseada em senha para usuários",
            "waf": "Segurança"
        },
        {
            "category": "Livro-razão",
            "description": "O hash do bloco mais recente no livro-razão do banco de dados é chamado de resumo do banco de dados. Ele representa o estado de todas as tabelas contábeis no banco de dados no momento em que o bloco foi gerado. A geração de um resumo do banco de dados é eficiente, pois envolve o cálculo apenas dos hashes dos blocos que foram anexados recentemente. O Razão Confidencial do Azure é um dos repositórios com suporte, pode ser usado e dá suporte à geração e armazenamento automáticos de resumos de banco de dados. O Azure Ledger fornece recursos avançados de segurança, como Blockchain Ledger Proof e Confidential Hardware Enclaves. Use-o somente se recursos avançados de segurança forem necessários, caso contrário, reverta para o armazenamento do Azure.",
            "guid": "0e853380-50ba-4bce-b2fd-5c7391c85ecc",
            "id": "H01.01",
            "link": "https://learn.microsoft.com/azure/architecture/guide/technology-choices/multiparty-computing-service#confidential-ledger-and-azure-blob-storage",
            "severity": "Média",
            "subcategory": "Resumo do banco de dados",
            "text": "Usar o Razão Confidencial do Azure para armazenar resumos de banco de dados somente se recursos avançados de segurança forem necessários",
            "waf": "Segurança"
        },
        {
            "category": "Livro-razão",
            "description": "O hash do bloco mais recente no livro-razão do banco de dados é chamado de resumo do banco de dados. Ele representa o estado de todas as tabelas contábeis no banco de dados no momento em que o bloco foi gerado. A geração de um resumo do banco de dados é eficiente, pois envolve o cálculo apenas dos hashes dos blocos que foram anexados recentemente. O recurso Armazenamento de Blobs do Azure com Armazenamento Imutável pode ser usado e dá suporte à geração e ao armazenamento automáticos de resumos de banco de dados. Para evitar a violação de seus arquivos de resumo, configure e bloqueie uma política de retenção para seu contêiner.",
            "guid": "afefb2d3-95da-4ac9-acf5-33d18b32ef9a",
            "id": "H01.02",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/ledger/ledger-digest-management",
            "severity": "Média",
            "subcategory": "Resumo do banco de dados",
            "text": "Se a conta de armazenamento do Azure for usada para armazenar resumos de banco de dados, verifique se a segurança está configurada corretamente",
            "waf": "Segurança"
        },
        {
            "category": "Livro-razão",
            "description": "O Ledger fornece uma forma de integridade de dados chamada integridade direta, que fornece evidências de adulteração de dados em suas tabelas contábeis. O processo de verificação do banco de dados usa como entrada um ou mais resumos de banco de dados gerados anteriormente. Em seguida, ele recalcula os hashes armazenados no livro-razão do banco de dados com base no estado atual das tabelas do livro-razão. Se os hashes calculados não corresponderem aos resumos de entrada, a verificação falhará. A falha indica que os dados foram adulterados. O processo de verificação relata todas as inconsistências detectadas.",
            "guid": "f8d4ffda-8aac-4cc6-b72b-c81cb8625420",
            "id": "H02.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/ledger/ledger-database-verification",
            "severity": "Média",
            "subcategory": "Integridade",
            "text": "Agende o processo de verificação do Ledger regularmente para verificar a integridade dos dados",
            "waf": "Segurança"
        },
        {
            "category": "Livro-razão",
            "description": "O recurso Ledger fornece recursos de evidência de violação em seu banco de dados. Você pode atestar criptograficamente para outras partes, como auditores ou outras partes comerciais, que seus dados não foram adulterados. A Ledger ajuda a proteger os dados de qualquer invasor ou usuário de alto privilégio, incluindo administradores de banco de dados (DBAs), administradores de sistema e administradores de nuvem.",
            "guid": "2563f498-e2d3-42ea-9e7b-5517881a06a2",
            "id": "H03.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/ledger/ledger-overview",
            "severity": "Média",
            "subcategory": "Livro-razão",
            "text": "Se a prova criptográfica da integridade dos dados for um requisito crítico, o recurso Ledger deve ser considerado",
            "waf": "Segurança"
        },
        {
            "category": "Livro-razão",
            "description": "Dependendo do tipo de adulteração, há casos em que você pode reparar o livro-razão sem perder dados. No artigo contido na coluna --More Info--, são descritos diferentes cenários e técnicas de recuperação.",
            "guid": "804fc554-6554-4842-91c1-713b32f99902",
            "id": "H04.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/ledger/ledger-how-to-recover-after-tampering",
            "severity": "Média",
            "subcategory": "Recuperação",
            "text": "Preparar um plano de resposta para investigar e reparar um banco de dados após um evento de violação",
            "waf": "Segurança"
        },
        {
            "category": "Log",
            "description": "A Auditoria do Banco de Dados SQL do Azure rastreia eventos de banco de dados e os grava em um log de auditoria em sua conta de armazenamento do Azure. A auditoria ajuda você a entender a atividade do banco de dados e obter informações sobre discrepâncias e anomalias que podem indicar preocupações comerciais ou suspeitas de violações de segurança, além de ajudá-lo a atender à conformidade regulatória. Por padrão, a política de auditoria inclui todas as ações (consultas, procedimentos armazenados e logons bem-sucedidos e com falha) nos bancos de dados, o que pode resultar em um alto volume de logs de auditoria. É recomendável que os clientes configurem a auditoria para diferentes tipos de ações e grupos de ações usando o PowerShell.",
            "guid": "4082e31d-35f4-4a49-8507-d3172cc930a6",
            "id": "I01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/auditing-overview",
            "severity": "Média",
            "subcategory": "Auditoria",
            "text": "Verifique se a Auditoria do Banco de Dados SQL do Azure está habilitada no nível do servidor",
            "waf": "Segurança"
        },
        {
            "category": "Log",
            "description": "Os logs de Auditoria do Banco de Dados SQL do Azure podem ser gravados em contas de armazenamento externas, workspace do Log Analytics ou Hub de Eventos. Certifique-se de proteger o repositório de destino usando backups e configuração segura. Use a Identidade Gerenciada do Banco de Dados SQL do Azure para acessar o armazenamento e definir um período de retenção explícito. Não conceda permissões aos administradores para o repositório de log de auditoria. Use um armazenamento de destino diferente para --Habilitando a auditoria de operações de suporte da Microsoft--. ",
            "guid": "9b64bc50-b60f-4035-bf7a-28c4806dfb46",
            "id": "I01.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/auditing-overview",
            "severity": "Baixo",
            "subcategory": "Auditoria",
            "text": "Verifique se os logs de Auditoria do Banco de Dados SQL do Azure são copiados e protegidos no tipo de repositório selecionado",
            "waf": "Segurança"
        },
        {
            "category": "Log",
            "description": "O log de atividades do Azure Monitor é um log de plataforma no Azure que fornece informações sobre eventos no nível da assinatura. O log de atividades inclui informações como quando um recurso é modificado. É recomendável enviar esse log de atividades para o mesmo repositório de armazenamento externo que o Log de Auditoria do Banco de Dados SQL do Azure (conta de armazenamento, workspace do Log Analytics, Hub de Eventos).",
            "guid": "fcd34708-87ac-4efc-aaf6-57a47f76644a",
            "id": "I01.03",
            "link": "https://learn.microsoft.com/azure/azure-monitor/essentials/activity-log",
            "severity": "Média",
            "subcategory": "Auditoria",
            "text": "Verifique se o Log de Atividades do Banco de Dados SQL do Azure é coletado e integrado aos logs de auditoria",
            "waf": "Segurança"
        },
        {
            "category": "Log",
            "description": "Encaminhe todos os logs do SQL do Azure para o SIEM (Gerenciamento de Eventos e Informações de Segurança) e o SOAR (Automação e Resposta de Orquestração de Segurança). Verifique se você está monitorando diferentes tipos de ativos do Azure em busca de possíveis ameaças e anomalias. Concentre-se em receber alertas de alta qualidade para reduzir falsos positivos para os analistas classificarem. Os alertas podem ser originados de dados de log, agentes ou outros dados.",
            "guid": "f96e127e-9572-453a-b325-ff89ae9f6b44",
            "id": "I02.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/auditing-overview",
            "severity": "Média",
            "subcategory": "SIEM/SOAR",
            "text": "Verifique se os logs de auditoria do Banco de Dados SQL do Azure estão sendo apresentados ao SIEM/SOAR de suas organizações",
            "waf": "Segurança"
        },
        {
            "category": "Log",
            "description": "Encaminhe todos os logs do SQL do Azure para o SIEM (Gerenciamento de Eventos e Informações de Segurança) e o SOAR (Automação e Resposta de Orquestração de Segurança), que podem ser usados para configurar detecções de ameaças personalizadas. Verifique se você está monitorando diferentes tipos de ativos do Azure em busca de possíveis ameaças e anomalias. Concentre-se em receber alertas de alta qualidade para reduzir falsos positivos para os analistas classificarem. Os alertas podem ser originados de dados de log, agentes ou outros dados.",
            "guid": "41503bf8-73da-4a10-af9f-5f7fceb5456f",
            "id": "I02.02",
            "link": "https://learn.microsoft.com/azure/azure-monitor/essentials/activity-log",
            "severity": "Média",
            "subcategory": "SIEM/SOAR",
            "text": "Verifique se os dados do Log de Atividades do Banco de Dados SQL do Azure são apresentados no SIEM/SOAR",
            "waf": "Segurança"
        },
        {
            "category": "Log",
            "description": "A equipe do SOC (Centro de Operações de Segurança) deve criar um plano de resposta a incidentes (guias estratégicos ou respostas manuais) para investigar e mitigar adulterações, atividades maliciosas e outros comportamentos anômalos.",
            "guid": "19ec7c97-c563-4e1d-82f0-54d6ec12e754",
            "id": "I02.03",
            "link": "https://learn.microsoft.com/azure/azure-monitor/essentials/activity-log",
            "severity": "Média",
            "subcategory": "SIEM/SOAR",
            "text": "Certifique-se de ter planos de resposta para eventos de log de auditoria mal-intencionados ou aberrantes",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "Quando você cria um servidor lógico no portal do Azure para o Banco de Dados SQL do Azure, o resultado é um ponto de extremidade público visível e acessível pela rede pública (Acesso Público). Em seguida, você pode limitar a conectividade com base nas regras de firewall e no Ponto de Extremidade de Serviço. Você também pode configurar a conectividade privada limitando apenas as conexões a redes internas usando o Ponto de extremidade privado (Acesso privado). O Acesso Privado usando o Ponto de Extremidade Privado deve ser o padrão, a menos que um caso de negócios ou motivo técnico/de desempenho se aplique que não possa dar suporte a ele. O uso de pontos de extremidade privados tem implicações de desempenho que precisam ser consideradas e avaliadas.",
            "guid": "2c6d356a-1784-475b-a42c-ec187dc8c925",
            "id": "J01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/network-access-controls-overview",
            "severity": "Alto",
            "subcategory": "Conectividade",
            "text": "Examine os métodos de conectividade de Acesso Público vs. Privado e selecione o apropriado para a carga de trabalho",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "IMPORTANTE: As conexões com o ponto de extremidade privado só dão suporte ao Proxy como a política de conexão. Ao usar pontos de extremidade privados, as conexões são enviadas por proxy por meio do gateway do Banco de Dados SQL do Azure para os nós do banco de dados. Os clientes não terão uma conexão direta.",
            "guid": "557b3ce5-bada-4296-8d52-a2d447bc1718",
            "id": "J01.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/connectivity-architecture",
            "severity": "Baixo",
            "subcategory": "Conectividade",
            "text": "Mantenha a Política de Conexão do Banco de Dados SQL do Azure padrão se não for necessário e justificado de forma diferente",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "Essa opção configura o firewall para permitir todas as conexões do Azure, incluindo conexões das assinaturas de outros clientes. Se você selecionar essa opção, certifique-se de que suas permissões de login e usuário limitem o acesso apenas a usuários autorizados. Se não for estritamente necessário, mantenha esta configuração como OFF.",
            "guid": "f48efacf-4405-4e8d-9dd0-16c5302ed082",
            "id": "J01.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/network-access-controls-overview",
            "severity": "Alto",
            "subcategory": "Conectividade",
            "text": "Verifique se a configuração Permitir que serviços e recursos do Azure acessem este servidor esteja desabilitada no firewall do Banco de Dados SQL do Azure",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "O Banco de Dados SQL do Azure tem um novo recurso interno que permite a integração nativa com pontos de extremidade REST externos. Isso significa que a integração do Banco de Dados SQL do Azure com Azure Functions, Aplicativos Lógicos do Azure, Serviços Cognitivos, Hubs de Eventos, Grade de Eventos, Contêineres do Azure, Gerenciamento de API e, em geral, qualquer ponto de extremidade REST ou mesmo GraphQL. Se não for restrito corretamente, o código dentro de um banco de dados do Banco de Dados SQL do Azure poderá aproveitar esse mecanismo para exfiltrar dados. Se não for estritamente necessário, é recomendável bloquear ou restringir esse recurso usando as regras de firewall de saída.",
            "guid": "cb3274a7-e36d-46f6-8de5-46d30c8dde8e",
            "id": "J02.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/system-stored-procedures/sp-invoke-external-rest-endpoint-transact-sql",
            "severity": "Média",
            "subcategory": "Controle de saída",
            "text": "Bloquear ou restringir chamadas de API REST de saída para pontos de extremidade externos",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "As regras de firewall de saída limitam o tráfego de rede do servidor lógico do Banco de Dados SQL do Azure a uma lista definida pelo cliente de contas de Armazenamento do Azure e servidores lógicos do Banco de Dados SQL do Azure. Qualquer tentativa de acessar contas de armazenamento ou bancos de dados que não estejam nessa lista é negada.",
            "guid": "a566dd3d-314e-4a94-9378-102c42d82b38",
            "id": "J02.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/outbound-firewall-rule-overview",
            "severity": "Média",
            "subcategory": "Controle de saída",
            "text": "Se o acesso à rede de saída for necessário, é recomendável configurar restrições de rede de saída usando o recurso de controle interno do Banco de Dados SQL do Azure",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "O Ponto de Extremidade Privado é criado dentro de uma sub-rede em uma Rede Virtual do Azure. A configuração de segurança adequada também deve ser aplicada ao ambiente de rede que o contém, incluindo NSG/ASG, UDR, firewall, monitoramento e auditoria.",
            "guid": "246cd832-f550-4af0-9c74-ca9baeeb8860",
            "id": "J03.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/private-endpoint-overview?view=azuresql#disable-public-access-to-your-logical-server",
            "severity": "Média",
            "subcategory": "Acesso Privado",
            "text": "Se a conectividade de Acesso Privado for usada, verifique se você está usando as listas de verificação do Ponto de Extremidade Privado, da Rede Virtual do Azure, do Firewall do Azure e do Grupo de Segurança de Rede do Azure",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "Ao adicionar uma conexão de Ponto de Extremidade Privado, o roteamento público para o servidor lógico não é bloqueado por padrão. No painel --Firewall e redes virtuais-- , a configuração --Negar acesso à rede pública-- não é selecionada por padrão. Para desativar o acesso à rede pública, certifique-se de selecionar --Deny public network access--.",
            "guid": "3a0808ee-ea7a-47ab-bdce-920a6a2b3881",
            "id": "J03.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/private-endpoint-overview?view=azuresql#disable-public-access-to-your-logical-server",
            "severity": "Alto",
            "subcategory": "Acesso Privado",
            "text": "Se o Ponto de Extremidade Privado (Acesso Privado) for usado, considere desabilitar a conectividade de Acesso Público",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "O NSG (Grupo de Segurança de Rede) e o ASG (Grupo de Segurança de Aplicativo) agora podem ser aplicados à sub-rede que contém Pontos de Extremidade Privados para restringir conexões com o SQL do Azure",
            "guid": "8600527e-e8c4-4424-90ef-1f0dca0224f2",
            "id": "J03.03",
            "link": "https://learn.microsoft.com/azure/private-link/private-endpoint-overview#network-security-of-private-endpoints",
            "severity": "Média",
            "subcategory": "Acesso Privado",
            "text": "Se o Ponto de Extremidade Privado (Acesso Privado) for usado, aplique o NSG e, eventualmente, o ASG para limitar os intervalos de endereços IP de origem de entrada",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "Uma MI (Instância Gerenciada) pode ser isolada dentro de uma rede virtual para impedir o acesso externo. Aplicativos e ferramentas que estão na mesma rede virtual ou emparelhada na mesma região podem acessá-la diretamente. Aplicativos e ferramentas que estão em regiões diferentes podem usar a conexão de rede virtual para rede virtual ou o emparelhamento de circuito do ExpressRoute para estabelecer a conexão. O cliente deve usar NSG (Grupos de Segurança de Rede) e, eventualmente, firewalls internos, para restringir o acesso pela porta 1433 somente a recursos que exigem acesso a uma instância gerenciada.",
            "guid": "18123ef4-a0a6-45e3-87fe-7f454f65d975",
            "id": "J03.04",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/connectivity-architecture-overview",
            "severity": "Média",
            "subcategory": "Acesso Privado",
            "text": "Aplicar NSG (Grupos de Segurança de Rede) e regras de firewall para restringir o acesso à sub-rede interna da Instância Gerenciada de SQL do Azure",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "O Ponto de Extremidade de Serviço da Rede Virtual do Azure é a solução preferencial se você quiser estabelecer uma conexão direta com os nós de back-end do Banco de Dados SQL do Azure usando a política de redirecionamento. Isso permitirá o acesso no modo de alto desempenho e é a abordagem recomendada do ponto de vista do desempenho.",
            "guid": "55187443-6852-4fbd-99c6-ce303597ca7f",
            "id": "J04.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/network-access-controls-overview?view=azuresql#ip-vs-virtual-network-firewall-rules",
            "severity": "Alto",
            "subcategory": "Acesso público",
            "text": "Se a conectividade de Acesso Público for usada, aproveite o Ponto de Extremidade de Serviço para restringir o acesso de Redes Virtuais do Azure selecionadas",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "O firewall do Banco de Dados SQL do Azure permite que você especifique intervalos de endereços IP dos quais as comunicações são aceitas. Essa abordagem é adequada para endereços IP estáveis que estão fora da rede privada do Azure.",
            "guid": "a73e32da-b3f4-4960-b5ec-2f42a557bf31",
            "id": "J04.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/network-access-controls-overview",
            "severity": "Média",
            "subcategory": "Acesso público",
            "text": "Se a conectividade de Acesso Público for usada, certifique-se de que apenas IPs conhecidos específicos sejam adicionados ao firewall",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "Recomendamos que você use regras de firewall IP no nível do banco de dados sempre que possível. Essa prática aumenta a segurança e torna seu banco de dados mais portátil. Use regras de firewall IP no nível do servidor para administradores. Use-os também quando tiver muitos bancos de dados com os mesmos requisitos de acesso e não quiser configurar cada banco de dados individualmente.",
            "guid": "e0f31ac9-35c8-4bfd-9865-edb60ffc6768",
            "id": "J04.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/firewall-configure",
            "severity": "Baixo",
            "subcategory": "Acesso público",
            "text": "Se a conectividade de Acesso Público for usada e controlada por regras de firewall do Banco de Dados SQL do Azure, use regras de IP no nível do banco de dados no nível do servidor",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "Uma MI (Instância Gerenciada) pode ser isolada dentro de uma rede virtual para impedir o acesso externo. O ponto de extremidade público da Instância Gerenciada não está habilitado por padrão, deve ser habilitado explicitamente, somente se estritamente necessário. Se a política da empresa não permitir o uso de pontos de extremidade públicos, use o Azure Policy para impedir a habilitação de pontos de extremidade públicos em primeiro lugar.",
            "guid": "b8435656-143e-41a8-9922-61d34edb751a",
            "id": "J04.04",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/public-endpoint-overview",
            "severity": "Alto",
            "subcategory": "Acesso público",
            "text": "Não habilitar o ponto de extremidade público da Instância Gerenciada de SQL do Azure",
            "waf": "Segurança"
        },
        {
            "category": "Rede",
            "description": "Um ponto de extremidade público de Instância Gerenciada (SQL MI) não está habilitado por padrão, deve ser habilitado explicitamente, somente se estritamente necessário. Nesse caso, é recomendável aplicar um NSG (Grupos de Segurança de Rede) para restringir o acesso à porta 3342 somente a endereços IP de origem confiáveis.",
            "guid": "057dd298-8726-4aa6-b590-1f81d2e30421",
            "id": "J04.05",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/public-endpoint-overview",
            "severity": "Alto",
            "subcategory": "Acesso público",
            "text": "Restringir o acesso se o ponto de extremidade público da Instância Gerenciada de SQL do Azure for necessário",
            "waf": "Segurança"
        },
        {
            "category": "Acesso privilegiado",
            "description": "A maioria das operações, suporte e solução de problemas executados pela equipe e subprocessadores da Microsoft não exigem acesso aos dados do cliente. Nas raras circunstâncias em que esse acesso é necessário, o Sistema de Proteção de Dados do Cliente para Microsoft Azure fornece uma interface para que os clientes revisem e aprovem ou rejeitem solicitações de acesso a dados do cliente.  Em cenários de suporte em que a Microsoft precisa acessar os dados do cliente, o Banco de Dados SQL do Azure dá suporte ao Sistema de Proteção de Dados do Cliente para fornecer uma interface para você examinar e aprovar ou rejeitar solicitações de acesso aos dados do cliente.",
            "guid": "37b6eb0f-553d-488f-8a8a-cb9bf97388ff",
            "id": "K01.01",
            "link": "https://learn.microsoft.com/azure/security/fundamentals/customer-lockbox-overview",
            "severity": "Baixo",
            "subcategory": "Cofre",
            "text": "Examinar e habilitar o Sistema de Proteção de Dados do Cliente para acesso ao Banco de Dados SQL do Azure pela equipe da Microsoft",
            "waf": "Segurança"
        },
        {
            "category": "Acesso privilegiado",
            "description": "O princípio do privilégio mínimo afirma que os usuários não devem ter mais privilégios do que o necessário para concluir suas tarefas. Os usuários de servidor e banco de dados com altos privilégios podem executar muitas atividades de configuração e manutenção no banco de dados e também podem descartar bancos de dados na instância SQL do Azure. O rastreamento de proprietários de banco de dados e contas privilegiadas é importante para evitar permissão excessiva.",
            "guid": "5fe5281f-f0f9-4842-a682-8baf18bd8316",
            "id": "K02.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/security-best-practice?view=azuresql#implement-principle-of-least-privilege",
            "severity": "Média",
            "subcategory": "Permissões",
            "text": "Garantir que os usuários recebam o nível mínimo de acesso necessário para concluir suas funções de trabalho",
            "waf": "Segurança"
        },
        {
            "category": "Acesso privilegiado",
            "description": "As identidades (Usuários e SPNs) devem ter como escopo a menor quantidade de acesso necessária para executar a função.  Um número maior de SPNs com escopo restrito deve ser usado, em vez de ter um SPN com vários conjuntos de permissões não relacionadas. Por exemplo, se houver três aplicativos Web externos hospedados no local que fazem consultas ao Banco de Dados SQL do Azure, nem todos deverão usar o mesmo SPN para essas atividades.  Em vez disso, cada um deles deve ter seu próprio SPN com escopo restrito.",
            "guid": "7b5b55e5-4750-4920-be97-eb726c256a5c",
            "id": "K02.02",
            "link": "https://learn.microsoft.com/security/benchmark/azure/baselines/sql-database-security-baseline#im-3-use-azure-ad-single-sign-on-sso-for-application-access",
            "severity": "Baixo",
            "subcategory": "Permissões",
            "text": "Verifique se aplicativos distintos receberão credenciais diferentes com permissões mínimas para acessar o Banco de Dados SQL do Azure",
            "waf": "Segurança"
        }
    ],
    "metadata": {
        "name": "Azure SQLDB Security Checklist (Preview)",
        "state": "Preview",
        "timestamp": "October 23, 2024"
    },
    "severities": [
        {
            "name": "Alto"
        },
        {
            "name": "Média"
        },
        {
            "name": "Baixo"
        }
    ],
    "status": [
        {
            "description": "Esta verificação ainda não foi analisada",
            "name": "Não verificado"
        },
        {
            "description": "Há um item de ação associado a essa verificação",
            "name": "Abrir"
        },
        {
            "description": "Essa verificação foi verificada e não há mais itens de ação associados a ela",
            "name": "Cumprido"
        },
        {
            "description": "Recomendação compreendida, mas não necessária pelos requisitos atuais",
            "name": "Não é necessário"
        },
        {
            "description": "Não aplicável para o projeto atual",
            "name": "N/A"
        }
    ],
    "waf": [
        {
            "name": "Fiabilidade"
        },
        {
            "name": "Segurança"
        },
        {
            "name": "Custar"
        },
        {
            "name": "Operações"
        },
        {
            "name": "Desempenho"
        }
    ],
    "yesno": [
        {
            "name": "Sim"
        },
        {
            "name": "Não"
        }
    ]
}