{
    "categories": [
        {
            "name": "BCDR (en inglés)"
        },
        {
            "name": "Defensor"
        },
        {
            "name": "Encriptación"
        },
        {
            "name": "Identidad"
        },
        {
            "name": "Acceso privilegiado"
        },
        {
            "name": "Libro mayor"
        },
        {
            "name": "Registro"
        },
        {
            "name": "Gestión de redes"
        },
        {
            "name": "Detección y clasificación de datos"
        },
        {
            "name": "Enmascaramiento de datos"
        },
        {
            "name": "Código"
        }
    ],
    "items": [
        {
            "category": "BCDR (en inglés)",
            "description": "Asegúrese de que sus copias de seguridad estén protegidas contra ataques. Esto debe incluir el cifrado de las copias de seguridad para protegerlas contra la pérdida de confidencialidad. Para la copia de seguridad periódica del servicio de Azure, los datos de copia de seguridad se cifran automáticamente mediante claves administradas por la plataforma Azure. También puede optar por cifrar la copia de seguridad mediante una clave administrada por el cliente. En este caso, asegúrese de que esta clave administrada por el cliente en el almacén de claves también esté en el ámbito de copia de seguridad.",
            "guid": "676f6951-0368-49e9-808d-c33a692c9a64",
            "id": "A01.01",
            "link": "https://learn.microsoft.com/security/benchmark/azure/baselines/sql-database-security-baseline#br-2-encrypt-backup-data",
            "severity": "Medio",
            "subcategory": "Azure Key Vault",
            "text": "Proteja los datos de copia de seguridad con cifrado y almacene las claves de forma segura en Azure Key Vault",
            "waf": "Seguridad"
        },
        {
            "category": "BCDR (en inglés)",
            "description": "Azure SQL Database usa la tecnología de SQL Server para crear copias de seguridad completas cada semana, copias de seguridad diferenciales cada 12-24 horas y copias de seguridad del registro de transacciones cada 5 a 10 minutos. De forma predeterminada, SQL Database almacena datos en blobs de almacenamiento con redundancia geográfica que se replican en una región emparejada.",
            "guid": "e2518261-b3bc-4bd1-b331-637fb2df833f",
            "id": "A02.01",
            "link": "https://learn.microsoft.com/security/benchmark/azure/baselines/sql-database-security-baseline#br-1-ensure-regular-automated-backups",
            "severity": "Medio",
            "subcategory": "Copia de seguridad",
            "text": "Configuración de copias de seguridad automatizadas de Azure SQL Database",
            "waf": "Seguridad"
        },
        {
            "category": "BCDR (en inglés)",
            "description": "De forma predeterminada, SQL Database almacena datos en blobs de almacenamiento con redundancia geográfica que se replican en una región emparejada. Para SQL Database, la redundancia de almacenamiento de copia de seguridad se puede configurar en el momento de la creación de la base de datos o se puede actualizar para una base de datos existente; Los cambios realizados en una base de datos existente solo se aplican a las copias de seguridad futuras.",
            "guid": "f8c7cda2-3ed7-43fb-a100-85dcd12a0ee4",
            "id": "A02.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/automated-backups-overview?tabs=single-database&view=azuresql#backup-storage-redundancy",
            "severity": "Bajo",
            "subcategory": "Copia de seguridad",
            "text": "Habilite el almacenamiento de copia de seguridad con redundancia geográfica para protegerse contra errores de una sola región y pérdida de datos",
            "waf": "Seguridad"
        },
        {
            "category": "Código",
            "description": "El código malicioso puede eludir los controles de seguridad. Antes de implementar código personalizado en producción, es esencial revisar lo que se está implementando. Use una herramienta de base de datos como Azure Data Studio que admita el control de código fuente. Implemente herramientas y lógica para el análisis de código, vulnerabilidades y escaneo de credenciales.",
            "guid": "7ca9f006-d2a9-4652-951c-de8e4ac5e76e",
            "id": "B01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/transparent-data-encryption-byok-create-server",
            "severity": "Medio",
            "subcategory": "Control de código fuente y revisión de código",
            "text": "Use sistemas de control de código fuente para almacenar, mantener y revisar el código de la aplicación implementado en Azure SQLDB Database",
            "waf": "Seguridad"
        },
        {
            "category": "Detección y clasificación de datos",
            "description": "En el caso de los requisitos de clasificación, Purview es la opción preferida. Utilice solo SQL Data Discovery & Classification en caso de que Purview no sea una opción. Detecte columnas que puedan contener datos confidenciales. Lo que se considera datos sensibles depende en gran medida del cliente, de la normativa de cumplimiento, etc., y debe ser evaluado por los usuarios a cargo de esos datos. Clasifique las columnas para usar escenarios avanzados de auditoría y protección basados en sensibilidad. Revise los resultados de la detección automatizada y finalice la clasificación si es necesario.",
            "guid": "d401509b-2629-4484-9a7f-af0d29a7778f",
            "id": "C01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/data-discovery-and-classification-overview?view=azuresql#faq---advanced-classification-capabilities",
            "severity": "Bajo",
            "subcategory": "Detección y clasificación de datos",
            "text": "Planifique y configure la detección y clasificación de datos para proteger los datos confidenciales",
            "waf": "Seguridad"
        },
        {
            "category": "Enmascaramiento de datos",
            "description": "El uso de esta característica solo se recomienda si el cifrado de columnas no es una opción y hay un requisito específico para conservar los tipos y formatos de datos. El enmascaramiento dinámico de datos limita la exposición de datos confidenciales al enmascararlos a usuarios no privilegiados. El enmascaramiento dinámico de datos ayuda a evitar el acceso no autorizado a datos confidenciales al permitir que los clientes designen la cantidad de datos confidenciales que revelarán con un impacto mínimo en la capa de la aplicación.",
            "guid": "9391fd50-135e-453e-90a7-c1a23f88cc13",
            "id": "D01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/dynamic-data-masking-overview",
            "severity": "Bajo",
            "subcategory": "Enmascaramiento de datos",
            "text": "Utilice el enmascaramiento de datos para evitar el acceso a los datos de usuarios no autorizados que no sean administradores si no es posible el cifrado",
            "waf": "Seguridad"
        },
        {
            "category": "Defensor",
            "description": "SQL Advanced Threat Detection (ATP) proporciona una capa de seguridad que detecta posibles vulnerabilidades y actividades anómalas en las bases de datos, como ataques de inyección SQL y patrones de comportamiento inusuales. Cuando se detecta una amenaza potencial, Detección de amenazas envía una alerta accionable en tiempo real por correo electrónico y en Microsoft Defender for Cloud, que incluye pasos claros de investigación y corrección para la amenaza específica.",
            "guid": "4e52d73f-5d37-428f-b3a2-e6997e835979",
            "id": "E01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/threat-detection-configure",
            "severity": "Alto",
            "subcategory": "Protección avanzada contra amenazas",
            "text": "Revisar y completar la configuración de Advanced Threat Protection (ATP)",
            "waf": "Seguridad"
        },
        {
            "category": "Defensor",
            "description": "Habilite Microsoft Defender para Azure SQL en el nivel de suscripción para incorporar y proteger automáticamente todos los servidores y bases de datos existentes y futuros. Cuando se habilita en el nivel de suscripción, todas las bases de datos de Azure SQL Database y Azure SQL Managed Instance están protegidas. A continuación, puede desactivarlos individualmente si lo desea. Si desea administrar manualmente las bases de datos que están protegidas, deshabilite en el nivel de suscripción y habilite cada base de datos que desee proteger.",
            "guid": "dff87489-9edb-4cef-bdda-86e8212b2aa1",
            "id": "E02.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/azure-defender-for-sql?view=azuresql#enable-microsoft-defender-for-sql ",
            "severity": "Alto",
            "subcategory": "Defender para Azure SQL",
            "text": "Habilitación de Microsoft Defender para Azure SQL",
            "waf": "Seguridad"
        },
        {
            "category": "Defensor",
            "description": "Microsoft Defender para Azure SQL ATP detecta actividades anómalas que indican intentos inusuales y potencialmente dañinos de acceder a bases de datos o aprovecharlas. Las alertas se pueden configurar y generar, y se notificarán en Defender para consola.",
            "guid": "ca342fdf-d25a-4427-b105-fcd50ff8a0ea",
            "id": "E02.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/threat-detection-configure",
            "severity": "Alto",
            "subcategory": "Defender para Azure SQL",
            "text": "Prepare un plan de respuesta de seguridad para reaccionar rápidamente a las alertas de Microsoft Defender para Azure SQL",
            "waf": "Seguridad"
        },
        {
            "category": "Defensor",
            "description": "La evaluación de vulnerabilidades de Azure SQLDB es un servicio que proporciona visibilidad del estado de seguridad. La evaluación de vulnerabilidades incluye pasos prácticos para resolver problemas de seguridad y mejorar la seguridad de la base de datos. Puede ayudarle a supervisar un entorno de base de datos dinámico en el que los cambios son difíciles de rastrear y mejorar la posición de seguridad de SQL.",
            "guid": "a6101ae7-534c-45ab-86fd-b34c55ea21ca",
            "id": "E03.01",
            "link": "https://learn.microsoft.com/azure/defender-for-cloud/sql-azure-vulnerability-assessment-overview",
            "severity": "Alto",
            "subcategory": "Evaluación de vulnerabilidades",
            "text": "Configurar los hallazgos de la evaluación de vulnerabilidades (VA) y revisar las recomendaciones",
            "waf": "Seguridad"
        },
        {
            "category": "Defensor",
            "description": "Microsoft Defender for Cloud proporciona una evaluación de vulnerabilidades para las bases de datos SQL de Azure. La evaluación de vulnerabilidades analiza las bases de datos en busca de vulnerabilidades de software y proporciona una lista de hallazgos. Puede utilizar los hallazgos para corregir vulnerabilidades de software y deshabilitar los hallazgos.",
            "guid": "c8c5f112-1e50-4f77-9264-8195b4cd61ac",
            "id": "E03.02",
            "link": "https://learn.microsoft.com/azure/defender-for-cloud/sql-azure-vulnerability-assessment-find?view=azuresql",
            "severity": "Alto",
            "subcategory": "Evaluación de vulnerabilidades",
            "text": "Revisar periódicamente los hallazgos y recomendaciones de la Evaluación de Vulnerabilidades (VA) y preparar un plan para solucionarlo.",
            "waf": "Seguridad"
        },
        {
            "category": "Encriptación",
            "description": "Always Encrypted with Secure Enclaves amplía las capacidades informáticas confidenciales de Always Encrypted al permitir el cifrado local y consultas confidenciales más completas. Always Encrypted with Secure Enclaves soluciona estas limitaciones al permitir algunos cálculos en datos de texto no cifrado dentro de un enclave seguro en el lado del servidor. Se recomienda el uso de esta característica para los casos en los que necesite limitar el acceso del administrador y necesite que sus consultas admitan algo más que la coincidencia de igualdad de columnas cifradas.",
            "guid": "65d7e54a-10a6-4094-b673-9ff3809c9277",
            "id": "F01.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/encryption/always-encrypted-enclaves",
            "severity": "Medio",
            "subcategory": "Siempre encriptado",
            "text": "Si la protección de los datos confidenciales de PII de los usuarios administradores es un requisito clave, pero no se pueden tolerar las limitaciones de Cifrado de columnas, considere la adopción de Siempre cifrado con enclaves seguros",
            "waf": "Seguridad"
        },
        {
            "category": "Encriptación",
            "description": "Con Azure SQL Database, puede aplicar el cifrado simétrico a una columna de datos mediante Transact-SQL. Este enfoque se denomina cifrado de columnas, ya que se puede usar para cifrar columnas específicas con diferentes claves de cifrado. De este modo, se proporciona una capacidad de cifrado más granular que TDE, que cifra los datos de las páginas. Uso de Always Encrypted para asegurarse de que los datos confidenciales no se exponen en texto no cifrado en Azure SQL Database o SQL Managed Instance, incluso en memoria o en uso. Always Encrypted protege los datos de los administradores de bases de datos (DBA) y los administradores de la nube (o actores malintencionados que pueden hacerse pasar por usuarios no autorizados con muchos privilegios) y le proporciona más control sobre quién puede acceder a sus datos.",
            "guid": "c03ce136-e3d5-4e17-bf25-ed955ee480d3",
            "id": "F02.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/security-best-practice?view=azuresql#control-access-of-application-users-to-sensitive-data-through-encryption",
            "severity": "Bajo",
            "subcategory": "Cifrado de columnas",
            "text": "Para proteger los datos confidenciales de PII de usuarios que no son administradores en columnas de tabla específicas, considere la posibilidad de usar el cifrado de columnas",
            "waf": "Seguridad"
        },
        {
            "category": "Encriptación",
            "description": "Habilitado de forma predeterminada, el cifrado de datos transparente (TDE) ayuda a proteger los archivos de la base de datos contra la divulgación de información mediante la realización del cifrado y descifrado en tiempo real de la base de datos, las copias de seguridad asociadas y los archivos de registro de transacciones \"en reposo\", sin necesidad de realizar cambios en la aplicación.",
            "guid": "c614ac47-bebf-4061-b0a1-43e0c6b5e00d",
            "id": "F03.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/transparent-data-encryption-byok-create-server",
            "severity": "Alto",
            "subcategory": "Cifrado de datos transparente",
            "text": "Asegúrese de que el cifrado de datos transparente (TDE) se mantenga habilitado",
            "waf": "Seguridad"
        },
        {
            "category": "Encriptación",
            "description": "Si se requiere la separación de funciones en la administración de claves y datos dentro de la organización, aproveche las claves administradas por el cliente (CMK) para el cifrado de datos transparente (TDE) para su Azure SQLDB y use Azure Key Vault para almacenar (consulte su lista de comprobación). Aproveche esta característica cuando tenga requisitos de seguridad estrictos que no puedan cumplir las claves de servicio administradas.",
            "guid": "2edb4165-4f54-47cc-a891-5c82c2f21e25",
            "id": "F03.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/transparent-data-encryption-byok-overview",
            "severity": "Medio",
            "subcategory": "Cifrado de datos transparente",
            "text": "Use claves administradas por el cliente (CMK) en Azure Key Vault (AKV) si necesita una mayor transparencia y control pormenorizado sobre la protección de TDE",
            "waf": "Seguridad"
        },
        {
            "category": "Encriptación",
            "description": "La configuración de versión mínima de Seguridad de la capa de transporte (TLS) permite a los clientes elegir qué versión de TLS usa su base de datos SQL. Es posible cambiar la versión mínima de TLS mediante Azure Portal, Azure PowerShell y la CLI de Azure.",
            "guid": "7754b605-57fd-4bcb-8213-52c39d8e8225",
            "id": "F04.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/connectivity-settings?source=recommendations&view=azuresql&tabs=azure-portal#minimal-tls-version",
            "severity": "Alto",
            "subcategory": "Seguridad de la capa de transporte",
            "text": "Aplicar la versión mínima de TLS a la última disponible",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Use la autenticación de Azure Active Directory (Azure AD) para la administración centralizada de identidades. Utilice la autenticación SQL solo si es realmente necesario y documente como excepciones.",
            "guid": "c9b8b6bf-2c6b-453d-b400-de9a43a549d7",
            "id": "G01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/authentication-aad-overview",
            "severity": "Medio",
            "subcategory": "Azure Active Directory",
            "text": "Aproveche la autenticación de Azure AD para las conexiones a Azure SQL Databases",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "El uso de grupos de Azure AD simplifica la administración de permisos y tanto el propietario del grupo como el propietario del recurso pueden agregar o quitar miembros del grupo. Cree un grupo independiente para los administradores de Azure AD para cada servidor lógico. Supervise los cambios en la pertenencia a grupos de Azure AD mediante los informes de actividad de auditoría de Azure AD.",
            "guid": "29820254-1d14-4778-ae90-ff4aeba504a3",
            "id": "G01.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/security-best-practice?view=azuresql#central-management-for-identities",
            "severity": "Medio",
            "subcategory": "Azure Active Directory",
            "text": "Creación de un grupo de Azure AD independiente con dos cuentas de administrador para cada servidor lógico de Azure SQL Database",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Asegúrese de que las identidades administradas asignadas por el sistema y el usuario distintas, dedicadas a la función, con el mínimo de permisos asignados, se usen para la comunicación entre los servicios y las aplicaciones de Azure y las bases de datos de Azure SQLDB.",
            "guid": "df3a09ee-03bb-4198-8637-d141acf5f289",
            "id": "G01.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/security-best-practice?view=azuresql#minimize-the-use-of-password-based-authentication-for-applications",
            "severity": "Medio",
            "subcategory": "Azure Active Directory",
            "text": "Minimice el uso de la autenticación basada en contraseña para las aplicaciones",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Las identidades administradas asignadas por el sistema o por el usuario permiten que Azure SQLDB se autentique en otros servicios en la nube (por ejemplo, Azure Key Vault) sin almacenar credenciales en el código. Una vez habilitado, se pueden conceder todos los permisos necesarios a través del control de acceso basado en roles de Azure a la instancia específica de Azure SQLDB. No comparta identidades administradas asignadas por el usuario entre varios servicios si no es estrictamente necesario.",
            "guid": "69891194-5074-4e30-8f69-4efc3c580900",
            "id": "G02.01",
            "link": "https://learn.microsoft.com/azure/active-directory/managed-identities-azure-resources/overview",
            "severity": "Bajo",
            "subcategory": "Identidades administradas",
            "text": "Asignación de Azure SQL Database a una identidad administrada para el acceso a recursos de salida",
            "waf": "Seguridad"
        },
        {
            "category": "Identidad",
            "description": "Use una autenticación integrada de Azure AD que elimine el uso de contraseñas. Los métodos de autenticación basados en contraseñas son una forma más débil de autenticación. Las credenciales pueden verse comprometidas o cedidas por error. Utilice la autenticación de inicio de sesión único con credenciales de Windows. Federe el dominio de AD local con Azure AD y use la autenticación integrada de Windows (para máquinas unidas a un dominio con Azure AD).",
            "guid": "88287d4a-8bb8-4640-ad78-03f51354d003",
            "id": "G03.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/authentication-aad-configure?view=azuresql&tabs=azure-powershell#active-directory-integrated-authentication",
            "severity": "Medio",
            "subcategory": "Contraseñas",
            "text": "Minimice el uso de la autenticación basada en contraseña para los usuarios",
            "waf": "Seguridad"
        },
        {
            "category": "Libro mayor",
            "description": "El hash del último bloque en el libro mayor de la base de datos se denomina resumen de la base de datos. Representa el estado de todas las tablas del libro mayor de la base de datos en el momento en que se generó el bloque. La generación de un resumen de base de datos es eficiente, ya que implica calcular solo los hashes de los bloques que se agregaron recientemente. Azure Confidential Ledger es uno de los almacenes compatibles, se puede usar y admite la generación y el almacenamiento automáticos de resúmenes de bases de datos. Azure Ledger proporciona características de seguridad avanzadas, como Blockchain, Ledger, Proof y Confidential Hardware Enclaves. Úselo solo si se requieren características de seguridad avanzadas, de lo contrario, vuelva al almacenamiento de Azure.",
            "guid": "0e853380-50ba-4bce-b2fd-5c7391c85ecc",
            "id": "H01.01",
            "link": "https://learn.microsoft.com/azure/architecture/guide/technology-choices/multiparty-computing-service#confidential-ledger-and-azure-blob-storage",
            "severity": "Medio",
            "subcategory": "Resumen de base de datos",
            "text": "Use Azure Confidential Ledger para almacenar resúmenes de bases de datos solo si se requieren características de seguridad avanzadas",
            "waf": "Seguridad"
        },
        {
            "category": "Libro mayor",
            "description": "El hash del último bloque en el libro mayor de la base de datos se denomina resumen de la base de datos. Representa el estado de todas las tablas del libro mayor de la base de datos en el momento en que se generó el bloque. La generación de un resumen de base de datos es eficiente, ya que implica calcular solo los hashes de los bloques que se agregaron recientemente. Se puede usar la característica Azure Blob Storage con almacenamiento inmutable y admite la generación y el almacenamiento automáticos de resúmenes de bases de datos. Para evitar la manipulación de los archivos de resumen, configure y bloquee una directiva de retención para el contenedor.",
            "guid": "afefb2d3-95da-4ac9-acf5-33d18b32ef9a",
            "id": "H01.02",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/ledger/ledger-digest-management",
            "severity": "Medio",
            "subcategory": "Resumen de base de datos",
            "text": "Si se usa la cuenta de almacenamiento de Azure para almacenar resúmenes de base de datos, asegúrese de que la seguridad esté configurada correctamente",
            "waf": "Seguridad"
        },
        {
            "category": "Libro mayor",
            "description": "Ledger proporciona una forma de integridad de datos llamada integridad directa, que proporciona pruebas de la manipulación de datos en los datos de tus tablas de ledger. El proceso de verificación de la base de datos toma como entrada uno o más resúmenes de base de datos generados previamente. A continuación, vuelve a calcular los hashes almacenados en el libro mayor de la base de datos en función del estado actual de las tablas del libro mayor. Si los hashes calculados no coinciden con los resúmenes de entrada, se produce un error en la comprobación. El error indica que los datos han sido manipulados. El proceso de verificación informa de todas las inconsistencias que detecta.",
            "guid": "f8d4ffda-8aac-4cc6-b72b-c81cb8625420",
            "id": "H02.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/ledger/ledger-database-verification",
            "severity": "Medio",
            "subcategory": "Integridad",
            "text": "Programe el proceso de verificación de Ledger con regularidad para verificar la integridad de los datos",
            "waf": "Seguridad"
        },
        {
            "category": "Libro mayor",
            "description": "La función Ledger proporciona capacidades de evidencia de manipulación en su base de datos. Puede dar fe criptográficamente a otras partes, como auditores u otras partes comerciales, de que sus datos no han sido manipulados. Ledger ayuda a proteger los datos de cualquier atacante o usuario con muchos privilegios, incluidos los administradores de bases de datos (DBA), los administradores de sistemas y los administradores de la nube.",
            "guid": "2563f498-e2d3-42ea-9e7b-5517881a06a2",
            "id": "H03.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/ledger/ledger-overview",
            "severity": "Medio",
            "subcategory": "Libro mayor",
            "text": "Si la prueba criptográfica de la integridad de los datos es un requisito crítico, se debe considerar la función Ledger",
            "waf": "Seguridad"
        },
        {
            "category": "Libro mayor",
            "description": "Dependiendo del tipo de manipulación, hay casos en los que se puede reparar el libro mayor sin perder datos. En el artículo contenido en la columna --Más Info-- se describen diferentes escenarios y técnicas de recuperación.",
            "guid": "804fc554-6554-4842-91c1-713b32f99902",
            "id": "H04.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/security/ledger/ledger-how-to-recover-after-tampering",
            "severity": "Medio",
            "subcategory": "Recuperación",
            "text": "Preparar un plan de respuesta para investigar y reparar una base de datos después de un evento de manipulación",
            "waf": "Seguridad"
        },
        {
            "category": "Registro",
            "description": "Auditoría de Azure SQL Database realiza un seguimiento de los eventos de la base de datos y los escribe en un registro de auditoría de la cuenta de almacenamiento de Azure. La auditoría le ayuda a comprender la actividad de la base de datos y a obtener información sobre las discrepancias y anomalías que podrían indicar problemas empresariales o presuntas violaciones de seguridad, así como a cumplir con la normativa. De forma predeterminada, la directiva de auditoría incluye todas las acciones (consultas, procedimientos almacenados e inicios de sesión correctos y erróneos) en las bases de datos, lo que puede dar lugar a un gran volumen de registros de auditoría. Se recomienda que los clientes configuren la auditoría para diferentes tipos de acciones y grupos de acciones mediante PowerShell.",
            "guid": "4082e31d-35f4-4a49-8507-d3172cc930a6",
            "id": "I01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/auditing-overview",
            "severity": "Medio",
            "subcategory": "Auditoría",
            "text": "Asegúrese de que la auditoría de Azure SQL Database está habilitada en el nivel de servidor",
            "waf": "Seguridad"
        },
        {
            "category": "Registro",
            "description": "Los registros de auditoría de Azure SQL Database se pueden escribir en cuentas de almacenamiento externas, áreas de trabajo de Log Analytics o Event Hub. Asegúrese de proteger el repositorio de destino mediante copias de seguridad y configuración segura. Use Azure SQL Database Managed Identity para acceder al almacenamiento y establecer un período de retención explícito. No conceda permisos a los administradores para el repositorio de registros de auditoría. Use un almacenamiento de destino diferente para habilitar la auditoría de las operaciones de soporte técnico de Microsoft--. ",
            "guid": "9b64bc50-b60f-4035-bf7a-28c4806dfb46",
            "id": "I01.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/auditing-overview",
            "severity": "Bajo",
            "subcategory": "Auditoría",
            "text": "Asegúrese de que se realiza una copia de seguridad de los registros de auditoría de Azure SQL Database y se protegen en el tipo de repositorio seleccionado",
            "waf": "Seguridad"
        },
        {
            "category": "Registro",
            "description": "El registro de actividad de Azure Monitor es un registro de plataforma en Azure que proporciona información sobre los eventos de nivel de suscripción. El registro de actividad incluye información como cuándo se modifica un recurso. Se recomienda enviar este registro de actividad al mismo repositorio de almacenamiento externo que el registro de auditoría de Azure SQL Database (cuenta de almacenamiento, área de trabajo de Log Analytics, centro de eventos).",
            "guid": "fcd34708-87ac-4efc-aaf6-57a47f76644a",
            "id": "I01.03",
            "link": "https://learn.microsoft.com/azure/azure-monitor/essentials/activity-log",
            "severity": "Medio",
            "subcategory": "Auditoría",
            "text": "Asegúrese de que el registro de actividad de Azure SQL Database se recopila e integra con los registros de auditoría",
            "waf": "Seguridad"
        },
        {
            "category": "Registro",
            "description": "Reenvíe los registros de Azure SQL a la administración de eventos e información de seguridad (SIEM) y a la automatización y respuesta de orquestación de seguridad (SOAR). Asegúrese de que está supervisando los diferentes tipos de recursos de Azure en busca de posibles amenazas y anomalías. Concéntrese en obtener alertas de alta calidad para reducir los falsos positivos que los analistas deben clasificar. Las alertas pueden provenir de datos de registro, agentes u otros datos.",
            "guid": "f96e127e-9572-453a-b325-ff89ae9f6b44",
            "id": "I02.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/auditing-overview",
            "severity": "Medio",
            "subcategory": "SIEM/SOAR",
            "text": "Asegúrese de que los registros de auditoría de Azure SQL Database se presentan en SIEM/SOAR de su organización",
            "waf": "Seguridad"
        },
        {
            "category": "Registro",
            "description": "Reenvíe los registros de Azure SQL a la administración de eventos e información de seguridad (SIEM) y a la automatización y respuesta de orquestación de seguridad (SOAR), que se pueden usar para configurar detecciones de amenazas personalizadas. Asegúrese de que está supervisando los diferentes tipos de recursos de Azure en busca de posibles amenazas y anomalías. Concéntrese en obtener alertas de alta calidad para reducir los falsos positivos que los analistas deben clasificar. Las alertas pueden provenir de datos de registro, agentes u otros datos.",
            "guid": "41503bf8-73da-4a10-af9f-5f7fceb5456f",
            "id": "I02.02",
            "link": "https://learn.microsoft.com/azure/azure-monitor/essentials/activity-log",
            "severity": "Medio",
            "subcategory": "SIEM/SOAR",
            "text": "Asegúrese de que los datos del registro de actividad de Azure SQL Database se presentan en su SIEM/SOAR",
            "waf": "Seguridad"
        },
        {
            "category": "Registro",
            "description": "El equipo del Centro de operaciones de seguridad (SOC) debe crear un plan de respuesta a incidentes (cuadernos de estrategias o respuestas manuales) para investigar y mitigar la manipulación, las actividades maliciosas y otros comportamientos anómalos.",
            "guid": "19ec7c97-c563-4e1d-82f0-54d6ec12e754",
            "id": "I02.03",
            "link": "https://learn.microsoft.com/azure/azure-monitor/essentials/activity-log",
            "severity": "Medio",
            "subcategory": "SIEM/SOAR",
            "text": "Asegúrese de que tiene planes de respuesta para eventos de registro de auditoría malintencionados o aberrantes",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Al crear un servidor lógico desde Azure Portal para Azure SQL Database, el resultado es un punto de conexión público visible y accesible a través de la red pública (acceso público). A continuación, puede limitar la conectividad en función de las reglas de firewall y el punto de conexión de servicio. También puede configurar solo la conectividad privada, limitando las conexiones a las redes internas mediante el punto de conexión privado (acceso privado). El acceso privado mediante un punto de conexión privado debe ser el valor predeterminado, a menos que se aplique un caso de negocio o un motivo técnico o de rendimiento que no lo admita. El uso de puntos de conexión privados tiene implicaciones de rendimiento que deben tenerse en cuenta y evaluarse.",
            "guid": "2c6d356a-1784-475b-a42c-ec187dc8c925",
            "id": "J01.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/network-access-controls-overview",
            "severity": "Alto",
            "subcategory": "Conectividad",
            "text": "Revise los métodos de conectividad de acceso público frente a privado y seleccione el adecuado para la carga de trabajo",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "IMPORTANTE: Las conexiones a terminales privados solo admiten Proxy como política de conexión. Cuando se usan puntos de conexión privados, las conexiones se envían mediante proxy a través de la puerta de enlace de Azure SQL Database a los nodos de la base de datos. Los clientes no tendrán una conexión directa.",
            "guid": "557b3ce5-bada-4296-8d52-a2d447bc1718",
            "id": "J01.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/connectivity-architecture",
            "severity": "Bajo",
            "subcategory": "Conectividad",
            "text": "Mantener la directiva de conexión predeterminada de Azure SQL Database si no se requiere y justifica de manera diferente",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Esta opción configura el firewall para permitir todas las conexiones de Azure, incluidas las conexiones de las suscripciones de otros clientes. Si selecciona esta opción, asegúrese de que sus permisos de inicio de sesión y de usuario limiten el acceso solo a los usuarios autorizados. Si no es estrictamente necesario, mantenga esta configuración en OFF.",
            "guid": "f48efacf-4405-4e8d-9dd0-16c5302ed082",
            "id": "J01.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/network-access-controls-overview",
            "severity": "Alto",
            "subcategory": "Conectividad",
            "text": "Asegúrese de que la opción Permitir que los servicios y recursos de Azure accedan a este servidor esté deshabilitada en el firewall de Azure SQL Database",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Azure SQL Database tiene una nueva característica integrada que permite la integración nativa con puntos de conexión REST externos. Esto significa que la integración de Azure SQL Database con Azure Functions, Azure Logic Apps, Cognitive Services, Event Hubs, Event Grid, Azure Containers, API Management y, en general, cualquier punto de conexión REST o incluso GraphQL. Si no se restringe correctamente, el código dentro de una base de datos de Azure SQL Database podría aprovechar este mecanismo para filtrar datos. Si no es estrictamente necesario, se recomienda bloquear o restringir esta función mediante las reglas de firewall de salida.",
            "guid": "cb3274a7-e36d-46f6-8de5-46d30c8dde8e",
            "id": "J02.01",
            "link": "https://learn.microsoft.com/sql/relational-databases/system-stored-procedures/sp-invoke-external-rest-endpoint-transact-sql",
            "severity": "Medio",
            "subcategory": "Control de salida",
            "text": "Bloquear o restringir las llamadas salientes a la API de REST a puntos de conexión externos",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Las reglas de firewall de salida limitan el tráfico de red desde el servidor lógico de Azure SQL Database a una lista definida por el cliente de cuentas de Azure Storage y servidores lógicos de Azure SQL Database. Se deniega cualquier intento de acceder a cuentas de almacenamiento o bases de datos que no estén en esta lista.",
            "guid": "a566dd3d-314e-4a94-9378-102c42d82b38",
            "id": "J02.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/outbound-firewall-rule-overview",
            "severity": "Medio",
            "subcategory": "Control de salida",
            "text": "Si se requiere acceso a la red de salida, se recomienda configurar las restricciones de red de salida mediante la característica de control integrada de Azure SQL Database",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "El punto de conexión privado se crea dentro de una subred en una red virtual de Azure. La configuración de seguridad adecuada también debe aplicarse al entorno de red contenedor, incluidos NSG/ASG, UDR, firewall, monitoreo y auditoría.",
            "guid": "246cd832-f550-4af0-9c74-ca9baeeb8860",
            "id": "J03.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/private-endpoint-overview?view=azuresql#disable-public-access-to-your-logical-server",
            "severity": "Medio",
            "subcategory": "Acceso privado",
            "text": "Si se usa la conectividad de Private Access, asegúrese de que está usando las listas de comprobación Punto de conexión privado, Red virtual de Azure, Azure Firewall y Grupo de seguridad de red de Azure",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Al agregar una conexión de punto de conexión privado, el enrutamiento público al servidor lógico no se bloquea de forma predeterminada. En el panel --Firewall y redes virtuales-, la opción --Denegar acceso a la red pública-- no está seleccionada de forma predeterminada. Para deshabilitar el acceso a la red pública, asegúrese de seleccionar --Denegar el acceso a la red pública--.",
            "guid": "3a0808ee-ea7a-47ab-bdce-920a6a2b3881",
            "id": "J03.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/private-endpoint-overview?view=azuresql#disable-public-access-to-your-logical-server",
            "severity": "Alto",
            "subcategory": "Acceso privado",
            "text": "Si se usa el punto de conexión privado (acceso privado), considere la posibilidad de deshabilitar la conectividad de acceso público",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "El grupo de seguridad de red (NSG) y el grupo de seguridad de aplicaciones (ASG) ahora se pueden aplicar a la subred que contiene puntos de conexión privados para restringir las conexiones a Azure SQLDB en función de los intervalos IP de origen internos.",
            "guid": "8600527e-e8c4-4424-90ef-1f0dca0224f2",
            "id": "J03.03",
            "link": "https://learn.microsoft.com/azure/private-link/private-endpoint-overview#network-security-of-private-endpoints",
            "severity": "Medio",
            "subcategory": "Acceso privado",
            "text": "Si se usa el punto de conexión privado (acceso privado), aplique NSG y, finalmente, ASG para limitar los intervalos de direcciones IP de origen entrantes",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Una instancia administrada (SQL MI) se puede aislar dentro de una red virtual para evitar el acceso externo. Las aplicaciones y herramientas que se encuentran en la misma red virtual o emparejadas en la misma región podrían acceder a ella directamente. Las aplicaciones y herramientas que se encuentran en diferentes regiones podrían usar la conexión de red virtual a red virtual o el emparejamiento de circuitos ExpressRoute para establecer la conexión. El cliente debe usar grupos de seguridad de red (NSG) y, finalmente, firewalls internos para restringir el acceso a través del puerto 1433 solo a los recursos que requieren acceso a una instancia administrada.",
            "guid": "18123ef4-a0a6-45e3-87fe-7f454f65d975",
            "id": "J03.04",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/connectivity-architecture-overview",
            "severity": "Medio",
            "subcategory": "Acceso privado",
            "text": "Aplicación de grupos de seguridad de red (NSG) y reglas de firewall para restringir el acceso a la subred interna de Azure SQL Managed Instance",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "El punto de conexión de servicio de red virtual de Azure es la solución preferida si desea establecer una conexión directa con los nodos de back-end de Azure SQL Database mediante la directiva de redireccionamiento. Esto permitirá el acceso en modo de alto rendimiento y es el enfoque recomendado desde el punto de vista del rendimiento.",
            "guid": "55187443-6852-4fbd-99c6-ce303597ca7f",
            "id": "J04.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/network-access-controls-overview?view=azuresql#ip-vs-virtual-network-firewall-rules",
            "severity": "Alto",
            "subcategory": "Acceso público",
            "text": "Si se usa la conectividad de acceso público, aproveche el punto de conexión de servicio para restringir el acceso desde las redes virtuales de Azure seleccionadas",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "El firewall de Azure SQL Database permite especificar intervalos de direcciones IP desde los que se aceptan comunicaciones. Este enfoque es adecuado para direcciones IP estables que están fuera de la red privada de Azure.",
            "guid": "a73e32da-b3f4-4960-b5ec-2f42a557bf31",
            "id": "J04.02",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/network-access-controls-overview",
            "severity": "Medio",
            "subcategory": "Acceso público",
            "text": "Si se utiliza la conectividad de acceso público, asegúrese de que solo se agreguen direcciones IP conocidas específicas al firewall",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Le recomendamos que utilice reglas de firewall de IP a nivel de base de datos siempre que sea posible. Esta práctica mejora la seguridad y hace que su base de datos sea más portátil. Utilice reglas de firewall de IP de nivel de servidor para los administradores. Úselos también cuando tenga muchas bases de datos que tengan los mismos requisitos de acceso y no desee configurar cada base de datos individualmente.",
            "guid": "e0f31ac9-35c8-4bfd-9865-edb60ffc6768",
            "id": "J04.03",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/firewall-configure",
            "severity": "Bajo",
            "subcategory": "Acceso público",
            "text": "Si las reglas de firewall de Azure SQL Database usan y controlan la conectividad de acceso público, use reglas de IP de nivel de base de datos en lugar de reglas de IP de nivel de servidor",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Una instancia administrada (SQL MI) se puede aislar dentro de una red virtual para evitar el acceso externo. El punto de conexión público de Managed Instance no está habilitado de forma predeterminada, debe habilitarse explícitamente, solo si es estrictamente necesario. Si la directiva de la empresa no permite el uso de puntos de conexión públicos, use Azure Policy para evitar la habilitación de puntos de conexión públicos en primer lugar.",
            "guid": "b8435656-143e-41a8-9922-61d34edb751a",
            "id": "J04.04",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/public-endpoint-overview",
            "severity": "Alto",
            "subcategory": "Acceso público",
            "text": "No habilitar el punto de conexión público de Azure SQL Managed Instance",
            "waf": "Seguridad"
        },
        {
            "category": "Gestión de redes",
            "description": "Un punto de conexión público de Managed Instance (SQL MI) no está habilitado de forma predeterminada, debe estar habilitado explícitamente, solo si es estrictamente necesario. En este caso, se recomienda aplicar grupos de seguridad de red (NSG) para restringir el acceso al puerto 3342 solo a las direcciones IP de origen de confianza.",
            "guid": "057dd298-8726-4aa6-b590-1f81d2e30421",
            "id": "J04.05",
            "link": "https://learn.microsoft.com/azure/azure-sql/managed-instance/public-endpoint-overview",
            "severity": "Alto",
            "subcategory": "Acceso público",
            "text": "Restrinja el acceso si se requiere el punto de conexión público de Azure SQL Managed Instance",
            "waf": "Seguridad"
        },
        {
            "category": "Acceso privilegiado",
            "description": "La mayoría de las operaciones, el soporte técnico y la solución de problemas realizados por el personal y los subprocesadores de Microsoft no requieren acceso a los datos del cliente. En las raras circunstancias en las que se requiere dicho acceso, Caja de seguridad del cliente para Microsoft Azure proporciona una interfaz para que los clientes revisen y aprueben o rechacen las solicitudes de acceso a los datos del cliente.  En escenarios de soporte técnico en los que Microsoft necesita acceder a los datos de los clientes, Azure SQL Database admite la Caja de seguridad del cliente para proporcionar una interfaz para revisar y aprobar o rechazar las solicitudes de acceso a los datos de los clientes.",
            "guid": "37b6eb0f-553d-488f-8a8a-cb9bf97388ff",
            "id": "K01.01",
            "link": "https://learn.microsoft.com/azure/security/fundamentals/customer-lockbox-overview",
            "severity": "Bajo",
            "subcategory": "Caja",
            "text": "Revise y habilite la casilla de seguridad del cliente para el acceso a Azure SQL Database por parte del personal de Microsoft",
            "waf": "Seguridad"
        },
        {
            "category": "Acceso privilegiado",
            "description": "El principio de privilegios mínimos establece que los usuarios no deben tener más privilegios de los necesarios para completar sus tareas. Los usuarios de bases de datos y servidores con privilegios elevados pueden realizar muchas actividades de configuración y mantenimiento en la base de datos y también pueden quitar bases de datos en la instancia de Azure SQL. El seguimiento de los propietarios de bases de datos y las cuentas privilegiadas es importante para evitar tener permisos excesivos.",
            "guid": "5fe5281f-f0f9-4842-a682-8baf18bd8316",
            "id": "K02.01",
            "link": "https://learn.microsoft.com/azure/azure-sql/database/security-best-practice?view=azuresql#implement-principle-of-least-privilege",
            "severity": "Medio",
            "subcategory": "Permisos",
            "text": "Garantizar que a los usuarios se les asigne el nivel mínimo de acceso necesario para completar sus funciones laborales",
            "waf": "Seguridad"
        },
        {
            "category": "Acceso privilegiado",
            "description": "Las identidades (tanto los usuarios como los SPN) deben limitarse a la menor cantidad de acceso necesaria para realizar la función.  Se debe usar un mayor número de SPN de ámbito estricto, en lugar de tener una SPN con varios conjuntos de permisos no relacionados. Por ejemplo, si hay tres aplicaciones web externas hospedadas localmente que realizan consultas a Azure SQL Database, no todas deben usar el mismo SPN para estas actividades.  En su lugar, cada uno debe tener su propio SPN de ámbito estricto.",
            "guid": "7b5b55e5-4750-4920-be97-eb726c256a5c",
            "id": "K02.02",
            "link": "https://learn.microsoft.com/security/benchmark/azure/baselines/sql-database-security-baseline#im-3-use-azure-ad-single-sign-on-sso-for-application-access",
            "severity": "Bajo",
            "subcategory": "Permisos",
            "text": "Asegúrese de que a las distintas aplicaciones se les asignarán diferentes credenciales con permisos mínimos para acceder a Azure SQL Database",
            "waf": "Seguridad"
        }
    ],
    "metadata": {
        "name": "Azure SQLDB Security Checklist (Preview)",
        "state": "Preview",
        "timestamp": "October 23, 2024"
    },
    "severities": [
        {
            "name": "Alto"
        },
        {
            "name": "Medio"
        },
        {
            "name": "Bajo"
        }
    ],
    "status": [
        {
            "description": "Esta comprobación aún no se ha examinado",
            "name": "No verificado"
        },
        {
            "description": "Hay un elemento de acción asociado a esta comprobación",
            "name": "Abrir"
        },
        {
            "description": "Esta comprobación se ha verificado y no hay más elementos de acción asociados a ella",
            "name": "Cumplido"
        },
        {
            "description": "Recomendación comprendida, pero no necesaria por los requisitos actuales",
            "name": "No es necesario"
        },
        {
            "description": "No aplicable para el diseño actual",
            "name": "N/A"
        }
    ],
    "waf": [
        {
            "name": "Fiabilidad"
        },
        {
            "name": "Seguridad"
        },
        {
            "name": "Costar"
        },
        {
            "name": "Operaciones"
        },
        {
            "name": "Rendimiento"
        }
    ],
    "yesno": [
        {
            "name": "Sí"
        },
        {
            "name": "No"
        }
    ]
}