{
    "items": [
        {
            "waf": "reliability",
            "service": "Azure Firewall",
            "text": "Deploy Azure Firewall in hub virtual networks or as part of Azure Virtual WAN hubs.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "reliability",
            "service": "Azure Firewall",
            "text": "Leverage Availability Zones resiliency.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "reliability",
            "service": "Azure Firewall",
            "text": "Create Azure Firewall Policy structure.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "reliability",
            "service": "Azure Firewall",
            "text": "Review the Known Issue list.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "reliability",
            "service": "Azure Firewall",
            "text": "Monitor Azure Firewall health state.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Reliability",
            "service": "Azure Firewall",
            "text": "Use Azure Firewall Manager with traditional Hub & Spokes or Azure Virtual WAN network topologies to deploy and manage instances of Azure Firewall.",
            "description": "Easily create hub-and-spoke and transitive architectures with native security services for traffic governance and protection.  For more information on network topologies, see the Azure Cloud Adoption Framework documentation.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Firewall",
            "text": "Create Azure Firewall Policies to govern the security posture across global network environments. Assign policies to all instances of Azure Firewall.",
            "description": "Azure Firewall Policies can be arranged in an hierarchical structure to overlay a central base policy. Allow for granular policies to meet the requirements of specific regions. Delegate incremental firewall policies to local security teams through role-based access control (RBAC). Some settings are specific per instance, for example DNAT Rules and DNS configuration, then multiple specialized policies might be required.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Firewall",
            "text": "Migrate Azure Firewall Classic Rules to Azure Firewall Manager Policies for existing deployments.",
            "description": "For existing deployments, migrate Azure Firewall rules to Azure Firewall Manager policies. Use Azure Firewall Manager to centrally manage your firewalls and policies.  For more information, see Migrate to Azure Firewall Premium.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Firewall",
            "text": "Review the list of Azure Firewall Known Issues.",
            "description": "Azure Firewall Product Group maintains an updated list of known-issues at this location. This list contains important information related to by-design behavior, fixes under construction, platform limitations, along with possible workarounds or mitigation.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Firewall",
            "text": "Ensure your Azure Firewall Policy adheres to Azure Firewall limits and recommendations.",
            "description": "There are limits on the policy structure, including numbers of Rules and Rule Collection Groups, total policy size, source/target destinations. Be sure to compose your policy and stay behind the documented thresholds.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Firewall",
            "text": "Deploy Azure Firewall across multiple availability zones for higher service-level agreement (SLA).",
            "description": "Azure Firewall provides different SLAs when it's deployed in a single availability zone and when it's deployed in multiple zones. For more information, see SLA for Azure Firewall. For information about all Azure SLAs, see SLA summary for Azure services.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Firewall",
            "text": "In multi-region environments, deploy an Azure Firewall instance per region.",
            "description": "For traditional Hub & Spokes architectures, multi-region details are explained in this article. For secured virtual hubs (Azure Virtual WAN), Routing Intent and Policies must be configured to secure inter-hub and branch-to-branch communications. For workloads designed to be resistant to failures and fault tolerant, remember to consider that instances of Azure Firewall and Azure Virtual Network as regional resources.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Firewall",
            "text": "Monitor Azure Firewall Metrics and Resource Health state.",
            "description": "Closely monitor key metrics indicator of Azure Firewall health state such as Throughput, Firewall health state, SNAT port utilization and AZFW Latency Probe metrics. Additionally, Azure Firewall now integrates with Azure Resource Health. With the Azure Firewall Resource Health check, you can now view the health status of your Azure Firewall and address service problems that might affect your Azure Firewall resource.",
            "type": "recommendation"
        },
        {
            "waf": "security",
            "service": "Azure Firewall",
            "text": "Determine if you need Forced Tunneling.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Firewall",
            "text": "Create rules for Policies based on least privilege access criteria.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Firewall",
            "text": "Leverage Threat Intelligence.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Firewall",
            "text": "Enable Azure Firewall DNS proxy.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Firewall",
            "text": "Direct network traffic through Azure Firewall.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Firewall",
            "text": "Determine if you want to use third-party security as a service (SECaaS) providers.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Firewall",
            "text": "Protect your Azure Firewall public IP addresses with DDoS.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "If required to route all internet-bound traffic to a designated next hop instead of going directly to the internet, configure Azure Firewall in forced tunneling mode (does not apply to Azure Virtual WAN).",
            "description": "Azure Firewall must have direct internet connectivity. If your AzureFirewallSubnet learns a default route to your on-premises network via the Border Gateway Protocol, you must configure Azure Firewall in the forced tunneling mode. Using the forced tunneling feature, you'll need another /26 address space for the Azure Firewall Management subnet. You're required to name it AzureFirewallManagementSubnet.If this is an existing Azure Firewall instance that can't be reconfigured in the forced tunneling mode, create a UDR with a 0.0.0.0/0 route. Set the NextHopType value as Internet. Associate it with AzureFirewallSubnet to maintain internet connectivity.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Set the public IP address to None to deploy a fully private data plane when you configure Azure Firewall in the forced tunneling mode (does not apply to Azure Virtual WAN).",
            "description": "When you deploy a new Azure Firewall instance, if you enable the forced tunneling mode, you can set the public IP address to None to deploy a fully private data plane. However, the management plane still requires a public IP for management purposes only. The internal traffic from virtual and on-premises networks won't use that public IP. For more about forced tunneling, see Azure Firewall forced tunneling.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Create rules for Firewall Policies based on least privilege access criteria.",
            "description": "Azure Firewall Policies can be arranged in an hierarchical structure to overlay a central base policy. Allow for granular policies to meet the requirements of specific regions. Each policy can contains different sets of DNAT, Network and Application rules with specific priority, action and processing order. Create your rules based on least privilege access Zero Trust principle . How rules are processed is explained in this article.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Enable IDPS in  Alert or Alert and deny mode.",
            "description": "IDPS is one of the most powerful Azure Firewall (Premium) security features and should be enabled. Based on security and application requirements, and considering the performance impact (see the Cost section below), Alert or Alert and deny modes can be selected.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Enable Azure Firewall (DNS) proxy configuration.",
            "description": "Enabling this feature points clients in the VNets to Azure Firewall as a DNS server. It will protect internal DNS infrastructure that will not be directly accessed and exposed. Azure Firewall must be also configured to use custom DNS that will be used to forward DNS queries.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Configure user-defined routes (UDR) to force traffic through Azure Firewall.",
            "description": "In a traditional Hub & Spokes architecture, configure UDRs to force traffic through Azure Firewall for `SpoketoSpoke`, `SpoketoInternet`, and `SpoketoHybrid` connectivity. In Azure Virtual WAN, instead, configure Routing Intent and Policies to redirect private and/or Internet traffic through the Azure Firewall instance integrated into the hub.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "If not possible to apply UDR, and only web traffic redirection is required, consider using Azure Firewall as an Explicit Proxy",
            "description": "With explicit proxy feature enabled on the outbound path, you can configure a proxy setting on the sending web application (such as a web browser) with Azure Firewall configured as the proxy. As a result, web traffic will reach the firewall's private IP address and therefore egresses directly from the firewall without using a UDR. This feature also facilitates the usage of multiple firewalls without modifying existing network routes.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Configure supported third-party software as a service (SaaS) security providers within Firewall Manager if you want to use these solutions to protect outbound connections.",
            "description": "You can use your familiar, best-in-breed, third-party SECaaS offerings to protect internet access for your users. This scenario does require Azure Virtual WAN with a S2S VPN Gateway in the Hub, as it uses an IPSec tunnel to connect to the provider's infrastructure. SECaaS providers might charge additional license fees and limit throughput on IPSec connections. Alternative solutions such as ZScaler Cloud Connector exist and might be more suitable.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Use Fully Qualified Domain Name (FQDN) filtering in network rules.",
            "description": "You can use FQDN based on DNS resolution in Azure Firewall and firewall policies. This capability allows you to filter outbound traffic with any TCP/UDP protocol (including NTP, SSH, RDP, and more). You must enable the Azure Firewall DNS Proxy configuration to use FQDNs in your network rules. To learn how it works, see Azure Firewall FQDN filtering in network rules.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Use Service Tags in Network Rules to enable selective access to specific Microsoft services.",
            "description": "A service tag represents a group of IP address prefixes to help minimize complexity for security rule creation. Using Service Tags in Network Rules, it is possible to enable outbound access to specific services in Azure, Dynamics and Office 365 without opening wide ranges of IP addresses. Azure will maintain automatically the mapping between these tags and underlying IP addresses used by each service. The list of Service Tags available to Azure Firewall are listed here: Az Firewall Service Tags.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Use FQDN Tags in Application Rules to enable selective access to specific Microsoft services.",
            "description": "An FQDN tag represents a group of fully qualified domain names (FQDNs) associated with well known Microsoft services. You can use an FQDN tag in application rules to allow the required outbound network traffic through your firewall for some specific Azure services, Office 365, Windows 365 and Intune.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Use Azure Firewall Manager to create and associate a DDoS protection plan with your hub virtual network (does not apply to Azure Virtual WAN).",
            "description": "A DDoS protection plan provides enhanced mitigation features to defend your firewall from DDoS attacks. Azure Firewall Manager is an integrated tool to create your firewall infrastructure and DDoS protection plans. For more information, see Configure an Azure DDoS Protection Plan using Azure Firewall Manager.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Use an Enterprise PKI to generate certificates for TLS Inspection.",
            "description": "With Azure Firewall Premium, if TLS Inspection feature is used, it is recommended to leverage an internal Enterprise Certification Authority (CA) for production environment. Self-signed certificates should be used for testing/PoC purposes only.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Firewall",
            "text": "Review Zero-Trust configuration guide for Azure Firewall and Application Gateway",
            "description": "If your security requirements necessitate implementing a Zero-Trust approach for web applications (inspection and encryption), it is recommended to follow this guide. In this document, how to integrate together Azure Firewall and Application Gateway will be explained, in both traditional Hub & Spoke and Virtual WAN scenarios.",
            "type": "recommendation"
        },
        {
            "waf": "cost",
            "service": "Azure Firewall",
            "text": "Select the Azure Firewall SKU to deploy.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "cost",
            "service": "Azure Firewall",
            "text": "Determine if some instances don't need permanent 24x7 allocation.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "cost",
            "service": "Azure Firewall",
            "text": "Determine where you can optimize firewall use across workloads.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "cost",
            "service": "Azure Firewall",
            "text": "Monitor and optimize firewall instances usage to determine cost-effectiveness.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "cost",
            "service": "Azure Firewall",
            "text": "Review and optimize the number of public IP addresses required and Policies used.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "cost",
            "service": "Azure Firewall",
            "text": "Review logging requirements, estimate cost and control over time.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Cost",
            "service": "Azure Firewall",
            "text": "Deploy the proper Azure Firewall SKU.",
            "description": "Azure Firewall can be deployed in three different SKUs: Basic, Standard and Premium. Azure Firewall Premium is recommended to secure highly sensitive applications (such as payment processing). Azure Firewall Standard is recommended for customers looking for Layer 3–Layer 7 firewall and needs autoscaling to handle peak traffic periods of up to 30 Gbps. Azure Firewall Basic is recommended for SMB customers with throughput needs of 250 Mbps. If required, downgrade or upgrade is possible between Standard and Premium as documented here.   For more information, see Choose the right Azure Firewall SKU to meet your needs.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Firewall",
            "text": "Stop Azure Firewall deployments that don't need to run for 24x7.",
            "description": "You might have development or testing environments that are used only during business hours. For more information, see Deallocate and allocate Azure Firewall.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Firewall",
            "text": "Share the same instance of Azure Firewall across multiple workloads and Azure Virtual Networks.",
            "description": "You can use a central instance of Azure Firewall in the hub virtual network or Virtual WAN secure hub and share the same firewall across many spoke virtual networks that are connected to the same hub from the same region. Ensure there's no unexpected cross-region traffic as part of the hub-spoke topology.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Firewall",
            "text": "Regularly review traffic processed by Azure Firewall and look for originating workload optimizations",
            "description": "Top Flows log (known in the industry as Fat Flows), shows the top connections that are contributing to the highest throughput through the firewall. It is recommended to regularly review traffic processed by the Azure Firewall and search for possible optimizations to reduce the amount of traffic traversing the firewall.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Firewall",
            "text": "Review under-utilized Azure Firewall instances. Identify and delete unused Azure Firewall deployments.",
            "description": "To identify unused Azure Firewall deployments, start by analyzing the monitoring metrics and UDRs associated with subnets pointing to the firewall's private IP. Combine that information with other validations, such as if your instance of Azure Firewall has any rules (classic) for NAT, Network and Application, or even if the DNS Proxy setting is configured to Disabled, and with internal documentation about your environment and deployments. You can detect deployments that are cost-effective over time.  For more information about monitoring logs and metrics, see Monitor Azure Firewall logs and metrics and SNAT port utilization.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Firewall",
            "text": "Use Azure Firewall Manager and its Policies to reduce operational costs, increase efficiency, and reduce management overhead.",
            "description": "Review your Firewall Manager policies, associations, and inheritance carefully. Policies are billed based on firewall associations. A policy with zero or one firewall association is free of charge. A policy with multiple firewall associations is billed at a fixed rate.For more information, see Pricing - Azure Firewall Manager.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Firewall",
            "text": "Delete unused public IP addresses.",
            "description": "Validate whether all the associated public IP addresses are in use. If they aren't in use, disassociate and delete them. Evaluate SNAT port utilization before removing any IP addresses.You'll only use the number of public IPs your firewall needs. For more information, see Monitor Azure Firewall logs and metrics and SNAT port utilization.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Firewall",
            "text": "Review logging requirements.",
            "description": "Azure Firewall has the ability to comprehensively log metadata of all traffic it sees, to Log Analytics Workspaces, Storage or third party solutions through Event Hubs. However, all logging solutions incur costs for data processing and storage. At very large volumes these costs can be significant, a cost effective approach and alternative to Log Analytics should be considered and cost estimated. Consider whether it is required to log traffic metadata for all logging categories and modify in Diagnostic Settings if needed.",
            "type": "recommendation"
        },
        {
            "waf": "operations",
            "service": "Azure Firewall",
            "text": "Maintain inventory and backup of Azure Firewall configuration and Policies.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Firewall",
            "text": "Leverage diagnostic logs for firewall monitoring and troubleshooting.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Firewall",
            "text": "Leverage Azure Firewall Monitoring workbook.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Firewall",
            "text": "Regularly review your Policy insights and analytics.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Firewall",
            "text": "Integrate Azure Firewall with Microsoft Defender for Cloud and Microsoft Sentinel.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Operations",
            "service": "Azure Firewall",
            "text": "Do not use Azure Firewall for intra-VNet traffic control.",
            "description": "Azure Firewall should be used to control traffic across VNets, between VNets and on-premises networks, outbound traffic to the Internet and incoming non-HTTP/s traffic. For intra-VNet traffic control, it is recommended to use Network Security Groups.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Firewall",
            "text": "Maintain regular backups of Azure Policy artifacts.",
            "description": "If Infrastructure-as-Code (IaC) approach is used to maintain Azure Firewall and all dependencies then backup and versioning of Azure Firewall Policies should be already in place. If not, a companion mechanism based on external Logic App can be deployed to automate and provide an effective solution.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Firewall",
            "text": "Enable Diagnostic Logs for Azure Firewall.",
            "description": "Diagnostic Logs is a key component for many monitoring tools and strategies for Azure Firewall and should be enabled. You can monitor Azure Firewall by using firewall logs or workbooks. You can also use activity logs for auditing operations on Azure Firewall resources.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Firewall",
            "text": "Use Structured Firewall Logs format.",
            "description": "Structured Firewall Logs are a type of log data that are organized in a specific new format. They use a predefined schema to structure log data in a way that makes it easy to search, filter, and analyze. The latest monitoring tools are based on this type of logs hence it is often a pre-requisite. Use the previous Diagnostic Logs format only if there is an existing tool with a pre-requisite on that. Do not enable both logging formats at the same time.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Firewall",
            "text": "Use the built-in Azure Firewall Monitoring Workbook.",
            "description": "Azure Firewall portal experience now includes a new workbook under the Monitoring section UI, a separate installation is no more required. With the Azure Firewall Workbook, you can extract valuable insights from Azure Firewall events, delve into your application and network rules, and examine statistics regarding firewall activities across URLs, ports, and addresses.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Firewall",
            "text": "Monitor key metrics and create alerts for indicators of the utilization of Azure Firewall capacity.",
            "description": "Alerts should be created to monitor at least Throughput, Firewall health state, SNAT port utilization and AZFW Latency Probe metrics.For information about monitoring logs and metrics, see Monitor Azure Firewall logs and metrics.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Firewall",
            "text": "Configure Azure Firewall integration with Microsoft Defender for Cloud and Microsoft Sentinel.",
            "description": "If these tools are available in the environment, it is recommended to leverage integration with Microsoft Defender for Cloud and Microsoft Sentinel solutions. With Microsoft Defender for Cloud integration, you can visualize the all-up status of network infrastructure and network security in one place, including Azure Network Security across all VNets and Virtual Hubs spread across different regions in Azure. Integration with Microsoft Sentinel provides threat detection and prevention capabilities.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Firewall",
            "text": "Regularly review Policy Analytics dashboard to identify potential issues.",
            "description": "Policy Analytics is a new feature that provides insights into the impact of your Azure Firewall policies. It helps you identify potential issues (hitting policy limits, low utilization rules, redundant rules, rules too generic, IP Groups usage recommendation) in your policies and provides recommendations to improve your security posture and rule processing performance.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Firewall",
            "text": "Become familiar with KQL (Kusto Query Language) queries to allow quick analysis and troubleshooting using Azure Firewall logs.",
            "description": "Sample queries are provided for Azure Firewall. Those will enable you to quickly identify what's happening inside your firewall and check to see which rule was triggered, or which rule is allowing/blocking a request.",
            "type": "recommendation"
        },
        {
            "waf": "performance",
            "service": "Azure Firewall",
            "text": "Regularly review and optimize firewall rules.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "performance",
            "service": "Azure Firewall",
            "text": "Review policy requirements and opportunities to summarize IP ranges and URLs list.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "performance",
            "service": "Azure Firewall",
            "text": "Assess your SNAT port requirements.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "performance",
            "service": "Azure Firewall",
            "text": "Plan load tests to test auto-scale performance in your environment.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "performance",
            "service": "Azure Firewall",
            "text": "Do not enable diagnostic tools and logging if not required.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Performance",
            "service": "Azure Firewall",
            "text": "Use Policy Analytics dashboard to identify potential optimizations for Firewall Policies.",
            "description": "Policy Analytics is a new feature that provides insights into the impact of your Azure Firewall policies. It helps you identify potential issues (hitting policy limits, low utilization rules, redundant rules, rules too generic, IP Groups usage recommendation) in your policies and provides recommendations to improve your security posture and rule processing performance.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Firewall",
            "text": "Consider Web Categories to allow or deny outbound access in bulk.",
            "description": "Instead of explicitly building and maintaining a long list of public Internet sites, consider the usage of Azure Firewall Web Categories. This feature will dynamically categorize web content and will permit the creation of compact Application Rules.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Firewall",
            "text": "Evaluate the performance impact of IDPS in Alert and deny mode.",
            "description": "If Azure Firewall is required to operate in IDPS mode Alert and deny, carefully consider the performance impact as documented in this page.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Firewall",
            "text": "Assess potential SNAT port exhaustion problem.",
            "description": "Azure Firewall currently supports 2496 ports per Public IP address per backend Virtual Machine Scale Set instance. By default, there are two Virtual Machine Scale Set instances. So, there are 4992 ports per flow destination IP, destination port and protocol (TCP or UDP). The firewall scales up to a maximum of 20 instances. You can work around the limits by configuring Azure Firewall deployments with a minimum of five public IP addresses for deployments susceptible to SNAT exhaustion.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Firewall",
            "text": "Properly warm up Azure Firewall before any performance test.",
            "description": "Create initial traffic that isn't part of your load tests 20 minutes before the test. Use diagnostics settings to capture scale-up and scale-down events. You can use the Azure Load Testing service to generate the initial traffic. Allows the Azure Firewall instance to scale up its instances to the maximum.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Firewall",
            "text": "Configure an Azure Firewall subnet (AzureFirewallSubnet) with a /26 address space.",
            "description": "Azure Firewall is a dedicated deployment in your virtual network. Within your virtual network, a dedicated subnet is required for the instance of Azure Firewall. Azure Firewall provisions more capacity as it scales.A /26 address space for its subnets ensures that the firewall has enough IP addresses available to accommodate the scaling. Azure Firewall doesn't need a subnet bigger than /26. The Azure Firewall subnet name must be AzureFirewallSubnet.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Firewall",
            "text": "Do not enable advanced logging if not required",
            "description": "Azure Firewall provides some advanced logging capabilities that can be expensive to maintain always active. Instead, they should be used for troubleshooting purposes only, and limited in duration, then disabled when no more necessary. For example, Top flows and Flow trace logs are expensive can cause excessive CPU and storage usage on the Azure Firewall infrastructure.",
            "type": "recommendation"
        },
        {
            "waf": "reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: For critical workloads, use availability zones for your AKS clusters.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Plan the IP address space to ensure your cluster can reliably scale, including handling of failover traffic in multi-cluster topologies.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Enable Container insights to monitor your cluster and configure alerts for reliability-impacting events.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "reliability",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Ensure workloads are built to support horizontal scaling and report application readiness and health.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Ensure your workload is running on user node pools and chose the right size SKU. At a minimum, include two nodes for user node pools and three nodes for the system node pool.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use the AKS Uptime SLA to meet availability targets for production workloads.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Control pod scheduling using node selectors and affinity.",
            "description": "Allows the Kubernetes scheduler to logically isolate workloads by hardware in the node. Unlike tolerations, pods without a matching node selector can be scheduled on labeled nodes, which allows unused resources on the nodes to consume, but gives priority to pods that define the matching node selector. Use node affinity for more flexibility, which allows you to define what happens if the pod can't be matched with a node.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Ensure proper selection of network plugin based on network requirements and cluster sizing.",
            "description": "Azure CNI is required for specific scenarios, for example, Windows-based node pools, specific networking requirements and Kubernetes Network Policies. Reference Kubenet versus Azure CNI for more information.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Use the AKS Uptime SLA for production grade clusters.",
            "description": "The AKS Uptime SLA guarantees: - `99.95%` availability of the Kubernetes API server endpoint for AKS Clusters that use Azure Availability Zones, or  - `99.9%` availability for AKS Clusters that don't use Azure Availability Zones.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Configure monitoring of cluster with Container insights.",
            "description": "Container insights help monitor the health and performance of controllers, nodes, and containers that are available in Kubernetes through the Metrics API. Integration with Prometheus enables collection of application and workload metrics.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use availability zones to maximize resilience within an Azure region by distributing AKS agent nodes across physically separate data centers.",
            "description": "By spreading node pools across multiple zones, nodes in one node pool will continue running even if another zone has gone down. If colocality requirements exist, either a regular VMSS-based AKS deployment into a single zone or proximity placement groups can be used to minimize internode latency.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Adopt a multiregion strategy by deploying AKS clusters deployed across different Azure regions to maximize availability and provide business continuity.",
            "description": "Internet facing workloads should leverage Azure Front Door or Azure Traffic Manager to route traffic globally across AKS clusters.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Define Pod resource requests and limits in application deployment manifests, and enforce with Azure Policy.",
            "description": "Container CPU and memory resource limits are necessary to prevent resource exhaustion in your Kubernetes cluster.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Keep the System node pool isolated from application workloads.",
            "description": "System node pools require a VM SKU of at least 2 vCPUs and 4 GB memory, but 4 vCPU or more is recommended. Reference System and user node pools for detailed requirements.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Separate applications to dedicated node pools based on specific requirements.",
            "description": "Applications may share the same configuration and need GPU-enabled VMs, CPU or memory optimized VMs, or the ability to scale-to-zero. Avoid large number of node pools to reduce extra management overhead.",
            "type": "recommendation"
        },
        {
            "waf": "Reliability",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use a NAT gateway for clusters that run workloads that make many concurrent outbound connections.",
            "description": "To avoid reliability issues with Azure Load Balancer limitations with high concurrent outbound traffic, us a NAT Gateway instead to support reliable egress traffic at scale.",
            "type": "recommendation"
        },
        {
            "waf": "security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use Managed Identities to avoid managing and rotating service principles.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use Kubernetes role-based access control (RBAC) with Microsoft Entra ID for least privilege access and minimize granting administrator privileges to protect configuration, and secrets access.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use Microsoft Defender for containers with Azure Sentinel to detect and quickly respond to threats across your cluster and workloads running on them.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Deploy a private AKS cluster to ensure cluster management traffic to your API server remains on your private network. Or use the API server allow list for non-private clusters.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Use a Web Application Firewall to secure HTTP(S) traffic.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "security",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Ensure your CI/CID pipeline is hardened with container-aware scanning.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use Microsoft Entra integration.",
            "description": "Using Microsoft Entra ID centralizes the identity management component. Any change in user account or group status is automatically updated in access to the AKS cluster. The developers and application owners of your Kubernetes cluster need access to different resources.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Authenticate with Microsoft Entra ID to Azure Container Registry.",
            "description": "AKS and Microsoft Entra ID enables authentication with Azure Container Registry without the use of `imagePullSecrets` secrets. Review Authenticate with Azure Container Registry from Azure Kubernetes Service for more information.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Secure network traffic to your API server with private AKS cluster.",
            "description": "By default, network traffic between your node pools and the API server travels the Microsoft backbone network; by using a private cluster, you can ensure network traffic to your API server remains on the private network only.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: For non-private AKS clusters, use API server authorized IP ranges.",
            "description": "When using public clusters, you can still limit the traffic that can reach your clusters API server by using the authorized IP range feature. Include sources like the public IPs of your deployment build agents, operations management, and node pools' egress point (such as Azure Firewall).",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Protect the API server with Microsoft Entra RBAC.",
            "description": "Securing access to the Kubernetes API Server is one of the most important things you can do to secure your cluster. Integrate Kubernetes role-based access control (RBAC) with Microsoft Entra ID to control access to the API server. Disable local accounts to enforce all cluster access using Microsoft Entra ID-based identities.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use Azure network policies or Calico.",
            "description": "Secure and control network traffic between pods in a cluster.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Secure clusters and pods with Azure Policy.",
            "description": "Azure Policy can help to apply at-scale enforcement and safeguards on your clusters in a centralized, consistent manner. It can also control what functions pods are granted and if anything is running against company policy.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Secure container access to resources.",
            "description": "Limit access to actions that containers can perform. Provide the least number of permissions, and avoid the use of root or privileged escalation.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Use a Web Application Firewall to secure HTTP(S) traffic.",
            "description": "To scan incoming traffic for potential attacks, use a web application firewall such as Azure Web Application Firewall (WAF) on Azure Application Gateway or Azure Front Door.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Control cluster egress traffic.",
            "description": "Ensure your cluster's outbound traffic is passing through a network security point such as Azure Firewall or an HTTP proxy.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use the open-source Microsoft Entra Workload ID and Secrets Store CSI Driver with Azure Key Vault.",
            "description": "Protect and rotate secrets, certificates, and connection strings in Azure Key Vault with strong encryption. Provides an access audit log, and keeps core secrets out of the deployment pipeline.",
            "type": "recommendation"
        },
        {
            "waf": "Security",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use Microsoft Defender for Containers.",
            "description": "Monitor and maintain the security of your clusters, containers, and their applications.",
            "type": "recommendation"
        },
        {
            "waf": "cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use appropriate VM SKU per node pool and reserved instances where long-term capacity is expected.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Use appropriate managed disk tier and size.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Review performance metrics, starting with CPU, memory, storage, and network, to identify cost optimization opportunities by cluster, nodes, and namespace.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architecture: Use autoscalers to scale in when workloads are less active.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Align SKU selection and managed disk size with workload requirements.",
            "description": "Matching your selection to your workload demands ensures you don't pay for unneeded resources.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Select the right virtual machine instance type.",
            "description": "Selecting the right virtual machine instance type is critical as it directly impacts the cost of running applications on AKS. Choosing a high-performance instance without proper utilization can lead to wasteful spending, while choosing a powerful instance can lead to performance issues and increased downtime. To determine the right virtual machine instance type, consider workload characteristics, resource requirements, and availability needs.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Select virtual machines based on the Arm architecture.",
            "description": "AKS supports creating ARM64 Ubuntu agent nodes, as well as a of mix Intel and ARM architecture nodes within a cluster that can bring better performance at a lower cost.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Select Azure Spot Virtual Machines.",
            "description": "Spot VMs allow you to take advantage of unutilized Azure capacity with significant discounts (up to 90% as compared to pay-as-you-go prices). If Azure needs capacity back, the Azure infrastructure evicts the Spot nodes.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Select the appropriate region.",
            "description": "Due to many factors, cost of resources varies per region in Azure. Evaluate the cost, latency, and compliance requirements to ensure you are running your workload cost-effectively and it doesn't affect your end-users or create extra networking charges.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Maintain small and optimized images.",
            "description": "Streamlining your images helps reduce costs since new nodes need to download these images. Build images in a way that allows the container start as soon as possible to help avoid user request failures or timeouts while the application is starting up, potentially leading to overprovisioning.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Enable Cluster Autoscaler to automatically reduce the number of agent nodes in response to excess resource capacity.",
            "description": "Automatically scaling down the number of nodes in your AKS cluster lets you run an efficient cluster when demand is low and scale up when demand returns.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Enable Node Autoprovision to automate VM SKU selection.",
            "description": "Node Autoprovision simplifies the SKU selection process and decides, based on pending pod resource requirements, the optimal VM configuration to run workloads in the most efficient and cost effective manner.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Use the Horizontal Pod Autoscaler.",
            "description": "Adjust the number of pods in a deployment depending on CPU utilization or other select metrics, which support cluster scale-in operations.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Use Vertical Pod Autoscaler (preview).",
            "description": "Rightsize your pods and dynamically set requests and limits based on historic usage.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Use Kubernetes Event Driven Autoscaling (KEDA).",
            "description": "Scale based on the number of events being processed. Choose from a rich catalogue of 50+ KEDA scalers.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Adopt a cloud financial discipline and cultural practice to drive ownership of cloud usage.",
            "description": "The foundation of enabling cost optimization is the spread of a cost saving cluster. A financial operations approach (FinOps) is often used to help organizations reduce cloud costs. It is a practice involving collaboration between finance, operations, and engineering teams to drive alignment on cost saving goals and bring transparency to cloud costs.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Sign up for Azure Reservations or Azure Savings Plan.",
            "description": "If you properly planned for capacity, your workload is predictable and exists for an extended period of time, sign up for an Azure Reservation or a savings plan to further reduce your resource costs.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Configure monitoring of cluster with Container insights.",
            "description": "Container insights help provides actionable insights into your clusters idle and unallocated resources. Container insights also supports collecting Prometheus metrics and integrates with Azure Managed Grafana to get a holistic view of your application and infrastructure.",
            "type": "recommendation"
        },
        {
            "waf": "Cost",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Configure the AKS Cost Analysis add-on.",
            "description": "The cost analysis cluster extension enables you to obtain granular insight into costs associated with various Kubernetes resources in your clusters or namespaces.",
            "type": "recommendation"
        },
        {
            "waf": "operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use a template-based deployment using Bicep, Terraform, or others. Make sure that all deployments are repeatable, traceable, and stored in a source code repo.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Build an automated process to ensure your clusters are bootstrapped with the necessary cluster-wide configurations and deployments. This is often performed using GitOps.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Use a repeatable and automated deployment processes for your workload within your software development lifecycle.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Enable diagnostics settings to ensure control plane or core API server interactions are logged.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Enable Container insights to collect metrics, logs, and diagnostics to monitor the availability and performance of the cluster and workloads running on it.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: The workload should be designed to emit telemetry that can be collected, which should also include liveliness and readiness statuses.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Use chaos engineering practices that target Kubernetes to identify application or platform reliability issues.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Optimize your workload to operate and deploy efficiently in a container.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Enforce cluster and workload governance using Azure Policy.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Review AKS best practices documentation.",
            "description": "To build and run applications successfully in AKS, there are key considerations to understand and implement. These areas include multi-tenancy and scheduler features, cluster, and pod security, or business continuity and disaster recovery.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Review Azure Chaos Studio.",
            "description": "Azure Chaos Studio can help simulate faults and trigger disaster recovery situations.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Configure monitoring of cluster with Container insights.",
            "description": "Container insights help monitor the performance of containers by collecting memory and processor metrics from controllers, nodes, and containers that are available in Kubernetes through the Metrics API and container logs.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Monitor application performance with Azure Monitor.",
            "description": "Configure Application Insights for code-based monitoring of applications running in an AKS cluster.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Configure scraping of Prometheus metrics with Container insights.",
            "description": "Container insights, which are part of Azure Monitor, provide a seamless onboarding experience to collect Prometheus metrics. Reference Configure scraping of Prometheus metrics for more information.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Adopt a multiregion strategy by deploying AKS clusters deployed across different Azure regions to maximize availability and provide business continuity.",
            "description": "Internet facing workloads should leverage Azure Front Door or Azure Traffic Manager to route traffic globally across AKS clusters.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Operationalize clusters and pods configuration standards with Azure Policy.",
            "description": "Azure Policy can help to apply at-scale enforcement and safeguards on your clusters in a centralized, consistent manner. It can also control what functions pods are granted and if anything is running against company policy.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Use platform capabilities in your release engineering process.",
            "description": "Kubernetes and ingress controllers support many advanced deployment patterns for inclusion in your release engineering process. Consider patterns like blue-green deployments or canary releases.",
            "type": "recommendation"
        },
        {
            "waf": "Operations",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: For mission-critical workloads, use stamp-level blue/green deployments.",
            "description": "Automate your mission-critical design areas, including deployment and testing.",
            "type": "recommendation"
        },
        {
            "waf": "performance",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Perform and iterate on a detailed capacity plan exercise that includes SKU, autoscale settings, IP addressing, and failover considerations.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "performance",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Enable cluster autoscaler to automatically adjust the number of agent nodes in response workload demands.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "performance",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Use the Horizontal pod autoscaler to adjust the number of pods in a deployment depending on CPU utilization or other select metrics.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "performance",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Perform ongoing load testing activities that exercise both the pod and cluster autoscaler.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "performance",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Separate workloads into different node pools allowing independent scalling.",
            "description": "",
            "type": "checklist"
        },
        {
            "waf": "Performance",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Develop a detailed capacity plan and continually review and revise.",
            "description": "After formalizing your capacity plan, it should be frequently updated by continuously observing the resource utilization of the cluster.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Kubernetes Service",
            "text": "Cluster architecture: Enable cluster autoscaler to automatically adjust the number of agent nodes in response to resource constraints.",
            "description": "The ability to automatically scale up or down the number of nodes in your AKS cluster lets you run an efficient, cost-effective cluster.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Kubernetes Service",
            "text": "Cluster and workload architectures: Separate workloads into different node pools and consider scaling user node pools.",
            "description": "Unlike System node pools that always require running nodes, user node pools allow you to scale up or down.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Use AKS advanced scheduler features.",
            "description": "Helps control balancing of resources for workloads that require them.",
            "type": "recommendation"
        },
        {
            "waf": "Performance",
            "service": "Azure Kubernetes Service",
            "text": "Workload architecture: Use meaningful workload scaling metrics.",
            "description": "Not all scale decisions can be derived from CPU or memory metrics. Often scale considerations will come from more complex or even external data points. Use KEDA to build a meaningful auto scale ruleset based on signals that are specific to your workload.",
            "type": "recommendation"
        }
    ],
    "categories": [],
    "waf": [
        {
            "name": "Security"
        },
        {
            "name": "Cost"
        },
        {
            "name": "operations"
        },
        {
            "name": "reliability"
        },
        {
            "name": "Operations"
        },
        {
            "name": "Performance"
        },
        {
            "name": "performance"
        },
        {
            "name": "security"
        },
        {
            "name": "cost"
        },
        {
            "name": "Reliability"
        }
    ],
    "yesno": [
        {
            "name": "Yes"
        },
        {
            "name": "No"
        }
    ],
    "metadata": {
        "name": "WAF Service Guides",
        "waf": "all",
        "state": "preview",
        "timestamp": "June 28, 2024"
    }
}